[
  "﻿TRƯỜNG ĐẠI HỌC ĐÔNG Á\tCỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆTNAM\nKHOA CÔNG NGHỆ THÔNG TIN\tĐộc lập - Tụ do - Hạnh phúc\nSổ:\t/KH-ĐHĐA-KCNTT\tĐà nẵng, ngàyy tháng yĩăm 2025\nKÉ HOẠCH\nV/v Triển khai Thực tập nhận thức đối vói sinh viên ngành Công nghệ thông tin và ngành Kỹ thuật máy tính, Bậc Đại học, hệ chính quy khóa 23A (2023-2027)\nCăn cứ Chương trình đào tạo áp dụng cho bậc Đại học Khóa 2023-202 7;\nCăn cứ Kế hoạch đào tạo năm học 2024-2025;\nNay Khoa Công nghệ thông tin (CNTT) triển khai học kì Thực tập nhận thức đối với sinh viên dại học, hình thức đào tạo chính quy khóa 23 (2023-2027), cụ thể như sau:\nA.\tĐÓI TƯỢNG ÁP DỤNG:\n- Toàn bộ sinh viên chính quy Khóa 23 ( 2023-2027) của ngành Công nghệ thông tin và ngành Kỹ thuật máy tính.\nB.\tMỤC TIÊU\n1.\tKiến thức:\n-\tCủng cố kiến thức đã được trang bị;\n-\tVận dụng nhũng kiến thức đã học để có thể tìm hiểu các hoạt động quản trị thực tế tại DN.\n2.\tKỹ năng:\n-\tThực hành được một số hoạt động tại nghiệp vụ tại DN;\n-\tRút ra được những kinh nghiệm để có thể vận dụng vào các công việc cụ thế liên quan dến công việc sau này;\n-\tRèn luyện kỹ năng giao tiếp, giải quyết vấn đề, quản lý thời gian.\n3.\tThái độ”\n-\tNhận thức đúng đắn ve nghề nghiệp chuyên môn của mình đang theo học;\n-\tCó ý thức tuân thủ các quy định và nội quy của phòng, công ty nơi thực tập, có tinh thần trách nhiệm cao đối với công việc được giao trong quá trình đi thực tập nghề nghiệp.\nc. KHUNG THỜI GIAN THỤC HIỆN\nKhóa\tNgành\tThực tập nhận thức\n23A (2023-2027)\t1.\tCông nghệ thông tin 2.\tKỹ thuật máy tính\tTuần 41 - 50 (26/05/2025 đến 01/08/2025)\nD. KÉ HOẠCH CÔNG VIỆC:\nTT\tNội dung công việc\tThỏi gian hoàn thành\tCá nhân/Đon vị phụ trách\n1\t-\tKhoa lập kế hoạch chi tiết, xây dựng nội dung thực tập phù hợp và dúng theo thời gian quy định theo thông báo. -\tHồ trợ tìm địa điểm thực tập cho sinh viên ( nếu sv cần ) -\tTổ chức cho sinh viên dăng ký nơi thực tập và tống hợp -\tLập danh sách phân công GVHD\t15/02- 15/04/2025\tLĐK, Giáo vụ, CVHT, GVHD\n2\tChuyển kế hoạch thực tập về Phòng ỌLĐT&CTSV\t16/4/-22/4/2025\tGiáo vụ Tố KH - Phòng ỌLĐT&CTSV\n3\tKhoa tập trung sinh viên, phổ biến kế hoạch thực tập và tiến hành bàn giao lớp cho GVHD phụ trách\t05/5-10/5/2025\tLĐK, Giáo vụ, CVHT. GVHD\nTT\tNội dung công việc\tThòi gian hoàn thành\tCá nhân/Đơn vị phụ trách\n4\tGVHD tổ chức gặp mặt sinh viên, hướng dẫn quá trình thực tập, thực hiện báo cáo và tiêu chí đánh giá kết quả TTNT\t12/5-17/05/2025\tGVHD, sv\n5\tGVHD dưa sinh viên đến địa điểm thực tập và tiến hành bàn giao sv cho dơn vị thực tập\t25,26/05 -01/08/2025\tLĐK, GVHD, sv\n6\tLĐK, GVHD kiểm tra thực té tình hình thực tập cùa sv\tTrong quá trình thực tập\tLĐK,GVHD\n7\tSinh viên triền khai viết báo cáo thực tập và nộp báo cáo cho GVHD ngay sau khi kết thúc đợt thực tập\t09/06-01/08/2025\tGVHD, sv\n8\tGVHD triển khai chấm báo báo thực tập\t02/08-10/08/2025\tGVHD, Giáo vụ\n9\tGVHD hoàn thành điểm và bàn giao điểm cho Phòng QLĐT&CTSV\t11/8-15/8/2025\tGVHD, Giáo vụ Tổ QLĐ - Phòng ỌLĐT&CTSV\n10\tTống kết đợt thực tập, đánh giá và rút kinh nghiệm Báo cáo, đề xuất phương án để hoàn thiện đợt thực tập\t1 tuần sau khi kết thúc đợt TTNT\tLĐK, GVHD\nE. TỎ CHỨC THỤC HIỆN\nTT\tNội dung/yêu cầu công việc\tThòi gian hoàn thành\nI. Sinh viên\t\t\n1\tChọn đề tài làm báo cáo thực tập Hoàn thành báo cáo thực tập dũng thời gian qui định theo sự hướng dẫn của giảng viên hướng dẫn Tham gia thực tập tại doanh nghiệp đúng thời gian qui định, Thu thập số liệu tài liệu dầy dù để thực hiện báo cáo thực tập. Hoàn thành nhật ký thực tập theo tuần trong quá trình thực tập và báo cáo kết quà hàng tuần cho giảng viên hướng dẫn. Thực hiện đúng văn hóa, nội quy, quy định tại doanh nghiệp\t20/05/2025 dến 22/07/2025\n2\tLiên hệ giảng viên hưóĩig dẫn dể báo cáo tiến độ và kết quả thực hiện trong suốt quá trình di thực tập nghề nghiệp\tHàng tuần\nII. Lãnh dạo khoa\t\t\n1\tLập kế hoạch và hồ sơ theo dõi quá trình thực tập của sinh viên các lóp thuộc Khoa quản lý phụ trách Xây dựng và hoàn thiện các biếu mẫu thống nhất để sử dụng cho sv trong Khoa\t1 tháng trước khi di thực tập\n2\tPhân công GVHD cho từng nhóm lớp/sinh viên\tTheo kế hoạch\n3\tĐôn đốc GVHD việc chuẩn bị và tổ chức gặp mặt sinh viên, hướng dẫn triển khai kế hoạch TTNT\tTheo kế hoạch\n4\tKiểm tra, giám sát quá trình thực tập của sinh viên và công tác hướng dần thực tập của GVHD\tTheo kế hoạch\n5\tBáo cáo tình hình thực hiện và tổng kết hoạt dộng triển khai thực tập của Khoa Đánh giá quá trình thực hiện và đưa ra đê xuât, giải pháp hoàn thiện\tTheo kế hoạch\nIII. Trách nhiệm của GVHD\t\t\n1\tLập hồ sơ theo dõi quá trình đi thực tập cùa sinh viên, chuẩn bị các biếu mẫu thống nhất sừ dụng cho sinh viên trong khoa.\tTrong quá trình thực tập\n2\tChịu trách nhiệm hướng dẫn dầy dủ, có trách nhiệm với sinh viên trong suốt thòi gian tham gia thực tập tại doanh nghiệp\tTrong quá trình thực tập\nTT\tNội dung/yêu cầu công việc\tThòi gian hoàn thành\n3\tThông báo lịch làm việc tại VP Khoa để sinh viên liên hệ báo cáo tiến độ thực hiện và kết quà nghiên cứu trong quá trình thực tập\tTheo kế hoạch\n4\tThu nhận bào cáo, đánh giá kết quà thực hiện và rèn luyện kỹ năng thực te cùa từng sinh viên trong thòi gian thực tập tại doanh nghiệp\tTrong quá trình thực tập\n5\tĐôn dôc sinh viên hoàn thành và nộp báo cáo thực tập đúng thòi gian quy định\tTheo kế hoạch\nV. Phòng Hành chính - Nhân sụ-\t\t\n1\tPhối họp với Khoa kiểm tra chân dung GVHD dược phân công\tTheo kế hoạch\nVI. Phòng QLĐT&CTSV\t\t\n1\tTriển khai kế hoạch thực tập chung đến các khoa\tTheo kế hoạch\n2\tĐôn đốc các đơn vị thực hiện theo đúng tiến độ đề ra.\tTheo kế hoạch\n3\tBáo cáo kịp thời các hạn chế, khó khăn trong qúa trình triển khai thực tập.\tTheo kế hoạch\nF. PHÂN CÔNG GIẢNG VIÊN HƯỚNG DẢN\n1.\tSố lượng sinh viên:\nSTT\tLóp\tSố lượng sinh viên\tGhi chú\n1\tST23A\t43\tNgành CNTT, chuyên ngành CNPM\n2\tST23B\t54\tNgành CNTT, chuyên ngành CNPM\n3\tST23C\t48\tNgành CNTT, chuyên ngành CNPM\n4\tST23D\t47\tNgành CNTT, chuyên ngành CNPM\n5\tGD23A\t36\tNgành CNTT, chuyên ngành TKĐH\n6\tGD23B\t24\tNgành CNTT, chuyên ngành TKĐH\n7\tCO23A\t8\tNgành Kỹ thuật máy tính\nTổng\t\t260\t\n2.\tPhân công giảng viên hướng dẫn\nSTT\tGVHD\tBiên chế\tSố lượng sv HD\tGhi chú\n1\tTS. Lương Văn Nghĩa\tGVCH\t42\t\n2\tThS. Nguyễn Quốc Vương\tGVCH\t20\t\n4\tThS. Tạ Quốc Ý\tGVCH\t39\t\n5\tThS. Hồ Thanh Phương\tGVCH\t31\t\n6\tThS. Trần Thị Ngọc Hà\tGVCH\t29\t\n7\tThS. Nhiêu Lập Hoà\tGVCH\t35\t\n8\tThS. Trương Văn Hiệu\tGVCH\t36\t\n9\tThS. Trần Thị Hoàng Oanh\tGVCH\t28\t\nTổng\t\t\t260\t\nTrên đây là Ke hoạch triển khai học kì thực tập nhận thức của ngành Công nghệ thông tin, ngành Kỹ thuật máy tính- thuộc Khoa Công nghệ thông tin, kính trình Ban Giám Hiệu và các phòng ban liên quan xem xét phê duyệt./.\nNơi nhận: -\tBan Giám hiệu; (Để chi dạo) -\tGV trong Khoa/Phòng/Ban; (Tồ chức thực hiện) -\tsv các khóa; (Đe thực hiện) -\tLưu: VPKhoa. PHÒNG HCNS BAN GIÁM HIỆU TS. Đỗ trọng TVăN\tLÃNH ĐẠO KHOA PHÒNG QLĐT&CTSvỀ^— ISĨ^qmễỉ^\nBỘ GIÁO DỤC VÀ ĐÀq TẠO TRƯỜNG ĐẠI HỌC ĐÔNG Á\nDANH SÁCH GIẢNG VIÊN\nHỤỚNG DÂN THỰC TẬP NHẬN THỨC\nBẬC ĐẠI HỌC CHÍNH QUY - NGÀNH CÔNG NGHỆ THÔNG TIN - CHUYÊN NGÀNH THIẾT KÉ ĐÒ HOẠ - KHÓA 2023 2027\n(Kềm theo kế hoạch sổ: ./K.CNTT-ĐHĐA)\nSTT\tGiảng viên hưóng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n1\tThS. Hồ Thanh Phương\t104237\tNguyễn Huỳnh Tuấn Anh\t04/01/2005\tGD23A\n2\tThS. Hồ Thanh Phương\t106321\tNguyễn Đức Bắc\t09/07/2005\tGD23A\n3\tThS. Hồ Thanh Phương\t104565\tLê Anh Cường\t11/08/2005\tGD23A\n4\tThS. Hồ Thanh Phương\t104427\tPhạm Tấn Cường\t09/04/2005\tGD23A\n5\tThS. Hồ Thanh Phương\t104327\tNguyễn Văn Đắc\t09/09/2003\tGD23A\n6\tThS. Hồ Thanh Phương\t106323\tNguyễn Tiến Đạt\t28/08/2005\tGD23A\n7\tThS. Hồ Thanh Phương\t100944\tHuỳnh Ngọc Đức\t10/10/2004\tGD23A\n8\tThS. Hồ Thanh Phương\t105333\tHuỳnh Phạm Văn Dương\t13/11/2005\tGD23A\n9\tThS. Hồ Thanh Phương\t104569\tTrần Phúc Hậu\t01/09/2005\tGD23A\n10\tThS. Hồ Thanh Phương\t105024\tPhan Trung Hiếu\t25/08/2005\tGD23A\n11\tTlĩS. Hồ Thanh Phương\t104383\tTrần Trung Hiếu\t20/03/2005\tGD23A\n12\tThS. Hồ Thanh Phương\t103908\tLê Đức Nhật Hoàng\t26/10/2004\tGD23A\n13\tThS. Hồ Thanh Phương\t105123\tNguyễn Huy Hoàng\t16/07/2005\tGD23A\n14\tThS. Hồ Thanh Phương\t105133\tTrương Đan Hùng\t09/06/2005\tGD23A\n15\tThS. Hồ Thanh Phương\t104101\tHồ Minh Hưng\t17/01/2005\tGD23A\n16\tThS. Hồ Thanh Phương\t102675\tĐặng Văn Hướng\t04/08/2005\tGD23A\n17\tThS. Hồ Thanh Phương\t105416\tTrần Mạnh Huy\t07/06/2005\tGD23A\n18\tThS. Hồ Thanh Phương\t106147\tVõ Văn Huy\t25/08/2005\tGD23A\n19\tThS. Hồ Thanh Phương\t105079\tĐoàn Ngọc Khang\t21/07/2005\tGD23A\n20\tThS. Hồ Thanh Phương\t103936\tNguyễn Anh Khoa\t05/05/2005\tGD23A\n21\tThS. Hồ Thanh Phương\t106116\tTrần Nguyễn Đăng Khoa\t04/03/2005\tGD23A\n22\tThS. Hồ Thanh Phương\t104368\tTrần Quốc Kiệt\t10/10/2005\tGD23A\n23\tThS. Hồ Thanh Phương\t105217\tNguyễn Công Lai\t25/05/2005\tGD23A\n24\tThS. Hồ Thanh Phương\t105395\tNguyễn Tấn Nhật Lâm\t13/10/2005\tGD23A\n25\tThS. Hồ Thanh Phương\t102575\tSiu H'mi Na\t04/07/2005\tGD23A\n26\tThS. Hồ Thanh Phương\t105044\tHuỳnh Đặng Bảo Nghiêm\t08/08/2005\tGD23A\n27\tThS. Hồ Thanh Phương\t102477\tTrương Thị Nhung\t14/05/2004\tGD23A\n28\tThS. Hồ Thanh Phương\t105252\tNgô Hoàng Phúc\t05/09/2005\tGD23A\n29\tThS. Hồ Thanh Phương\t102853\tNguyễn Lê Văn Phương\t16/11/2005\tGD23A\n30\tThS. Hồ Thanh Phương\t102797\tĐoàn Minh Quân\t06/02/2005\tGD23A\n31\tThS. Hồ Thanh Phương\t104329\tVũ Minh Quang\t01/09/2005\tGD23A\n32\tThS. Trần Thị Ngọc Ha\t104573\tTrương Đức Thảnh\t26/10/2005\tGD23A\n33\tThS. Trần Thị Ngọc Hà\t102660\tVõ Văn Hùng Thuận\t17/09/2005\tGD23A\n34\tThS. Trần Thị Ngọc Hà\t104559\tNguyễn Ngọc Minh Trí\t18/03/2005\tGD23A\n35\tThS. Trần Thị Ngọc Hà\t102532\tPhan Nguyễn Thanh Triều\t10/02/2005\tGD23A\n36\tThS. Trần Thị Ngọc Hà\t102130\tNguyễn Hoàng Yến\t08/10/2005\tGD23A\n37\tThS. Trần Thị Ngọc Hà\t105738\tĐoàn Phúc Anh\t05/09/2005\tGD23B\nSÍT\tGiảng viên hướng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n38\tThS. Trần Thị Ngọc Hà\t106469\tLê Hoàng Anh\t21/05/2005\tGD23B\n39\tThS. Trần Thị Ngọc Hà\t106142\tHuỳnh Đình Đức\t01/03/2005\tGD23B\n40\tThS. Trần Thị Ngọc Hà\t106339\tNguyễn Phan Việt Hoàng\t23/09/2000\tGD23B\n41\tThS. Trần Thị Ngọc Hà\t105553\tHuỳnh Đăng Kha\t19/10/2005\tGD23B\n42\tThS. Trần Thị Ngọc Hà\t104977\tNguyễn Văn Khải\t29/03/2005\tGD23B\n43\tThS. Trần Thị Ngọc Hà\t106027\tNgô Huỳnh Luân\t13/08/2005\tGD23B\n44\tThS. Trần Thị Ngọc Hà\t106922\tLê Anh Minh\t17/09/2004\tGD23B\n45\tThS. Trần Thị Ngọc Hà\t106528\tVõ Thị Thanh Nga\t02/01/2005\tGD23B\n46\tThS. Trần Thị Ngọc Hà\t105478\tTrần Thị Bích Ngọc\t29/03/2005\tGD23B\n47\tThS. Trần Thị Ngọc Hà\t106597\tTrương Hạnh Nguyên\t16/06/2003\tGD23B\n48\tThS. Trần Thị Ngọc Hà\t107075\tHoàng Quân\t01/07/2004\tGD23B\n49\tThS. Trần Thị Ngọc Hà\t105349\tNguyễn Hoàng Quyên\t08/10/2005\tGD23B\n50\tThS. Trần Thị Ngọc Hà\t105476\tTrần Công Sơn\t31/08/2005\tGD23B\n51\tThS. Trần Thị Ngọc Hà\t102222\tTrần Hoàng Đức Tài\t28/09/2004\tGD23B\n52\tThS. Trần Thị Ngọc Hà\t105782\tTrần Quang Thắng\t28/09/2005\tGD23B\n53\tThS. Trần Thị Ngọc Hà\t105015\tNguyễn Vũ Quang Thánh\t24/05/2005\tGD23B\n54\tThS. Trần Thị Ngọc Hà\t106082\tDương Minh Thành\t25/12/2005\tGD23B\n55\tThS. Trần Thị Ngọc Hà\t105009\tNguyễn Văn Thịnh\t07/08/2005\tGD23B\n56\tThS. Trần Thị Ngọc Hà\t105251\tVõ Lê Quốc Toàn\t15/01/2005\tGD23B\n57\tThS. Trần Thị Ngọc Hà\t105406\tĐoàn Thành Trung\t20/12/2005\tGD23B\n58\tThS. Trần Thị Ngọc Hà\t105391\tNguyễn Hồng Vân\t09/02/2005\tGD23B\n59\tThS. Trần Thị Ngọc Hà\t104796\tVõ Minh Việt\t13/12/2005\tGD23B\n60\tThS. Trần Thị Ngọc Hà\t106502\tĐồng Nguyễn Thuỳ Vy\t23/11/2005\tGD23B\nDS này có tông: 60 sv\nLÃNH ĐẠO KHOA\nPHỤ TRÁCH CHUYÊN NGÀNH\nBỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯ ỜNG ĐẠI HỌC ĐÔNG Á\nDANH SÁCH GIẢNG VIÊN\nHƯỚNG DẪN THỰC TẬP NHẬN THỨC\nBẬC ĐẠI HỌC CHÍNH QUY - NGÀNH CổNG NGHỆ THÔNG TIN -CHUYÊN NGÀNH CÔNG NGHỆ PHẦN MỀM - KHÓA 2023-2027\n(Kèm theo kế hoạch số: ./K.CNTT-ĐHĐA)\nSTT\tGiảng viên hướng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n1\tThS. Nhiêu Lập Hòa\t102236\tNguyễn Văn An\t29/07/2005\tST23A\n2\tThS. Nhiêu Lập Hòa\t102064\tNguyễn Việt Anh\t16/11/2004\tST23A\n3\tThS. Nhiêu Lập Hòa\t102779\tPhạm Khoa Bảo\t23/06/2005\tST23A\n4\tThS. Nhiêu Lập Hòa\t106155\tTrần Dũng Cảm\t07/03/2005\tST23A\n5\tThS. Nhiêu Lập Hòa\t104502\tPhạm Cao Cường\t23/01/2005\tST23A\n6\tThS. Nhiêu Lập Hòa\t104202\tNguyễn Văn Định\t06/03/2005\tST23A\n7\tThS. Nhiêu Lập Hòa\t105040\tLê Bá Minh Đức\t19/04/2005\tST23A\n8\tThS. Nhiêu Lập Hòa\t104671\tTrần Thùy Dương\t03/06/2005\tST23A\n9\tThS. Nhiêu Lập Hỏa\t104463\tLê Duy\t18/08/2005\tST23A\n10\tThS. Nhiêu Lập Hỏa\t104188\tVõ Hoài Giang\t16/09/2005\tST23A\n11\tThS. Nhiêu Lập Hòa\t106010\tHồ Thị Hằng\t10/02/2004\tST23A\n12\tThS. Nhiêu Lập Hòa\t102056\tNguyễn Ngọc Minh Hiếu\t26/03/1998\tST23A\n13\tThS. Nhiêu Lập Hòa\t104094\tTrần Ngọc Hoàng\t06/05/2005\tST23A\n14\tThS. Nhiêu Lập Hòa\t105375\tLưu Viết Hùng\t21/06/2005\tST23A\n15\tThS. Nhiêu Lập Hòa\t102243\tBùi Đức Huy\t14/05/2005\tST23A\n16\tThS. Nhiêu Lập Hòa\t105813\tPhan Văn Huy\t08/01/2005\tST23A\n17\tThS. Nhiêu Lập Hòa\t102261\tTrương Ngọc Anh Huy\t24/06/2005\tST23A\n18\tThS. Nhiêu Lập Hòa\t104087\tNgô Quốc Khánh\t31/03/2005\tST23A\n19\tThS. Nhiêu Lập Hòa\t102317\tTạ Hồng Khánh\t29/08/2005\tST23A\n20\tThS. Nhiêu Lập Hòa\t102624\tBùi Văn Lợi\t07/08/2005\tST23A\n21\tThS. Nhiêu Lập Hòa\t102484\tHuỳnh Trần Ngọc Lợi\t03/07/2005\tST23A\n22\tThS. Nhiêu Lập Hòa\t104339\tHoàng Ngọc Bảo Long\t29/10/2005\tST23A\n23\tThS. Nhiêu Lập Hòa\t102765\tNguyễn Phan Hoàng Long\t29/03/2005\tST23A\n24\tThS. Nhiêu Lập Hòa\t102468\tTrần Đình Long\t31/10/2005\tST23A\n25\tThS. Nhiêu Lập Hòa\t102101\tTưởng Nhật Long\t04/08/2005\tST23A\n26\tThS. Nhiêu Lập Hòa\t106025\tLê Quang Minh\t26/02/2005\tST23A\n27\tThS. Nhiêu Lập Hỏa\t104545\tNguyễn Võ Công Mừng\t10/08/2005\tST23A\n28\tThS. Nhiêu Lập Hòa\t104588\tĐoàn Xuân Nam\t09/10/2005\tST23A\n29\tThS. Nhiêu Lập Hòa\t104980\tLê Thị Ngọc Nguyên\t08/05/2005\tST23A\n30\tThS. Nhiêu Lập Hòa\t102603\tĐinh Thiên ơn\t23/10/2005\tST23A\n31\tThS. Nhiêu Lập Hòa\t102104\tTrần Thiên Phúc\t01/07/2002\tST23A\n32\tThS. Nhiêu Lập Hòa\t106158\tTrần Văn Sang\t04/06/2005\tST23A\n33\tThS. Nhiêu Lập Hòa\t102354\tTrương Nam Sơn\t16/11/2005\tST23A\n34\tThS. Nhiêu Lập Hòa\t106765\tHà Ngọc Tâm\t09/02/2005\tST23A\n35\tThS. Nhiêu Lập Hòa\t104395\tNguyễn Chí Tân\t11/05/2005\tST23A\n36\tThS. Tạ Quốc Y\t105715\tNguyễn Thanh Thiên\t06/09/2005\tST23A\nSTT\tGiảng viên hưóng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n37\tThS. Tạ Quốc Ý\t106852\tMai Văn Thuận\t29/07/2005\tST23A\n38\tThS. Tạ Quốc Ý\t104009\tPhạm Văn Tiến\t08/04/2005\tST23A\n39\tThS. Tạ Quốc Ý\t102050\tBùi Hải Trung\t27/08/2005\tST23A\n40\tThS. Tạ Quốc Ý\t106442\tHồ Văn Trường\t12/03/2005\tST23A\n41\tThS. Tạ Quốc Ý\t104481\tĐoàn Duy Tùng\t29/03/2005\tST23A\n42\tThS. Tạ Quốc Ý\t105701\tVõ Quốc Vương\t22/07/2005\tST23A\n43\tThS. Tạ Quốc Ý\t106439\tY-Hgoa\t19/08/2005\tST23A\n44\tThS. Trương Văn Hiệu\t105411\tNguyễn Võ Trường Sơn\t08/02/2004\tST23B\n45\tThS. Trương Văn Hiệu\t105208\tTrần Anh Tài\t29/10/2005\tST23B\n46\tThS. Trương Văn Hiệu\t105951\tLê Văn Tây\t18/01/2005\tST23B\n47\tThS. Trương Văn Hiệu\t102420\tNguyễn Viết Thắng\t07/08/2005\tST23B\n48\tThS. Trương Văn Hiệu\t105708\tTô Kim Thành\t21/01/2005\tST23B\n49\tThS. Trương Văn Hiệu\t106270\tVương Đình Thành\t30/10/2005\tST23B\n50\tThS. Trương Văn Hiệu\t104349\tNguyễn Thị Thanh Thư\t17/10/2005\tST23B\n51\tThS. Trương Văn Hiệu\t104552\tTrần Nguyễn Thanh Thủy\t23/12/2005\tST23B\n52\tThS. Trương Văn Hiệu\t104438\tLê Xuân Tính\t05/08/2005\tST23B\n53\tThS. Trương Văn Hiệu\t102122\tLê Thị Thúy Trinh\t26/01/2005\tST23B\n54\tThS. Trương Văn Hiệu\t104350\tPhạm Hồng Viên\t05/07/2005\tST23B\n55\tThS. Trương Văn Hiệu\t104293\tVũ Duy Vương\t21/03/2005\tST23B\n56\tTS. Lương Văn Nghĩa\t106248\tHoàng Trường Ân\t20/12/2005\tST23B\n57\tTS. Lương Văn Nghĩa\t106316\tNguyễn Võ Nhật Anh\t14/12/2005\tST23B\n58\tTS. Lương Văn Nghĩa\t106297\tTrần Khắc Anh\t17/04/2005\tST23B\n59\tTS. Lương Văn Nghĩa\t105833\tCao Đình Bảo\t23/08/2005\tST23B\n60\tTS. Lương Văn Nghĩa\t103993\tChâu Bảo\t12/10/2005\tST23B\n61\tTS. Lương Văn Nghĩa\t105426\tLa Trọng cầu\t20/07/2005\tST23B\n62\tTS. Lương Văn Nghĩa\t104628\tPhạm Thị Kim Chi\t19/09/2005\tST23B\n63\tTS. Lương Văn Nghĩa\t106389\tĐinh Xuân Chiến\t01/08/2005\tST23B\n64\tTS. Lương Văn Nghĩa\t105405\tPhạm Viết Chung\t28/08/2005\tST23B\n65\tTS. Lương Văn Nghĩa\t104591\tĐào Thành Công\t26/10/2005\tST23B\n66\tTS. Lương Văn Nghĩa\t105598\tNguyễn Tiến Đạt\t20/12/2005\tST23B\n67\tTS. Lương Văn Nghĩa\t105171\tPhạm Minh Đạt\t28/09/2005\tST23B\n68\tTS. Lương Văn Nghĩa\t105805\tLương Đức\t21/09/2005\tST23B\n69\tTS. Lương Văn Nghĩa\t104178\tNguyễn Khánh Duy\t04/11/2005\tST23B\n_70\tTS. Lương Văn Nghĩa\t106180\tLê Quốc Hải\t26/02/2005\tST23B\n71\tTS. Lương Văn Nghĩa\t105401\tNguyễn Hoàng Hiệp\t23/12/2005\tST23B\n72\tTS. Lương Vãn Nghĩa\t105854\tNgô Trương Hoàng\t24/02/2005\tST23B\n73\tTS. Lương Văn Nghĩa\t102139\tTrần Duy Huy Hoàng\t15/08/2005\tST23B\n74\tTS. Lương Văn Nghĩa\t104594\tNgô Quang Huy\t30/12/2005\tST23B\n75\tTS. Lương Văn Nghĩa\t105996\tPhạm Gia Huy\t11/08/2005\tST23B\n76\tTS. Lương Văn Nghĩa\t105267\tPhạm Trọng Bảo Huy\t22/10/2005\tST23B\n77\tTS. Lương Văn Nghĩa\t102039\tTạ Quang Khánh\t25/09/2005\tST23B\n78\tTS. Lương Văn Nghĩa\t102035\tVõ Chí Kiên\t10/09/2005\tST23B\n79\tTS. Lương Văn Nghĩa\t104370\tNguyễn Văn Kiệt\t25/05/2005\tST23B\n80\tTS. Lương Văn Nghĩa\t102357\tPang Ting Thành Buon Krong\t03/11/2005\tST23B\n81\tTS. Lương Văn Nghĩa\t105414\tNguyễn Đức Lâm\t08/01/2005\tST23B\nSTT\tGiảng viên hưóng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n82\tTS. Lương Văn Nghĩa\t106709\tLê Quang Linh\t05/12/2005\tST23B\n83\tTS. Lương Văn Nghĩa\t106177\tNguyễn Thành Luân\t30/06/2005\tST23B\n84\tTS. Lương Văn Nghĩa\t102176\tPhùng Ngọc Luân\t30/01/2005\tST23B\n85\tTS. Lương Văn Nghĩa\t104802\tHà Đức Lương\t16/11/2005\tST23B\n86\tTS. Lương Văn Nghĩa\t106041\tNguyễn Lê Tuấn Minh\t16/08/2005\tST23B\n87\tTS. Lương Văn Nghĩa\t102356\tVũ Thanh Ngân\t18/06/2005\tST23B\n88\tTS. Lương Văn Nghĩa\t106003\tĐinh Xuân Nghĩa\t17/10/2005\tST23B\n89\tTS. Lương Văn Nghĩa\t106436\tPhan Nhất Nguyên\t27/08/2005\tST23B\n90\tTS. Lương Văn Nghĩa\t105534\tĐinh Ngọc Thế Nhân\t17/03/2005\tST23B\n91\tTS. Lương Văn Nghĩa\t102299\tNguyễn Trần Nhật\t29/08/2005\tST23B\n92\tTS. Lương Văn Nghĩa\t102279\tHồ Hữu Phong\t20/04/2005\tST23B\n93\tTS. Lương Văn Nghĩa\t104939\tNguyễn Phan Hoàng Phong\t14/07/2005\tST23B\n94\tTS. Lương Văn Nghĩa\t104029\tPhan Tại Phúc\t13/02/2000\tST23B\n95\tTS. Lương Văn Nghĩa\t106084\tNguyễn Vũ Phước\t23/02/2005\tST23B\n96\tTS. Lương Văn Nghĩa\t104428\tTrần Minh Phương\t28/05/2005\tST23B\n97\tTS. Lương Văn Nghĩa\t105633\tHuỳnh Phước Quân\t01/09/2005\tST23B\n98\tThS. Nguyễn Quốc Vương\t102528\tĐặng Thọ Ngọc\t31/03/2005\tST23C\n99\tThS. Nguyễn Quốc Vương\t102395\tNguyễn Đức Nguyên\t29/10/2004\tST23C\n100\tThS. Nguyễn Quốc Vương\t102637\tNguyễn Nguyên Phong\t03/07/2004\tST23C\n101\tThS. Nguyễn Quốc Vương\t102062\tHoàng Trần Vĩnh Phúc\t08/10/2005\tST23C\n102\tThS. Nguyễn Quốc Vương\t104606\tNguyễn Đình Phương\t18/08/2005\tST23C\n103\tThS. Nguyễn Quốc Vương\t106411\tNguyễn Thị Thu Phương\t13/08/2005\tST23C\n104\tThS. Nguyễn Quốc Vương\t102509\tNguyễn Trọng Quốc\t15/12/2005\tST23C\n105\tThS. Nguyễn Quốc Vương\t102676\tVõ Văn Quyến\t23/08/2005\tST23C\n106\tThS. Nguyễn Quốc Vương\t104823\tTâm\t05/12/2004\tST23C\n107\tThS. Nguyễn Quốc Vương\t102751\tNguyễn Phương Trà\t24/08/2005\tST23C\n108\tThS. Nguyễn Quốc Vương\t102381\tBùi Thị Thùy Trâm\t03/05/2005\tST23C\n109\tThS. Nguyễn Quốc Vương\t104895\tNguyễn Minh Trung\t22/04/2005\tST23C\n110\tThS. Nguyễn Quốc Vương\t102512\tA Trưởng\t01/10/2005\tST23C\n111\tThS. Nguyễn Quốc Vương\t104582\tNguyễn Thị Hồng Vân\t20/03/2005\tST23C\n112\tThS. Nguyễn Quốc Vương\t104846\tLê Trọng Văn\t10/08/2005\tST23C\n113\tThS. Nguyễn Quốc Vương\t105369\tLê Đình Việt\t24/02/2005\tST23C\n114\tThS. Nguyễn Quốc Vương\t104933\tTrịnh Quang Vinh\t22/09/2005\tST23C\n115\tThS. Nguyễn Quốc Vương\t102358\tNguyễn Hoàng Vũ\t18/03/2005\tST23C\n116\tThS. Nguyễn Quốc Vương\t104714\tTrần Văn Hoàng Vũ\t16/06/2005\tST23C\n117\tThS. Nguyễn Quốc Vương\t105931\tĐoàn Đức Vương\t19/02/2005\tST23C\n118\tThS. Trần Thị Hoàng Oanh\t102110\tLê Nguyễn Quốc Anh\t16/04/2005\tST23C\n119\tThS. Trần Thị Hoàng Oanh\t102766\tNguyễn Quốc Anh\t19/06/2005\tST23C\n120\tThS. Trần Thị Hoàng Oanh\t105264\tHuỳnh Gia Bảo\t14/08/2005\tST23C\n121\tThS. Trần Thị Hoàng Oanh\t105775\tLê Văn Chí\t11/01/2005\tST23C\n122\tThS. Trần Thị Hoàng Oanh\t105195\tTrần Thanh Chiến\t18/03/2005\tST23C\n123\tThS. Trần Thị Hoàng Oanh\t106218\tNguyễn Tấn Cường\t03/06/2005\tST23C\n124\tThS. Trần Thị Hoàng Oanh\t102595\tTrương Tấn Đạt\t25/07/2005\tST23C\n125\tThS. Trần Thị Hoàng Oanh\t102527\tNguyễn Công Diễn\t08/02/2005\tST23C\n126\tThS. Trần Thị Hoàng Oanh\t104612\tLê Văn Hải\t06/11/2005\tST23C\n127\tThS. Trần Thị Hoàng Oanh\t102216\tLa Phúc Hân\t07/02/2004\tST23C\nSTT\tGiảng viên hưóng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n128\tThS. Trần Thị Hoàng Oanh\t104931\tĐặng Công Hiển\t23/10/2003\tST23C\n129\tThS. Trần Thị Hoàng Oanh\t104600\tTrần Văn Hiệp\t26/04/2005\tST23C\n,130\tThS. Trần Thị Hoàng Oanh\t102625\tLê Minh Hiếu\t05/07/2005\tST23C\n131\tThS. Trần Thị Hoàng Oanh\t102837\tĐỗ Ngọc Hoàng Huy\t07/11/2005\tST23C\n132\tThS. Trần Thị Hoàng Oanh\t102763\tTrần Khánh Huy\t29/05/2005\tST23C\n133\tThS. Trần Thị Hoàng Oanh\t104596\tNguyễn Kiều Khanh\t17/03/2005\tST23C\n134\tThS. Trần Thị Hoàng Oanh\t102721\tLê Duy Khánh\t19/08/2005\tST23C\n135\tThS. Trần Thị Hoàng Oanh\t104752\tNguyễn Tạ Thảo Kiên\t30/04/2005\tST23C\n136\tThS. Trần Thị Hoàng Oanh\t102628\tNguyễn Văn Kiên\t24/05/2005\tST23C\n137\tThS. Trần Thị Hoàng Oanh\t102636\tĐinh Văn Kịp\t06/07/2005\tST23C\n138\tThS. Trần Thị Hoàng Oanh\t102672\tVõ Văn Lãm\t15/01/2005\tST23C\n139\tThS. Trần Thị Hoàng Oanh\t102658\tĐoàn Phúc Lộc\t15/02/2005\tST23C\n140\tThS. Trần Thị Hoàng Oanh\t105012\tNguyễn Nhật Long\t24/03/2005\tST23C\n141\tThS. Trần Thị Hoàng Oanh\t102220\tTrần Bảo Long\t24/12/2005\tST23C\n142\tThS. Trần Thị Hoàng Oanh\t104608\tNguyễn Văn Luân\t18/05/2004\tST23C\n143\tThS. Trần Thị Hoàng Oanh\t102801\tVõ Viết Minh\t26/09/2005\tST23C\n144\tThS. Trần Thị Hoàng Oanh\t104590\tVõ Tấn Nam\t29/08/2005\tST23C\n145\tThS. Trần Thị Hoàng Oanh\t102710\tNguyễn Trung Nghĩa\t21/01/2005\tST23C\n146\tThS. Tạ Quốc Ý\t105025\tLê Ngọc Thiên Bảo\t22/04/2004\tST23D\n147\tThS.Tạ Quốc Ý\t105497\tLương Chí Bảo\t27/06/2005\tST23D\n148\tThS. Tạ Quốc Ý\t102323\tTrần Thị Ngọc Bích\t13/08/2002\tST23D\n149\tThS. Tạ Quốc Ý\t105684\tPhạm Hữu Bình\t09/03/2005\tST23D\n150\tThS.Tạ Quốc Ý\t105602\tNguyễn Văn Danh\t19/10/2005\tST23D\n151\tThS. Tạ Quốc Ý\t106419\tDương Tuấn Đạt\t19/12/2005\tST23D\n152\tThS. Tạ Quốc Ý\t106165\tThái Đình Đức\t06/11/2005\tST23D\n153\tThS. Tạ Quốc Ý\t106002\tHuỳnh Thanh Hiệp\t21/04/2005\tST23D\n154\tThS. Tạ Quốc Ý\t106408\tNguyễn Hữu Hoàng\t23/04/2005\tST23D\n155\tThS. Tạ Quốc Ý\t106431\tNguyễn Văn Hoàng\t13/01/2005\tST23D\n156\tThS. Tạ Quốc Ý\t104143\tNguyễn Xuân Hoàng\t26/02/2005\tST23D\n157\tThS. Tạ Quốc Ý\t104891\tHồ Hữu Duy Hưng\t26/09/2005\tST23D\n158\tThS. Tạ Quốc Ý\t104599\tHoàng Việt Hưng\t18/10/2005\tST23D\n159\tThS. Tạ Quốc Ý\t105688\tNguyễn Lê Hưng\t21/02/2005\tST23D\n160\tThS. Tạ Quốc Ý\t105815\tNguyễn Hữu Huy\t29/11/2005\tST23D\n161\tThS. Tạ Quốc Ý\t105307\tPhan Thanh Huy\t13/12/2005\tST23D\n162\tThS. Tạ Quốc Ý\t105341\tPhan Trần Xuân Huy\t11/03/2005\tST23D\n163\tThS. Tạ Quốc Ý\t104406\tPhạm Văn Khang\t01/08/2004\tST23D\n164\tThS.Tạ Quốc Ý\t105946\tThái Mai Nhật Khang\t24/05/2005\tST23D\n165\tThS. Tạ Quốc Ý\t103973\tNguyễn Văn Khánh\t26/05/2005\tST23D\n166\tThS. Tạ Quốc Ý\t105866\tTrịnh Hoàng Tuấn Kiệt\t01/01/2005\tST23D\n167\tThS. Tạ Quốc Ý\t106119\tHuỳnh Văn Linh\t18/06/2005\tST23D\n168\tThS.Tạ Quốc Ý\t105660\tQuách Thùy Linh\t25/01/2005\tST23D\n169\tThs. Trương Văn Hiệu\t105963\tXiêng Lăng Đức Mạnh\t17/10/2005\tST23D\n170\tThs. Trương Văn Hiệu\t105507\tPhạm Quang Minh\t12/12/2005\tST23D\n171\tThs. Trương Văn Hiệu\t106168\tHồ Thiên Ngân ■\t30/04/2005\tST23D\n172\tThs. Trương Vãn Hiệu\t105382\tNguyễn Đình Nhàng\t03/07/2005\tST23D\n173\tThs. Trương Văn Hiệu\t105263\tNguyễn Văn Pháp\t30/01/2005\tST23D\nSTT\tGiảng viên hướng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n174\tThs. Trương Văn Hiệu\t104494\tĐặng Đức Phát\t14/04/2005\tST23D\n175\tThs. Trương Văn Hiệu\t105556\tHồ Thanh Phong\t22/02/2005\tST23D\n176\tThs. Trương Văn Hiệu\t105469\tĐinh Ngọc Phước\t11/12/2004\tST23D\n177\tThs. Trương Văn Hiệu\t106388\tNguyễn Lưu Phước\t20/05/2005\tST23D\n178\tThs. Trương Văn Hiệu\t106020\tNguyễn Thanh Phước\t03/09/2005\tST23D\n179\tThs. Trương Văn Hiệu\t106695\tPhạm Kim Phước\t01/10/2005\tST23D\n180\tThs. Trương Văn Hiệu\t105018\tLê Văn Quy\t07/10/2005\tST23D\n181\tThs. Trương Văn Hiệu\t104963\tHuỳnh Đức Tài\t22/09/2005\tST23D\n182\tThs. Trương Văn Hiệu\t105408\tNguyễn Thanh Tân\t25/08/2005\tST23D\n183\tThs. Trương Văn Hiệu\t105761\tNguyễn Tiến Thănh\t19/05/2005\tST23D\n184\tThs. Trương Văn Hiệu\t105513\tNgô Phương Thảo\t16/03/2005\tST23D\n185\tThs. Trương Văn Hiệu\t105693\tLê Thanh Thiên\t10/03/2005\tST23D\n186\tThs. Trương Văn Hiệu\t104958\tLê Tấn Tiến\t22/11/2005\tST23D\n187\tThs. Trương Văn Hiệu\t104471\tTrương Văn Trường\t08/06/2005\tST23D\n188\tThs. Trương Văn Hiệu\t105847\tLê Nho Tuấn\t14/09/2005\tST23D\n189\tThs. Trương Văn Hiệu\t105519\tNguyễn Đoàn Tuấn\t31/05/2005\tST23D\n190\tThs. Trương Văn Hiệu\t106018\tRmah Viu\t08/05/2005\tST23D\n191\tThs. Trương Văn Hiệu\t105135\tĐặng Công Vũ\t13/09/2005\tST23D\n192\tThs. Trương Văn Hiệu\t105874\tNguyễn Đăng Vũ\t08/09/2005\tST23D\nDS này có tông: 192 sv\nPHỤ TRÁCH CHUYÊN NGÀNH\nLÃNH ĐẠO KHOA\nBỘ GIÁO DỤC VÀ ĐÀO TẠO\nTRƯỜNG ĐẠI HỌC ĐỐNG Á\nDANH SÁCH GIẢNG VIÊN\nHƯỚNG DẪN THỰC TẬP NHẬN THỨC\nBẬC ĐẠI HỌC CHÍNH QUỴ - NGÀNH KỸ THUẬT MÁY TÍNH KHÓA 2023-2027\n(Kèm theo kế hoạch số: ./K.CNTT-ĐHĐA)\nSTT\tGiảng viên hưóng dẫn\tIDSV\tHọ tên sinh viên\tNgày sinh\tLóp\n1.\tThS. Tạ Quốc Ý\t104792\tPhạm Như Việt Anh\t10/10/2005\tCO23A\n2.\tThS. Tạ Quốc Ý\t102621\tHoàng Anh Dũng\t26/04/2005\tCO23A\n3.\tThS. Tạ Quốc Ý\t102668\tNguyễn Văn Dũng\t11/11/2005\tCO23A\n4.\tThS. Tạ Quốc Ý\t105350\tHuỳnh Trần Trọng Hiếu\t02/10/2004\tCO23A\n5.\tThS. Tạ Quốc Ý\t102480\tNguyễn Văn Hoàng\t25/09/2005\tCO23A\n6.\tThS. Tạ Quốc Ý\t105796\tPhạm Văn Lạc\t15/12/2005\tCO23A\n7.\tThS. Tạ Quốc Ý\t106314\tTrần Lê Nguyên\t02/02/2005\tCO23A\n8.\tThS. Tạ Quốc Ý\t106386\tBùi Đình Sơn\t19/10/2005\tCO23A\nDS này có tông: 08 sv\nLÃNH ĐẠO KHOA\nPHỤ TRÁCH NGÀNH",
  "﻿     \n\n     BỘ GIÁO DỤC VÀ ĐÀO TẠO\n     TRƯỜNG ĐẠI HỌC ĐÔNG Á\n     \n     CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM\n     Độc lập - Tự do - Hạnh phúc\n     \n     ĐỀ CƯƠNG CHI TIẾT HỌC PHẦN\n     THỰC TẬP NHẬN THỨC\n     < INTRODUCTORY INTERNSHIP>\n     Mã số HP/Course Code:< INFO2138>\n1. Thông tin chung về học phần\n1.1. Tên học phần: Thực tập nhận thức\n                  < Introductory Internship >\n1.2. Số tín chỉ: 02\n1.3. Thời gian thực tập: \n 10 tuần\n1.4. Thời lượng và phân bổ nội dung\n\na) Thuyết \nSố giờ:  0\nA1. Lý thuyết\nSố giờ: 0\nA2. Chuyên đề (nếu có)\nSố giờ: 0\nb) Thực hành ứng dụng\nSố giờ: 0\nB1. Thí nghiệm/Thực hành\nSố giờ: 0\nB2. Bài tập lớn/đồ, đề án\nGiờ: 0\nB3. Thực tập\nThời gian thực tập:  10 tuần\nc) Hoạt động tự học \n(tự học/trả lời câu hỏi, thí nghiệm/dự án, đọc/nghiên cứu tài liệu)\n\n1.5.  Học phần tiên quyết: \n2. Mục tiêu học phần: \n     Học phần “Thực tập nhận thức” nhằm giúp sinh viên bước đầu tiếp cận với môi trường làm việc thực tế trong lĩnh vực chuyên ngành, qua đó hình thành tư duy nghề nghiệp, rèn luyện thái độ và kỹ năng cần thiết để sẵn sàng cho các đợt thực tập chuyên sâu và công việc trong tương lai.\n3. Chuẩn đầu ra của HP\n     Bảng 3.1. Chuẩn đầu ra (CĐR) của HP\n     Sau khi học xong học phần, sinh viên có khả năng:\nMã CĐR  HP\n     Chuẩn đầu ra HP (CLO)\n(1)\n     (2)\nCLO1\nTrình bày được mô hình tổ chức, chức năng, nhiệm vụ cơ bản của các bộ phận trong doanh nghiệp; tuân thủ nội quy và thể hiện được tác phong làm việc chuyên nghiệp.\nCLO2\nCó năng lực học tập và nghiên cứu theo hướng dẫn của doanh nghiệp/giảng viên hướng dẫn.\nCLO3\nVận dụng kiến thức học được tại doanh nghiệp để làm được sản phẩm/đề xuất giải pháp kỹ thuật/dịch vụ về sản phẩm theo yêu cầu đặt ra của doanh nghiệp.\n\n4. Mối liên hệ giữa CĐR HP (CLO) với CĐR CTĐT (PLO) \n     Bảng 4.1.Mối liên hệ của CĐR HP (CLO) đến CĐR của CTĐT (PLO)\nPLO\n1\n2\n3\n4\n5\n6\n7\n8\n9\nCLO1\nM\n\n\n\n\n\n\n\n\nCLO2\nR\n\n\n\n\n\n\n\n\nCLO3\nR\n\n\n\n\n\n\n\n\nChung\nM,A\n\n\n\n\n\n\n\n\n         Giải thích:  I= introduced; R= Reinforced/Opportunity to practice; M = Mastery at exit level, A: assessed\n5. Đánh giá HP\n5.1. Phương pháp, hình thức kiểm tra - đánh giá kết quả học tập của HP\nCác thành phần đánh giá\nTrọng số\n(%)\nPhương pháp đánh giá\nCông cụ đánh giá\nLiên quan đến CLO\nTrọng số CLO \n(%)\nĐánh giá CLO\nĐo lường đạt PLO/PI\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\nA1. Chuyên cần\n10%\nĐánh giá mức độ tham gia đầy đủ, đúng giờ, tuân thủ nội quy doanh nghiệp và quy định của học phần thực tập.\nRubric\nCLO1\n100%\nCLO1\nPLO1\nA2. Thường xuyên\n30%\nĐánh giá chất lượng ghi chép nhật ký thực tập hàng tuần: tính trung thực, nội dung quan sát, mô tả công việc, kỹ năng ghi nhận.\nRubric\nCLO1,\nCLO2, CLO3\n\nCLO1: 40%,\nCLO2: 30%, CLO3: 30%\n\n\nPLO1\nA3. Báo cáo cuối kỳ\n50%\n- Cấu trúc & hình thức: đúng mẫu, trình bày rõ ràng, logic. \n- Nội dung: mô tả trải nghiệm thực tế, phản tư cá nhân, kỹ năng và nhận thức nghề nghiệp. \n- Thái độ học tập: thể hiện qua tính trung thực, tinh thần cầu tiến trong báo cáo.\nRubric\nCLO1,\nCLO2, CLO3\n\nCLO1: 40%,\nCLO2: 30%, CLO3: 30%\n\n\nPLO1\nA4. Đánh giá từ doanh nghiệp\n10%\nPhiếu nhận xét từ đơn vị thực tập: thái độ, giao tiếp, tinh thần học hỏi, chấp hành nội quy.\nMẫu nhận xét\nCLO1,\nCLO2, CLO3\n\nCLO1: 40%,\nCLO2: 30%, CLO3: 30%\nCLO1, CLO2,\nCLO3\nPLO1\n5.2. Chính sách đối với HP\n     * Sinh viên phải tham gia tối thiểu 75% thời lượng thực tập (tương đương ít nhất 45/60 giờ tại doanh nghiệp) để đủ điều kiện được đánh giá kết thúc học phần. Nếu vắng mặt quá 25% (tức từ 16 giờ trở lên) mà không có lý do chính đáng và không được giảng viên hướng dẫn xác nhận, sinh viên sẽ không đủ điều kiện nộp báo cáo và không được công nhận kết quả học phần.\n     * Báo cáo thực tập và nhật ký hằng tuần là hai tài liệu bắt buộc. Sinh viên không nộp đúng hạn, có dấu hiệu sao chép, hoặc làm hình thức sẽ bị trừ điểm hoặc bị đánh giá là không đạt.\n     * Công cụ đánh giá chính là rubric theo từng tiêu chí, có thể kèm theo mẫu minh họa dành cho giảng viên hướng dẫn và đơn vị thực tập để đảm bảo tính khách quan và minh bạch.\n     * Sinh viên phải cam kết chấp hành nội quy thực tập, bảo mật thông tin doanh nghiệp, và thể hiện thái độ nghiêm túc, tác phong chuyên nghiệp, tôn trọng đơn vị tiếp nhận. Vi phạm sẽ bị xử lý theo quy định của nhà trường.\n     * Trong trường hợp nghỉ thực tập đột xuất, thay đổi địa điểm thực tập, hoặc gặp sự cố, sinh viên phải chủ động báo cáo kịp thời với giảng viên hướng dẫn và Khoa Công nghệ Thông tin để được hỗ trợ và xử lý phù hợp.\nCác tài liệu sinh viên bắt buộc phải nộp gồm: nhật ký thực tập, báo cáo thực tập (theo mẫu), bản tự đánh giá, phiếu nhận xét từ doanh nghiệp, và biên bản cam kết.\n6. Kế hoạch và nội dung giảng dạy HP (8 tuần)\n     Bảng 6.1. Kế hoạch và nội dung giảng dạy của HP theo tuần\nTuần\nNội dung bài học\nSố giờ\nKết quả của bài học (CLO)\nLiên quan quan đến CLO\nPhương pháp giảng dạy\nHoạt động học tập của học sinh\nĐánh giá\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n\n Tìm hiểu về doanh nghiệp thực tập: cơ cấu tổ chức, nội quy, văn hóa công sở, bộ phận CNTT.\n7.5\n\nCLO1\n- Giảng viên phổ biến, hướng dẫn định hướng \n- Hướng dẫn sinh viên liên hệ và lựa chọn doanh nghiệp \n- Tư vấn đề tài phù hợp năng lực cá nhân\n- Tham dự lớp, nghe phổ biến nội dung và yêu cầu học phần \n- Nghiên cứu tài liệu về văn hóa doanh nghiệp, mô hình tổ chức, bộ phận CNTT \n- Tìm hiểu doanh nghiệp dự kiến thực tập \n- Liên hệ đơn vị tiếp nhận thực tập \n- Chủ động trao đổi với giảng viên hướng dẫn về kế hoạch cá nhân\nA1 (Chuyên cần) \nA2 (Báo cáo tuần đầu: thông tin đơn vị, mục tiêu cá nhân, kế hoạch sơ bộ)\n2\nLựa chọn bài toán hoặc nội dung quan sát thực tiễn tại doanh nghiệp\n- Khám phá các hướng phát triển trong lĩnh vực CNTT\n- Xác định định hướng quan sát/phân tích cá nhân\n- (Nếu có nhóm): tổ chức nhóm, đăng ký đề tài chung\n7.5\n \nCLO2,\nCLO3\n- Giảng viên hướng dẫn cách xác định bài toán thực tiễn hoặc chủ đề quan sát phù hợp với môi trường doanh nghiệp \n- Gợi ý cách viết mô tả bài toán và kế hoạch làm việc sơ bộ\n- Tham khảo các mô hình thực tiễn tại doanh nghiệp \n- Thảo luận cùng bạn học (nếu làm theo nhóm) để thống nhất nội dung thực tập \n- Viết bản mô tả ngắn về bài toán, vấn đề, hoặc quy trình dự kiến quan sát \n- Gặp giảng viên trao đổi, phản biện và điều chỉnh nội dung đã chọn\nA1 (Chuyên cần) \nA2 (Báo cáo tuần 1: thông tin đơn vị thực tập, định hướng mục tiêu cá nhân, kế hoạch sơ bộ 10 tuần)\n3\n Quan sát hoạt động của bộ phận kỹ thuật tại doanh nghiệp\n- Lập trình, quản trị hệ thống, kiểm thử phần mềm, hỗ trợ kỹ thuật,...\n- Nhận diện các vị trí công việc trong quy trình công nghệ\n7.5\nCLO2\nCLO3\nCLO2,\nCLO3\n- Hướng dẫn cách ghi nhận thông tin thực tế thông qua quan sát \n- Gợi ý khung phân tích: vai trò, nhiệm vụ, tương tác giữa các vị trí trong doanh nghiệp\n- Quan sát trực tiếp hoạt động của các bộ phận chuyên môn (hoặc tìm hiểu gián tiếp nếu không được trực tiếp tham gia) \n- Ghi chép nhật ký công việc theo từng vị trí quan sát được \n- Phỏng vấn hoặc trao đổi nhanh với nhân viên (nếu có thể) để hiểu thêm nhiệm vụ và quy trình \n- So sánh với kiến thức lý thuyết đã học\nA1 (Chuyên cần) \nA2 (Nhật ký tuần 3: mô tả ít nhất 2 vị trí kỹ thuật, công việc điển hình, quy trình phối hợp)\n4\n Ghi chép nhật ký kỹ thuật \n– Phản ánh nội dung đã quan sát \n- Tổng hợp thông tin thu nhận được \n- Bắt đầu phân tích, phản tư ban đầu về quy trình, công việc, con người\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Hướng dẫn cách viết nhật ký kỹ thuật chi tiết, khoa học \n- Giới thiệu mẫu phản tư: “Tôi đã học được gì?”, “Tôi thấy điều gì thú vị/khác biệt?” \n- Nhận xét báo cáo tuần trước của sinh viên để điều chỉnh cách trình bày\n- Rà soát các nội dung đã quan sát trong 3 tuần đầu \n- Ghi nhật ký thực tập theo mẫu: mô tả công việc, công cụ, kỹ năng sử dụng, cách phối hợp trong nhóm \n- Viết phản hồi cá nhân: điều đã học được, điểm mới, khác biệt giữa lý thuyết và thực tế \n- Gặp giảng viên để được góp ý trực tiếp (nếu có). \nA2 (Nhật ký tuần 4: ghi chép kỹ thuật + đoạn phản tư tối thiểu 200 từ về nội dung quan sát và trải nghiệm cá nhân)\n5\nGiao tiếp, làm việc nhóm tại doanh nghiệp \n- Quan sát quy trình phối hợp giữa các thành viên trong nhóm kỹ thuật \n- Giao tiếp trong môi trường công sở (email, trao đổi trực tiếp, họp nhóm...)\n\t7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Giảng viên hướng dẫn cách giao tiếp chuyên nghiệp trong doanh nghiệp (online/offline) \n- Gợi ý các tình huống giao tiếp thực tế: trao đổi nhiệm vụ, trình bày kết quả, hỏi đáp kỹ thuật,... \n- Phản biện về vai trò của teamwork trong các dự án thực tế\n- Quan sát và mô tả cách các thành viên trong doanh nghiệp giao tiếp, phối hợp \n- Ghi nhận cách tổ chức họp nhóm, quản lý công việc (nếu có sử dụng công cụ như Trello, Jira, Slack,...)\n- Thực hành viết email trao đổi công việc hoặc ghi chú cuộc họp (giả định hoặc thực tế) \n- Viết đoạn phản hồi cá nhân về vai trò của giao tiếp & teamwork trong công việc\nA2 (Nhật ký tuần 5: mô tả cách giao tiếp và làm việc nhóm tại doanh nghiệp; ghi lại tình huống điển hình + phản tư cá nhân)\n6\nTìm hiểu công cụ, nền tảng và quy trình kỹ thuật cụ thể tại doanh nghiệp \n- Ví dụ: Git, GitHub, Visual Studio Code, MySQL, Jira, Trello, Docker,... \n- Kết nối với kiến thức đã học tại trường\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Hướng dẫn cách ghi chép và phân tích công cụ kỹ thuật theo tiêu chí: mục đích \n– cách sử dụng – vai trò trong quy trình \n- Gợi ý khung phản tư: \"Mình đã từng học/biết công cụ này ở đâu?\", \"Thực tế khác gì so với lý thuyết?\"\n- Ghi nhận các công cụ, nền tảng, quy trình mà doanh nghiệp đang sử dụng \n- Chọn tối thiểu 1 công cụ quen thuộc và 1 công cụ mới để mô tả chi tiết \n- So sánh giữa kiến thức đã học tại trường và thực tế sử dụng tại doanh nghiệp \n- Viết nhật ký phân tích công cụ và bài học rút ra\nA2 (Nhật ký tuần 6: mô tả và phân tích ít nhất 2 công cụ/nền tảng thực tế tại doanh nghiệp; phản tư về sự khác biệt với lý thuyết)\n7\nPhân tích quy trình/dự án hoặc tổ chức doanh nghiệp qua bài toán đã chọn \n- Tổng hợp thông tin từ các tuần trước \n- Bước đầu rút ra nhận xét, đánh giá ban đầu về cách doanh nghiệp vận hành, giải quyết vấn đề\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Hướng dẫn sinh viên phân tích bài toán đã quan sát dưới góc nhìn cá nhân \n- Gợi ý mô hình mô tả quy trình: sơ đồ, bảng phân tích nhiệm vụ, dòng công việc,... \n- Hướng dẫn cách viết phần \"Phân tích\" trong báo cáo cuối kỳ\n- Rà soát toàn bộ nhật ký từ tuần 1–6 \n- Tóm tắt lại nội dung bài toán hoặc quá trình đã theo dõi \n- Phân tích cấu trúc tổ chức, vai trò các bộ phận liên quan, công cụ hỗ trợ \n- Viết bản phân tích sơ bộ về bài toán hoặc quy trình doanh nghiệp đang thực hiện \n- Phản hồi với giảng viên để được điều chỉnh, góp ý\nA2 (Nhật ký tuần 7: bản tổng hợp và phân tích sơ bộ bài toán hoặc quy trình; thể hiện tư duy cá nhân và mức độ hiểu biết thực tế)\n8\nViết bản nháp báo cáo thực tập \n- Xây dựng cấu trúc báo cáo rõ ràng, hợp lý \n- Trình bày nội dung theo yêu cầu học phần \n- Phân biệt giữa mô tả – phân tích – phản tư\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Giảng viên hướng dẫn cấu trúc báo cáo thực tập nhận thức: Mở đầu, Nội dung chính, Nhận xét – phản tư cá nhân \n- Góp ý báo cáo mẫu và cách trình bày thông tin kỹ thuật một cách mạch lạc \n- Hướng dẫn cách trình bày biểu đồ, ảnh chụp màn hình, quy trình,...\n- Xây dựng đề cương chi tiết và nội dung bản nháp báo cáo cá nhân hoặc nhóm (nếu có) \n- Rà soát các phần: mô tả doanh nghiệp, nội dung quan sát, công cụ kỹ thuật, phân tích và phản tư \n- Trình bày thông tin theo định dạng chuẩn của học phần \n- Gửi bản nháp cho giảng viên góp ý và chỉnh sửa\nA2 (Bản nháp báo cáo thực tập: đầy đủ cấu trúc, trình bày rõ ràng; thể hiện nội dung quan sát và góc nhìn cá nhân bước đầu)\n9\nHoàn thiện nhật ký và báo cáo thực tập \n- Rà soát nội dung đã viết - Chỉnh sửa theo góp ý của giảng viên \n- Bổ sung phản tư tổng thể, nhận định cá nhân về quá trình thực tập\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Giảng viên rà soát và phản hồi bản nháp của sinh viên \n- Hướng dẫn sinh viên tự đánh giá kết quả đạt được so với mục tiêu ban đầu \n- Tư vấn cách cải thiện phần kết luận và phản tư cá nhân\n- Đọc lại toàn bộ nhật ký từ tuần 1–8 để thống nhất nội dung \n- Hoàn chỉnh báo cáo thực tập theo mẫu chuẩn \n- Bổ sung phần đánh giá bản thân: kỹ năng học được, nhận thức nghề nghiệp, điểm mạnh/yếu cá nhân \n- Kiểm tra chính tả, định dạng trình bày, minh họa hình ảnh, biểu đồ (nếu có)\nA2 (Bản hoàn chỉnh báo cáo + nhật ký thực tập đầy đủ, logic, có phản tư tổng thể rõ ràng)\n10\nTrình bày, nộp báo cáo và tự đánh giá quá trình thực tập \n- Tổng kết toàn bộ trải nghiệm trong 10 tuần \n- Trình bày định hướng nghề nghiệp cá nhân \n- Thu hồ sơ và phản hồi cuối kỳ\n7.5\nCLO2\nCLO3\nCLO2\nCLO3\n- Giảng viên hướng dẫn cách trình bày báo cáo (có thể thuyết trình nhóm/ngắn gọn tùy lớp) \n- Tổng kết, đánh giá học phần và phản hồi cho sinh viên \n- Hướng dẫn sinh viên lập kế hoạch học tập cá nhân dựa trên trải nghiệm thực tế\n- Trình bày nội dung báo cáo (bằng văn bản, thuyết trình trực tiếp hoặc nộp video/slideshow, tùy lớp) \n- Viết bản tự đánh giá quá trình thực tập: kết quả đạt được, khó khăn gặp phải, kỹ năng đã học \n- Xác định định hướng nghề nghiệp ngắn hạn/dài hạn sau đợt thực tập \n- Nộp đầy đủ các tài liệu: báo cáo, nhật ký, bảng cam kết, phiếu nhận xét doanh nghiệp\nA3 (Báo cáo cuối kỳ + thuyết trình/ ngắn gọn + bản tự đánh giá) A4 (Phiếu nhận xét từ doanh nghiệp)\n7. Học liệu: \n7.1. Sách, giáo trình chính thống & tham khảo: Tuỳ thuộc vào bài toán/dự án/đồ án mà sinh viên chọn lựa tài liệu phù hợp\n     Sinh viên sử dụng các tài liệu phù hợp với nội dung thực tập thực tế tại doanh nghiệp. Tùy theo bài toán, quy trình hoặc công nghệ được tiếp cận, sinh viên chủ động lựa chọn tài liệu tham khảo từ:\n     * Giáo trình các học phần đã học như: Kỹ thuật lập trình, Cơ sở dữ liệu, Mạng máy tính, Lập trình web, Lập trình hướng đối tượng,…\n     * Tài liệu nội bộ hoặc hướng dẫn kỹ thuật do doanh nghiệp cung cấp (nếu có).\n     * Tài liệu tham khảo quốc tế về kỹ năng thực tập, định hướng nghề nghiệp:\n* Get an Internship and Make the Most of It: Practical Information for High School and Community College Students – Joan E. McLachlan & Patricia Hess, Rowman & Littlefield (2013)\n* The Ultimate Guide to Internships: 100 Steps to Get a Great Internship and Thrive in It – Eric Woodard, Allworth Press (2015)\n* Internships: Theory and Practice – Andrew H. Van de Ven, Routledge (2020)\n7.2. Địa chỉ web hữu ích: Tùy thuộc vào bài toán/dự án/đồ án mà sinh viên chọn lựa tài liệu phù hợp:\n     * https://www.w3schools.com – học web cơ bản\n     * https://www.geeksforgeeks.org – thuật toán, lập trình\n     * https://docs.github.com – hướng dẫn Git và GitHub\n     * https://www.freecodecamp.org – thực hành lập trình\n     * https://roadmap.sh – định hướng nghề nghiệp CNTT theo từng mảng\n     * Trang tài liệu nội bộ doanh nghiệp (nếu được phép truy cập)\n8. Cơ sở vật chất GD: \n     -  Tùy theo cơ sở thực tập. \n     Ngày ký duyệt: 6/2023\n     Người ký duyệt:\n     Phụ trách khoa/Ngành\n     \n     \n     \n     \n     GV soạn\n     \n     \n     \n     \n\n     \n     \n",
  "﻿TRƯỜNG ĐẠI HỌC ĐÔNG Á\nKHOA CÔNG NGHỆ THÔNG TIN\n\n\n\n\n\nBÁO CÁO \nTHỰC TẬP NHẬN THỨC\nNĂM HỌC: 2024 - 2025\n\n       Đơn vị thực tập: \n       Địa chỉ: \n       \n        Giảng viên hướng dẫn:\n        Họ và tên sinh viên:\n        Lớp: \n       \n\nĐà Nẵng, ../…\n\t\n\nTRƯỜNG ĐẠI HỌC ĐÔNG Á\nKHOA CÔNG NGHỆ THÔNG TIN\n\n\n\n\n\nBÁO CÁO \nTHỰC TẬP NHẬN THỨC\nNĂM HỌC: 2024 - 2025\n    \n   \n       Họ tên sinh viên: \n       Lớp:\n       Điện thoại:\n       Email: \n\n\n\n\n\nĐà Nẵng, ../….\n\n\nMỤC LỤC\n[Sinh viên trình bày mục lục ở trang này]\n\n\n\nLỜI CẢM ƠN\n[Sinh viên trình bày lời cảm ơn ở trang này]\n\n\n\nCHƯƠNG 1: TỔNG QUAN VỀ ĐƠN VỊ THỰC TẬP\n\n1.1. Giới thiệu đơn vị thực tập\n\n\n1.2. Lĩnh vực hoạt động\n\n\n1.3. Văn hóa và môi trường làm việc\n\n\n1.4. Các quy trình làm việc\n\n\nCHƯƠNG 2: BÀI TOÁN/ĐỀ TÀI/DỰ ÁN\n\n2.1. Thực trạng và vấn đề hiện tại đang tồn đọng \n\n2.2. Phát biểu bài toán/đề tài/dự án \n\n2.3. Đề xuất các giải pháp kiến nghị để giải quyết bài toán/đề tài/dự án\n\n\n2.4. Xây dựng kế hoạch công việc cụ thể chi tiết để thực hiện\n\n\n\n\nCHƯƠNG 3: PHÂN TÍCH, THIẾT KẾ VÀ TRIỂN KHAI THỰC HIỆN BÀI TOÁN/ĐỀ TÀI/DỰ ÁN\n3.1. Tóm lược các nội dung quan trọng cần thực hiện\n\n\n3.2. Phân tích và thiết kế (nếu có)\n\n\n3.3. Đề xuất  giải pháp thực hiện\n\n\n3.4. Thực hiện và đánh giá kết quả đạt được \n\n\n\nCHƯƠNG 4: ĐÁNH GIÁ KẾT QUẢ THỰC TẬP \n\n4.1. Những kết quả đạt được/ cải thiện được và các đóng góp cho dự án/ đội nhóm của doanh nghiệp\n\n\n4.2. Khó khăn/ hạn chế chưa khắc phục được, đề ra hướng phát triển và giải quyết trong tương lai\n\n4.3. Bài học/ cảm nghĩ rút ra, đúc kết cho bản thân sau khi thực tập \n\n\n\n4.4. Đề xuất hoàn thiện Bài toán/đồ án/dự án (Hướng phát triển)\n\n\n\n\n\n\nPHỤ LỤC\nNHẬT KÝ CÔNG VIỆC HÀNG TUẦN\n1.1 Nhật ký công việc tuần …, từ ngày … đến ngày …\nThứ/Ngày\nCÔNG VIỆC\nXÁC NHẬN CỦA ĐƠN VỊ\n(Người giao nhiệm vụ)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTổng kết\nNhững việc làm được:\n\nNhững việc chưa làm được: \nBiện pháp khắc phục:\n\n\n\nBỘ GIÁO DỤC VÀ ĐÀO TẠO\tCỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM\n       TRƯỜNG ĐẠI HỌC ĐÔNG Á\tĐộc lập – Tự do – Hạnh phúc\n\nBẢN TỰ ĐÁNH GIÁ KẾT QUẢ CỦA SINH VIÊN THỰC TẬP\n\tKính gửi: (Đơn vị thực tập)\t\n      Trong thời gian thực tập thực tế tại đơn vị, được sự giúp đỡ, giao nhiệm vụ của Anh (Chị) \tthuộc bộ phận:\t\n      Em xin tự đánh giá kết quả đạt được như sau:\n1. Về chấp hành đúng nội quy, quy định của đơn vị thực tập\n\t\n\t\n2. Về việc thực hiện đúng công việc được phân công trong thời gian thực tập\n\t\n\t\n3. Về thời gian, giờ giấc của SV thực tập học việc\n\t\n\t\n4. Về thực hiện đúng Văn hóa nơi công sở và 12 điều Văn hóa Sinh viên Đông Á\n\t\n\t\n5. Về việc bảo vệ mọi bí mật về thông tin đơn vị mà SV thực tập, an toàn lao động\n\t\n6. Về đạo đức tác phòng trung thực trong công tác, tích cực học hỏi, thái độ cầu tiến.\n\t\n7. Về những đóng góp cho DN \n\t\n\t\n\tSinh viên tự đánh giá\n\t\t\t\t\t\t\t\t\t    (Ký và ghi rõ họ tên)\n\n\nBỘ GIÁO DỤC VÀ ĐÀO TẠO\tCỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM\nTRƯỜNG ĐẠI HỌC ĐÔNG Á\tĐộc lập – Tự do – Hạnh phúc\nNHẬN XÉT CỦA ĐƠN VỊ THỰC TẬP\nTên người chấm :\t\nHọc hàm, học vị :\t\nTên sinh viên : ……………………………….. Lớp : ……………………………….\nTên chuyên đề : \t\nA. Ý thức tổ chức kỷ luật :\nSinh viên đã làm việc tại đơn vị, xí nghiệp bao nhiêu buổi : 05 buổi/ tuần\nTrong thời gian làm việc: … – …\nThái độ : tốt, nghiêm túc chấp hành các kỷ luật\nB. Sinh viên đã nắm được vấn đề gì ? có sâu không ?\n1……………………………………………………………………………………\n2……………………………………………………………………………………\nC. Nhận xét góp ý cho sinh viên.\n1……………………………………………………………………………………\n2……………………………………………………………………………………\n3……………………………………………………………………………………\n\nD. Xếp loại và cho điểm:\n1. Xếp loại : Vui lòng khoanh tròn vào ô xếp loại :\nNội dung\nXếp loại\n1.Tinh thần thái độ\nA\nB+\nB\nC\n2.Năng lực lý thuyết\nA\nB+\nB\nC\n3.Năng lực tiếp cận thực tế\nA\nB+\nB\nC\n2. Xếp loại chung : \n3. Điểm của sinh viên đạt : … điểm( bằng chữ ………….)\n\tĐà nẵng , ngày ….. tháng ….. năm \n\tCán bộ hướng dẫn\n\t(Ký tên và ghi rõ họ tên)\n\n\nBỘ GIÁO DỤC VÀ ĐÀO TẠO\tCỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM\nTRƯỜNG ĐẠI HỌC ĐÔNG Á\tĐộc lập – Tự do – Hạnh phúc\nNHẬN XÉT CỦA GIÁO VIÊN HƯỚNG DẪN THỰC TẬP\nA.Về mặt hình thức báo cáo: \n\t\n\t\n\t\nB. Về mặt nội dung :\n1. Lý luận : \t\n\t\n\t\n2. Thực tế : \t\n\t\n\t\nC.Tinh thần , thái độ thực tập :\n\t\n\t\n\t\n\t\nD. Những thiếu sót , hạn chế :\n\t\n\t\n\t\n\t\nE. Xếp loại và cho điểm : Điểm số:……………… Điểm chữ:……………………… \n\tĐà Nẵng , ngày……. tháng …. năm ……..\n\tGiáo viên  hướng dẫn\n\n\n\n\nBỘ GIÁO DỤC VÀ ĐÀO TẠO\tCỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM\nTRƯỜNG ĐẠI HỌC ĐÔNG Á\tĐộc lập – Tự do – Hạnh phúc\nPHIẾU ĐÁNH GIÁ THỰC TẬP (LÀM VIỆC) CHO SINH VIÊN\nĐơn vị thực tập: \nĐịa chỉ: \nHọ tên sinh viên: \nThời gian SV thực tập: Từ ngày … đến ngày …\nSinh viên làm việc tại bộ phận:………………….………………………………….......\nI. Đánh giá của Đơn vị thực tập\n Xin vui lòng đánh dấu “x” vào ô được lựa chọn ở mục “Mức độ xếp loại”\nMức 1: Rất thấp = 1 điểm; Mức 2: thấp = 2 điểm; Mức 3: vừa = 3 điểm; \nMức 4: cao = 4 điểm; Mức 5: rất cao = 5 điểm\n1. Đánh giá thái độ:\nNội dung\nMức độ xếp loại\n\n1\n2\n3\n4\n5\n1. SV đi làm đúng giờ, đầy đủ các ngày trong tuần\n\n\n\n\n\n2. SV có vắng mặt nhiều không, bao nhiêu buổi\n\n\n\n\n\n3.Thái độ làm việc tích cực, nghiêm túc\n\n\n\n\n\n4. SV có sẵn sàng làm những việc mà đơn vị yêu cầu\n\n\n\n\n\n5. SV có mạnh dạn giao tiếp, thân thiện với mọi người trong đơn vị\n\n\n\n\n\n\n2. SV làm mảng việc nào là tích cực nhất trong thời gian làm việc (xếp theo mức độ tích cực nhất trước)\n……….……….……….……….……….……….…………………………………….\n……….……….……….……….……….……….…………………………………….\n3. Trong quá trình làm việc SV thể hiện năng lực chuyên môn rõ nét ở những nội dung gì?\n……….……….……….……….……….……….…………………………………….\n……….……….……….……….……….……….…………………………………….\n\n4. Doanh nghiệp có hài lòng với SV ở những kỹ năng gì và những phẩm chất gì?\nNội dung\nMức độ xếp loại\n\n1\n2\n3\n4\n5\nA. Kỹ năng:\n\n\n\n\n\n1. Làm việc nhóm\n\n\n\n\n\n2. Giao tiếp, thuyết trình\n\n\n\n\n\n3. Tổ chức công việc hiệu quả\n\n\n\n\n\n4. Lắng nghe\n\n\n\n\n\n5. Giải quyết vấn đề\n\n\n\n\n\n6. Sử dụng công nghệ thông tin\n\n\n\n\n\nB. Phẩm chất:\n\n\n\n\n\n1.Trung thực\n\n\n\n\n\n2.Thẳng thắn\n\n\n\n\n\n3.Trách nhiệm\n\n\n\n\n\n4. Làm việc chăm chỉ, thông minh\n\n\n\n\n\n5. Luôn có mục tiêu, kiên trì thực hiện\n\n\n\n\n\n6. Có thiện chí học hỏi\n\n\n\n\n\n\n5. Doanh nghiệp mong muốn SV nâng cao kỹ năng gì và thái độ ra sao?\n\n\n\n\nII. Xếp loại\nNội dung\nMức độ xếp loại\n\n1\n2\n3\n4\n5\n1. Thái độ tích cực Doanh nghiệp hài lòng\n\n\n\n\n\n2. Tham gia các công việc gắn với chuyên môn\n\n\n\n\n\n3. Kỹ năng làm việc chuyên nghiệp\n\n\n\n\n\n4. Mức độ hài lòng chung của Doanh nghiệp\n\n\n\n\n\n\n7. Xếp loại chung của Nhà trường dựa trên đánh giá của Doanh nghiệp\n………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………\n\nNgày thành lập Đơn vị:…………………………\nĐịa chỉ mail đơn vị:……………………………………\nĐiện thoại đơn vị:……………………………….\nCán bộ phụ trách SV thực tập:…………………\nSố điện thoại của CB phụ trách:……………….\nLÃNH ĐẠO ĐƠN VỊ\n(Ký tên & đóng dấu)\n\n\n\n\n\n\n\n\n\n\n\n\n3\n\n\n",
  "﻿CỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆT NAM\nĐộc lập – Tự do – Hạnh phúc\n\nBIÊN BẢN CAM KẾT CHẤP HÀNH NỘI QUY VÀ KẾ HOẠCH CÔNG VIỆC KHI THỰC TẬP NHẬN THỨC TẠI DOANH NGHIỆP\n(Dành cho sinh viên ngành CNTT, ĐH. Đông Á – Khóa 23)\n\nI. THÔNG TIN CÁ NHÂN SINH VIÊN\nHọ và tên:\t\nMã số sinh viên:\t\nLớp:\t\nSố điện thoại:\t\nEmail:\t\nĐơn vị thực tập:\t\nThời gian thực tập: Từ ngày …/…./……..  đến ngày …/…./……….\nII. CAM KẾT TUÂN THỦ NỘI QUY VÀ TÁC PHONG LÀM VIỆC\n1. Về thái độ và tác phong làm việc\n    * Cam kết tuân thủ đầy đủ nội quy, quy định của doanh nghiệp và nhà trường.\n    * Giữ gìn tác phong làm việc chuyên nghiệp: đúng giờ, lịch sự, tôn trọng người hướng dẫn và đồng nghiệp.\n2. Về kỷ luật\n    * Không nghỉ thực tập nếu không có lý do chính đáng.\n    * Thông báo cho giảng viên và đơn vị thực tập nếu có thay đổi lịch trình.\n3. Về bảo mật và tài sản\n    * Tuyệt đối không sử dụng thông tin, tài liệu của doanh nghiệp cho mục đích cá nhân.\n    * Không sao chép, chụp ảnh, ghi âm, quay phim nếu không được phép.\n4. Về hiệu quả công việc\n    * Chủ động học hỏi, quan sát và hỗ trợ đúng phạm vi cho phép.\n    * Thực hiện đầy đủ nhật ký công việc hằng tuần, phản ánh trung thực nội dung đã làm, kiến thức tiếp thu và kỹ năng rèn luyện.\n    * Lập kế hoạch công việc theo tuần và nộp đúng hạn cho giảng viên hướng dẫn, phối hợp với người hướng dẫn tại doanh nghiệp.\n    * Báo cáo tiến độ thực tập định kỳ và hoàn thành báo cáo cuối kỳ theo đúng hướng dẫn, có xác nhận của doanh nghiệp và giảng viên.\n    * Tuyệt đối không sao chép, làm hình thức trong nhật ký, báo cáo; tự chịu trách nhiệm về chất lượng và nội dung công việc đã thực hiện.\n5. Về an toàn và pháp luật\n    * Cam kết đảm bảo an toàn lao động, phòng cháy chữa cháy, an ninh thông tin.\n    * Không có hành vi vi phạm pháp luật, đạo đức nghề nghiệp, chuẩn mực văn hóa.\n6. Về xử lý vi phạm\n   Nếu vi phạm cam kết, tôi hoàn toàn chịu trách nhiệm trước nhà trường và đơn vị thực tập, bao gồm việc:\n    * Bị chấm dứt thực tập.\n    * Không được đánh giá kết quả học phần.\n    * Xử lý kỷ luật tùy theo mức độ vi phạm.\n    Tôi xin cam kết thực hiện đầy đủ các nội dung trên. Nếu vi phạm, tôi hoàn toàn chịu trách nhiệm trước Khoa và Nhà trường về kết quả học phần thực tập nhận thức của mình.\n…………………., ngày ...... tháng ...... năm 2025\n\nNgười cam kết \n(Ký tên, ghi rõ họ tên)\n\n\nGiảng viên hướng dẫn\n(Ký tên, ghi rõ họ tên)\n\n\n\n\n\n\n\n    (Biên bản được lưu tại Khoa CNTT và sử dụng để đối chiếu trong quá trình đánh giá kết quả học phần Thực tập Nhận thức)\n",
  "﻿TRƯỜNG ĐẠI HỌC ĐÔNG Á\nKHOA CNTT\nSố:          /KH-KCNTT\nCỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆTNAM\nĐộc lập - Tự do - Hạnh phúc\nĐà Nẵng, ngày …. tháng … năm …….\nHƯỚNG DẪN THỰC TẬP NHẬN THỨC\nÁp dụng cho sinh viên Đại học Chính quy, ngành CNTT – Khóa ….. – ….\n      \n    Căn cứ vào Chương trình đào tạo ngành Công nghệ Thông tin, trình độ Đại học, áp dụng cho Khóa: …… - ……… của Trường Đại học Đông Á;\n    Thời gian thực tập: từ ngày …/…./…….. đến ngày … /…../………\n    Căn cứ vào Kế hoạch đào tạo năm học: …….. – ………..  của Khoa Công nghệ Thông tin;\n    Căn cứ vào mục tiêu tăng cường năng lực thực hành, định hướng nghề nghiệp và kết nối thực tiễn cho sinh viên thông qua hoạt động thực tập tại doanh nghiệp;\n    Khoa Công nghệ Thông tin ban hành tài liệu hướng dẫn triển khai thực tập nhận thức dành cho sinh viên Khóa …., hệ Đại học chính quy, nhằm thống nhất nội dung, thời gian, phương thức tổ chức và trách nhiệm của các bên liên quan trong quá trình thực tập nhận thức.\nI. THÔNG TIN CHUNG\n1. Đối tượng\n    Đối tượng tham gia thực tập nhận thức là sinh viên năm 2, ngành Công nghệ Thông tin, hệ Đại học chính quy, thuộc Khóa …… – …… của Trường Đại học Đông Á.\n    Tại thời điểm thực tập, sinh viên đã hoàn thành giai đoạn học các học phần cơ sở và nền tảng chuyên ngành, bao gồm kiến thức về lập trình, cơ sở dữ liệu, cấu trúc dữ liệu, công cụ văn phòng, tư duy thuật toán, và kỹ năng cơ bản trong quản lý dự án phần mềm.\n    Đây là thời điểm phù hợp để sinh viên bước đầu tiếp cận với môi trường doanh nghiệp, hình thành nhận thức nghề nghiệp và kết nối kiến thức lý thuyết với thực tiễn công việc.\n2. Thời gian thực tập\n* Thời gian bắt đầu: …./…./……..\n* Thời gian kết thúc: …./…./……..\n* Tổng thời lượng: 10 tuần (theo lịch thực tập do nhà trường quy định)\n    Trong thời gian này, sinh viên sẽ tham gia vào các hoạt động quan sát, hỗ trợ, tìm hiểu, thực hành tại doanh nghiệp theo kế hoạch của đơn vị tiếp nhận. Đồng thời, sinh viên sẽ duy trì liên hệ định kỳ với giảng viên hướng dẫn để cập nhật tiến độ và nhận sự hỗ trợ cần thiết.\n3. Địa điểm thực tập\n    Sinh viên sẽ được phân công thực tập tại các doanh nghiệp hoạt động trong lĩnh vực CNTT, phần mềm, viễn thông, giải pháp số,… tại địa phương hoặc các vùng lân cận. Danh sách doanh nghiệp sẽ được cập nhật theo từng đợt thực tập.\n    \n    Việc phân bổ sinh viên đến các doanh nghiệp được căn cứ theo năng lực, định hướng học tập, và vị trí địa lý thuận lợi nhằm đảm bảo tính hiệu quả và phù hợp với nội dung đào tạo.\n4. Giảng viên phụ trách\n    Mỗi nhóm sinh viên được phân công một giảng viên hướng dẫn thuộc Khoa Công nghệ Thông tin – Trường Đại học Đông Á. Giảng viên có nhiệm vụ:\n* Hướng dẫn sinh viên về kế hoạch, nội dung thực tập.\n* Duy trì liên lạc thường xuyên để hỗ trợ xử lý tình huống phát sinh.\n* Theo dõi tiến độ, thu nhận nhật ký thực tập và đánh giá báo cáo cuối kỳ.\n    Giảng viên hướng dẫn sẽ được Khoa CNTT phân công hằng năm theo danh sách cụ thể gửi kèm công văn đến từng đơn vị tiếp nhận.\nII. MỤC TIÊU CỦA THỰC TẬP NHẬN THỨC\n    Thực tập nhận thức là bước khởi đầu giúp sinh viên Công nghệ Thông tin làm quen với môi trường doanh nghiệp, hiểu được yêu cầu thực tế của nghề nghiệp và định hình hướng phát triển chuyên môn. Mục tiêu được cụ thể hóa trên ba phương diện: kiến thức – kỹ năng – thái độ. Trong phần này, trình bày chi tiết về kiến thức mà sinh viên cần đạt được sau kỳ thực tập:\n1. Về kiến thức\n    • Hiểu tổng quan về môi trường làm việc trong doanh nghiệp CNTT\n    Sinh viên được tiếp cận và quan sát trực tiếp mô hình tổ chức, không gian làm việc, văn hóa nội bộ, cách thức vận hành của một doanh nghiệp trong lĩnh vực công nghệ thông tin hoặc viễn thông. Qua đó, sinh viên:\n    * Nhận diện được các phòng ban chức năng như: Phòng kỹ thuật, phòng phát triển phần mềm, bộ phận chăm sóc khách hàng, quản lý mạng, bảo trì thiết bị,...\n    * Hiểu vai trò, nhiệm vụ của các vị trí công việc như lập trình viên, kỹ sư hệ thống, kỹ thuật viên mạng, quản trị viên cơ sở dữ liệu, QA/QC,...\n    • Nhận biết quy trình triển khai dự án phần mềm, hệ thống mạng hoặc kỹ thuật phần cứng\n    Sinh viên được giới thiệu hoặc tham gia quan sát các bước chính trong quy trình triển khai dự án tại doanh nghiệp, ví dụ:\n    * Tiếp nhận yêu cầu khách hàng.\n    * Phân tích – thiết kế – lập trình – kiểm thử – triển khai phần mềm.\n    * Cài đặt – cấu hình – vận hành hệ thống mạng nội bộ hoặc mạng diện rộng.\n    * Triển khai thiết bị đầu cuối, bảo trì phần cứng, xử lý sự cố người dùng.\n    Quy trình được cụ thể hóa qua các phương pháp thực tiễn như Scrum, Agile, ITIL, hoặc mô hình xử lý sự cố trong hệ thống mạng doanh nghiệp.\n    • Nắm bắt các công cụ, nền tảng và công nghệ đang được sử dụng thực tế\n    Thông qua quan sát hoặc trải nghiệm hỗ trợ kỹ thuật tại đơn vị, sinh viên có thể nhận biết và học hỏi một số công nghệ, công cụ phổ biến như:\n    * Công cụ phát triển phần mềm: Git, GitHub, GitLab, Visual Studio Code, IntelliJ, Postman.\n    * Ngôn ngữ lập trình: Python, JavaScript, HTML/CSS, SQL,...\n    * Hệ quản trị cơ sở dữ liệu: MySQL, PostgreSQL, SQL Server.\n    * Nền tảng phát triển web và ứng dụng: React, Node.js, Laravel.\n    * Công cụ quản lý hệ thống và mạng: Cisco Packet Tracer, Wireshark, Zabbix, hệ thống kiểm soát truy cập, giám sát hạ tầng mạng.\n    * Hệ điều hành phổ biến: Windows Server, Ubuntu/Linux, hệ điều hành nhúng trong thiết bị mạng.\n    Ngoài ra, sinh viên cũng được tìm hiểu cách thức làm việc nhóm thông qua các công cụ như Trello, Slack, Notion, Google Workspace, và cách các doanh nghiệp tổ chức quy trình vận hành – bảo mật – sao lưu – khôi phục hệ thống.\n    Trong bối cảnh các doanh nghiệp ngày càng mở rộng hoạt động theo hướng ứng dụng công nghệ cao như chuyển đổi số, trí tuệ nhân tạo, IoT, blockchain,…, sinh viên cần hiểu rằng mỗi đơn vị tiếp nhận thực tập sẽ có mô hình tổ chức, sản phẩm, quy trình và công nghệ đặc thù riêng biệt.\n    Ngoài việc quan sát, hỗ trợ kỹ thuật hoặc vận hành hệ thống, sinh viên cần chủ động tìm hiểu các mảng hoạt động trọng yếu của doanh nghiệp, bao gồm:\n    * Giới thiệu sản phẩm và dịch vụ tới khách hàng\n    * Tư vấn, bán hàng, chăm sóc khách hàng\n    * Tham gia triển khai giải pháp CNTT cho các đối tác\n    Đặc biệt, với một số doanh nghiệp có bộ phận phát triển phần mềm, nhóm sinh viên có thể được tham gia trực tiếp vào các dự án lập trình thực tế, như:\n    * Viết module nhỏ cho hệ thống đang phát triển\n    * Tham gia chỉnh sửa – tối ưu mã nguồn theo hướng dẫn\n    * Kiểm thử (test) và ghi nhận lỗi phần mềm\n    * Viết tài liệu kỹ thuật, giao diện người dùng, hoặc hỗ trợ triển khai demo sản phẩm\n    Đây là cơ hội quý giá để sinh viên:\n    * Vận dụng kiến thức đã học vào công việc thực tế\n    * Hiểu rõ quy trình phát triển phần mềm chuyên nghiệp (Agile/Scrum, GitFlow, CI/CD…)\n    * Xây dựng kỹ năng làm việc nhóm và phối hợp kỹ thuật – nghiệp vụ\n    * Phát triển ý tưởng đề tài khóa luận gắn với bài toán thực tế\n    Với tinh thần đó, sinh viên cần ghi chép đầy đủ nhật ký, mô tả rõ ràng những gì đã quan sát – học hỏi – tham gia, đồng thời phản tư và đề xuất hướng phát triển cá nhân sau mỗi tuần thực tập.\n\n2. Về kỹ năng\n    Thông qua quá trình quan sát, hỗ trợ kỹ thuật và tham gia các công việc đơn giản tại doanh nghiệp, sinh viên sẽ có cơ hội phát triển nhiều kỹ năng thiết yếu cho sự nghiệp sau này. Mục tiêu cụ thể như sau:\n     Làm quen với quy trình làm việc chuyên nghiệp (Scrum/Agile/Kanban nếu có)\n    Sinh viên được tìm hiểu và tiếp cận các phương pháp tổ chức công việc hiện đại đang được doanh nghiệp CNTT áp dụng, chẳng hạn:\n    * Scrum: Sinh viên được quan sát quy trình phân chia Sprint, tham dự họp nhóm (daily standup), xem cách phân công và quản lý công việc của từng thành viên.\n    * Agile: Hiểu nguyên lý linh hoạt trong phát triển phần mềm, cách doanh nghiệp nhanh chóng phản hồi yêu cầu thay đổi từ khách hàng.\n    * Kanban: Quan sát cách sắp xếp công việc theo cột: To do – In Progress – Done, sử dụng bảng Trello/Jira để quản lý công việc.\n    Mục tiêu của nội dung này là giúp sinh viên hiểu rõ cách một dự án thực tế vận hành từ khâu lên ý tưởng đến triển khai và hoàn thiện.\n    Giao tiếp, làm việc nhóm, viết báo cáo kỹ thuật:\n    Trong quá trình thực tập, sinh viên sẽ rèn luyện và cải thiện các kỹ năng mềm quan trọng:\n    * Giao tiếp chuyên nghiệp: Biết cách trao đổi thông tin với nhân viên doanh nghiệp, tiếp cận, lắng nghe và đặt câu hỏi đúng trọng tâm để học hỏi hiệu quả.\n    * Làm việc nhóm: Quan sát cách các thành viên trong nhóm phối hợp với nhau trong cùng một dự án. Nếu được phân công việc, sinh viên cần phối hợp nhịp nhàng và biết hỗ trợ lẫn nhau.\n    * Viết báo cáo kỹ thuật: Ghi nhận lại những nội dung đã học và thực hành dưới dạng văn bản kỹ thuật: mô tả công việc, phân tích hệ thống, sơ đồ mạng, hoặc báo cáo mô tả lỗi – cách xử lý – kết quả,...\n    • Kỹ năng ghi chép nhật ký công việc, đánh giá hiệu quả làm việc\n    Sinh viên sẽ thực hiện nhật ký thực tập theo tuần – nội dung bao gồm:\n    * Công việc đã làm.\n    * Kiến thức học được.\n    * Kỹ năng đã áp dụng.\n    * Vấn đề phát sinh (nếu có) và cách xử lý.\n    Ngoài ra, sinh viên cần tự đánh giá hiệu quả làm việc, ví dụ:\n    * So sánh giữa mục tiêu đề ra và kết quả thực tế đạt được.\n    * Đưa ra đề xuất cá nhân nhằm nâng cao hiệu quả công việc.\n    Việc thực hành kỹ năng nhật ký và tự đánh giá giúp sinh viên rèn luyện thói quen tư duy phản biện, có cái nhìn toàn diện và chủ động học tập từ trải nghiệm thực tế.\n3. Về thái độ\n    Thực tập nhận thức không chỉ là cơ hội để sinh viên tiếp cận kiến thức và kỹ năng thực tiễn, mà còn là giai đoạn quan trọng để hình thành và rèn luyện thái độ chuyên nghiệp, từ đó tạo nền tảng vững chắc cho sự phát triển sự nghiệp sau này. Cụ thể:\n    • Tuân thủ nội quy, văn hóa doanh nghiệp\n    Sinh viên cần thể hiện thái độ nghiêm túc, tôn trọng quy định và chuẩn mực hành vi tại nơi thực tập, bao gồm:\n* Chấp hành nội quy về giờ giấc làm việc, trang phục, sử dụng tài sản chung,...\n* Không sử dụng thiết bị cá nhân vào mục đích riêng khi chưa được phép.\n* Giữ gìn tài sản, bảo mật thông tin, không quay phim – chụp ảnh trái phép tài liệu của công ty.\n* Tuân thủ các quy định về an toàn lao động, phòng cháy chữa cháy và an ninh thông tin.\n    Bên cạnh đó, sinh viên cần thể hiện thái độ tôn trọng đối với cán bộ công ty, người hướng dẫn, và đồng nghiệp, từ cách xưng hô, giao tiếp, đến cách xử lý các tình huống phát sinh trong công việc.\n    • Có tinh thần học hỏi, chủ động giao tiếp và hoàn thành nhiệm vụ\n    Khi được giao nhiệm vụ, dù nhỏ, sinh viên cần:\n    * Thực hiện nghiêm túc và có trách nhiệm, không ỷ lại hay trốn tránh.\n    * Chủ động tìm hiểu thông tin liên quan, đặt câu hỏi với người hướng dẫn khi chưa rõ.\n    * Tích cực giao tiếp, hòa nhập với môi trường xung quanh, xây dựng mối quan hệ tốt trong nhóm làm việc.\n    * Tự tạo động lực học hỏi: quan sát – ghi chép – phân tích – phản ánh – đúc kết.\n    Thái độ học tập tích cực chính là yếu tố phân biệt giữa một sinh viên “đi thực tập” và một người “đang rèn luyện để làm nghề”. Tinh thần này sẽ giúp sinh viên tiến bộ nhanh hơn, gây ấn tượng tốt với doanh nghiệp, và có thể mở ra cơ hội hợp tác lâu dài sau khi ra trường.\nIII. NỘI DUNG SINH VIÊN CẦN THỰC HIỆN\n1. Trước khi đi thực tập\n    Giai đoạn chuẩn bị trước khi đi thực tập đóng vai trò quan trọng giúp sinh viên định hướng rõ ràng, hiểu được yêu cầu của doanh nghiệp và kế hoạch thực tập cá nhân. Các hoạt động cần thực hiện bao gồm:\n    • Tham gia buổi gặp mặt định hướng của khoa\n    Trước thời điểm bắt đầu thực tập, khoa Công nghệ Thông tin sẽ tổ chức buổi gặp mặt chính thức giữa:\n    * Sinh viên thực tập,\n    * Giảng viên hướng dẫn,\n    * Đại diện khoa (nếu có)\n    Trong buổi gặp, sinh viên sẽ được:\n    * Giới thiệu tổng quan về kế hoạch thực tập nhận thức (thời gian, mục tiêu, yêu cầu).\n    * Phổ biến các quy định, nội quy cần tuân thủ khi tham gia tại doanh nghiệp.\n    * Được giải đáp các thắc mắc về hồ sơ, nhật ký thực tập, báo cáo cuối kỳ.\n    * Nhận lời khuyên, chia sẻ kinh nghiệm từ các giảng viên hoặc sinh viên khóa trước.\n    Sinh viên bắt buộc phải tham dự đầy đủ, đúng giờ và ghi chép đầy đủ nội dung buổi gặp mặt, xem đây như bước \"onboarding\" đầu tiên của kỳ thực tập.\n    • Nhận giấy giới thiệu và kế hoạch thực tập cá nhân\n    Sau buổi định hướng, sinh viên sẽ được:\n    • Nhận Giấy giới thiệu có dấu xác nhận của trường, trình bày khi đến doanh nghiệp.\n    • Nhận kế hoạch thực tập cá nhân, trong đó có:\n    * Thông tin doanh nghiệp được phân công.\n    * Tên giảng viên hướng dẫn.\n    * Lịch trình tổng thể của kỳ thực tập.\n    * Các biểu mẫu cần sử dụng: nhật ký thực tập, báo cáo, mẫu đánh giá của doanh nghiệp,...\n    Việc tiếp nhận đầy đủ các giấy tờ, tài liệu này là điều kiện để sinh viên được chính thức bắt đầu thực tập.\n    • Cam kết tuân thủ quy định doanh nghiệp\n    Sinh viên cần ký cam kết tuân thủ các quy định tại nơi thực tập, bao gồm:\n    * Cam kết thực hiện nghiêm túc thời gian, nhiệm vụ được giao.\n    * Không vi phạm đạo đức nghề nghiệp, không gây ảnh hưởng tiêu cực đến hình ảnh nhà trường tại doanh nghiệp.\n    * Bảo mật thông tin nội bộ, tuyệt đối không chia sẻ dữ liệu công việc khi chưa được phép.\n    Bản cam kết này sẽ được lưu tại khoa và giảng viên hướng dẫn để làm cơ sở đánh giá đạo đức nghề nghiệp trong kỳ thực tập.\n2. Trong thời gian thực tập\n    Thời gian thực tập tại doanh nghiệp là giai đoạn quan trọng nhất trong toàn bộ kế hoạch thực tập nhận thức. Trong suốt thời gian từ ngày …./…/…… đến …./…./…….., sinh viên cần thể hiện tinh thần nghiêm túc, chủ động học hỏi và tuân thủ đúng các yêu cầu của nhà trường cũng như đơn vị tiếp nhận. Cụ thể:\n    • Tham gia đầy đủ lịch trình doanh nghiệp sắp xếp\n    Sinh viên phải có mặt đúng giờ, đúng ngày theo lịch làm việc của doanh nghiệp. Điều này bao gồm:\n    * Tham gia các buổi họp nhóm, phổ biến nội quy, giới thiệu mô hình tổ chức công ty.\n    * Làm việc đúng thời gian hành chính, trừ khi doanh nghiệp có lịch thay đổi linh hoạt (phải có xác nhận).\n    * Thông báo sớm và có lý do chính đáng nếu cần vắng mặt đột xuất (có sự chấp thuận của cả doanh nghiệp và giảng viên hướng dẫn).\n    Việc tham gia đầy đủ giúp sinh viên xây dựng ý thức chuyên nghiệp và tạo được ấn tượng tốt với doanh nghiệp.\n    • Thực hiện các công việc quan sát, hỗ trợ kỹ thuật, ghi chép\n    Tùy vào vị trí và khả năng chuyên môn, sinh viên có thể được giao những nhiệm vụ phù hợp như:\n    * Quan sát quy trình xử lý công việc, ghi chép cách vận hành hệ thống, hoặc triển khai dự án CNTT.\n    * Hỗ trợ kỹ thuật đơn giản như: kiểm tra kết nối mạng, cấu hình thiết bị, nhập dữ liệu, sửa lỗi phần mềm cơ bản,...\n    * Tham gia hỗ trợ xử lý sự cố dưới sự giám sát của nhân sự công ty.\n    * Được giao nhiệm vụ nhỏ (viết đoạn mã, xây dựng giao diện, xử lý lỗi, thống kê dữ liệu,...) để thử sức và học hỏi thực tiễn.\n    Toàn bộ hoạt động này cần được ghi chép rõ ràng và phản ánh lại trong nhật ký thực tập.\n    • Hoàn thành nhật ký thực tập hàng tuần\n    Mỗi sinh viên phải duy trì nhật ký thực tập theo tuần với các nội dung:\n    * Công việc đã tham gia trong tuần.\n    * Kiến thức và kỹ năng học được.\n    * Các vấn đề phát sinh và cách khắc phục (nếu có).\n    * Cảm nhận cá nhân và định hướng cải thiện.\n    Nhật ký cần được viết trung thực, ngắn gọn nhưng đầy đủ, và được giảng viên hướng dẫn kiểm tra định kỳ. Đây là tài liệu bắt buộc trong hồ sơ đánh giá cuối kỳ.\n    * Liên hệ giảng viên hướng dẫn để cập nhật tiến độ và phản ánh khó khăn\n    * Sinh viên cần báo cáo tiến độ hằng tuần cho giảng viên hướng dẫn thông qua hình thức: email, tin nhắn, Google Form hoặc họp nhóm online tùy theo hướng dẫn cụ thể.\n    * Nếu có vướng mắc về chuyên môn, giao tiếp, hoặc mâu thuẫn tại nơi thực tập, sinh viên cần chủ động trao đổi với giảng viên để được hỗ trợ kịp thời.\n    * Giảng viên có thể tiến hành kiểm tra thực địa, gọi điện hoặc tổ chức buổi trao đổi giữa các nhóm sinh viên để đảm bảo chất lượng thực tập.\n    Việc duy trì liên lạc này sẽ giúp sinh viên tránh bị động và giữ được sự kết nối với trường trong suốt quá trình thực tập tại doanh nghiệp.\n3. Cuối kỳ thực tập\n    Sau khi hoàn thành thời gian thực tập tại doanh nghiệp (từ ngày 26/05/2025 đến 01/08/2025), sinh viên bước vào giai đoạn tổng kết, đánh giá và hoàn thiện hồ sơ báo cáo. Đây là bước quan trọng để hệ thống lại quá trình học tập thực tiễn, thể hiện năng lực phản tư và khả năng trình bày thông tin một cách logic, mạch lạc.\n\n    • Viết báo cáo thực tập: theo mẫu chuẩn của khoa (5–10 trang)\n    Sinh viên phải hoàn thành một báo cáo thực tập nhận thức theo mẫu quy định của khoa CNTT. Cấu trúc báo cáo thông thường bao gồm:\n1. Trang bìa (có đầy đủ thông tin cá nhân, doanh nghiệp, giảng viên hướng dẫn).\n2. Nhận xét xác nhận từ doanh nghiệp (có chữ ký, con dấu nếu có).\n3. Lời mở đầu.\n4. Giới thiệu doanh nghiệp (mô hình tổ chức, lĩnh vực hoạt động,...).\n5. Nội dung thực tập:\no Công việc đã tham gia.\no Kiến thức – kỹ năng thu nhận được.\no Quy trình, công nghệ, công cụ đã tiếp cận.\n6. Nhận xét – đánh giá – đề xuất cải thiện.\n7. Kết luận.\n8. Phụ lục: Nhật ký thực tập, hình ảnh (nếu có), biểu mẫu doanh nghiệp,...\n    Yêu cầu:\n    • Độ dài từ 5–10 trang, font chữ Times New Roman, cỡ 13, giãn dòng 1.5.\n    • Ngôn ngữ rõ ràng, chính xác, không mắc lỗi chính tả.\n    • Tài liệu có thể nộp bản mềm và/hoặc bản in theo yêu cầu của giảng viên/khoa.\n    • Trình bày nội dung đã học, đã làm, đánh giá kết quả và tự nhận xét\n    Bên cạnh mô tả công việc cụ thể, sinh viên cần thể hiện được:\n    * Tư duy phản biện khi nhìn lại quá trình thực tập.\n    * Tự đánh giá khả năng học hỏi, thích nghi và mức độ hoàn thành công việc.\n    * Rút ra bài học thực tế và so sánh với kiến thức đã học trên giảng đường.\n    * Đưa ra định hướng cá nhân về chuyên ngành sẽ theo đuổi trong tương lai.\n    Đây là phần thể hiện rõ nhất năng lực và thái độ học tập của sinh viên, do đó cần được viết nghiêm túc, có chiều sâu và cá nhân hóa nội dung, tránh sao chép, viết chung chung.\n• Gửi báo cáo cho giảng viên hướng dẫn đúng thời hạn quy định\n• Báo cáo phải được nộp đúng thời gian quy định.\n• Kênh nộp: email cá nhân giảng viên, Google Drive chung, hệ thống quản lý học tập (nếu có hướng dẫn).\n• Sinh viên cần chủ động xác nhận với giảng viên khi đã gửi báo cáo, tránh thất lạc hoặc hiểu nhầm về thời hạn.\n• Một số giảng viên có thể yêu cầu nộp bản cứng có ký tên – sinh viên cần in ấn, đóng gáy đầy đủ và nộp trực tiếp tại văn phòng khoa theo lịch hẹn.\nViệc tuân thủ hạn nộp báo cáo là căn cứ để đánh giá điểm rèn luyện và điểm học phần của sinh viên.\nIV. VAI TRÒ VÀ HỖ TRỢ TỪ DOANH NGHIỆP\n    Doanh nghiệp giữ vai trò then chốt trong việc cung cấp môi trường học tập thực tiễn và hỗ trợ sinh viên trải nghiệm các hoạt động nghề nghiệp một cách trực tiếp. Để đảm bảo hiệu quả và mục tiêu của kỳ thực tập nhận thức, doanh nghiệp cần phối hợp với nhà trường và sinh viên theo các nội dung sau:\n    • Phân công người phụ trách/supervisor hỗ trợ nhóm sinh viên\n    Mỗi đơn vị tiếp nhận cần chỉ định một cán bộ chuyên môn hoặc nhân sự quản lý (gọi là người hướng dẫn tại doanh nghiệp hoặc supervisor) để:\n    * Phân công công việc phù hợp với khả năng và trình độ của sinh viên.\n    * Giám sát quá trình làm việc, đảm bảo sinh viên tuân thủ đúng nội quy, quy trình.\n    * Hướng dẫn nghiệp vụ, giải thích các nội dung chuyên môn giúp sinh viên hiểu rõ công việc và hệ thống đang vận hành.\n    * Phối hợp phản hồi với giảng viên hướng dẫn của trường trong trường hợp cần thiết.\n    * Người hướng dẫn tại doanh nghiệp là cầu nối quan trọng giữa thực tiễn doanh nghiệp và chương trình đào tạo của nhà trường.\n    • Tạo điều kiện tham gia các hoạt động kỹ thuật (lắp đặt, bảo trì, viết tài liệu, test,...)\n    Doanh nghiệp hỗ trợ sinh viên được quan sát và trực tiếp tham gia vào các công việc kỹ thuật phù hợp, ví dụ:\n    * Thi công lắp đặt thiết bị mạng, camera, hệ thống server,...\n    * Cấu hình và kiểm tra hoạt động của hệ thống mạng hoặc phần mềm.\n    * Hỗ trợ viết tài liệu kỹ thuật, test phần mềm, xử lý lỗi cơ bản.\n    * Tham gia họp nhóm kỹ thuật nội bộ, để hiểu thêm về cách tổ chức và xử lý vấn đề trong thực tế.\n    Các hoạt động này không chỉ giúp sinh viên củng cố lý thuyết mà còn rèn luyện được kỹ năng nghề nghiệp và khả năng thích nghi trong môi trường chuyên nghiệp.\n    • Tạo môi trường làm việc thực tế, chia sẻ quy trình, công nghệ\n    Doanh nghiệp nên:\n    * Chia sẻ quy trình làm việc nội bộ, các mô hình quản lý (Scrum, Agile, ITIL...).\n    * Giới thiệu công nghệ đang sử dụng: công cụ phát triển phần mềm, hệ thống mạng, dịch vụ cloud, hệ thống giám sát,...\n    * Khuyến khích sinh viên trao đổi, đặt câu hỏi, giúp các em hiểu sâu hơn về các tình huống thực tế và giải pháp xử lý trong công việc.\n    Một môi trường cởi mở, chuyên nghiệp sẽ thúc đẩy sinh viên học tập chủ động, nâng cao sự tự tin và tạo động lực nghề nghiệp rõ ràng.\n    * Ký xác nhận thời gian và nội dung thực tập cho sinh viên\n    Kết thúc quá trình thực tập, doanh nghiệp cần:\n    * Xác nhận sinh viên đã hoàn thành đúng thời gian thực tập.\n    * Ghi nhận nội dung công việc mà sinh viên đã tham gia.\n    * Đánh giá mức độ chuyên cần, tinh thần học hỏi, kỹ năng phối hợp,... (theo mẫu nhà trường cung cấp).\n    Biểu mẫu xác nhận và nhận xét từ doanh nghiệp sẽ là căn cứ quan trọng để giảng viên hướng dẫn đánh giá kết quả thực tập của sinh viên.\nV. VAI TRÒ CỦA GIẢNG VIÊN HƯỚNG DẪN\n    Giảng viên hướng dẫn giữ vai trò kết nối giữa nhà trường – doanh nghiệp – sinh viên, là người đồng hành chuyên môn và hỗ trợ học thuật trong suốt quá trình sinh viên thực tập. Việc hướng dẫn chủ động, sát sao và kịp thời sẽ góp phần nâng cao chất lượng học tập thực tiễn của sinh viên. Nhiệm vụ cụ thể như sau:\n    • Phối hợp với doanh nghiệp trong quá trình thực tập\n    Ngay từ khi sinh viên được phân công về doanh nghiệp, giảng viên hướng dẫn cần:\n• Liên hệ với người phụ trách tại doanh nghiệp để nắm rõ thời gian, điều kiện thực tập và nội dung công việc dự kiến giao cho sinh viên.\n• Cập nhật phản hồi từ doanh nghiệp trong suốt thời gian sinh viên thực tập, xử lý các tình huống phát sinh (nếu có).\n• Đảm bảo sự kết nối ba bên (doanh nghiệp – sinh viên – nhà trường) luôn thông suốt và hiệu quả.\n    Sự phối hợp tích cực sẽ giúp sinh viên không bị “bỏ rơi” trong quá trình thực tập, đồng thời doanh nghiệp cũng cảm thấy được hỗ trợ và hợp tác chặt chẽ.\n   • Hướng dẫn sinh viên thực hiện nhật ký, báo cáo, giải đáp thắc mắc\n    Giảng viên cần:\n• Hướng dẫn sinh viên ghi nhật ký thực tập hàng tuần, bao gồm nội dung công việc, kỹ năng học được, vấn đề phát sinh,...\n• Cung cấp biểu mẫu và định dạng chuẩn cho báo cáo thực tập cuối kỳ (theo mẫu của khoa).\n• Giải đáp các thắc mắc chuyên môn, quy trình, cách viết báo cáo và các tình huống phát sinh khi sinh viên cần hỗ trợ.\n• Gợi ý tài liệu bổ trợ nếu sinh viên muốn tìm hiểu thêm về công nghệ hoặc quy trình đang tiếp cận tại doanh nghiệp.\n    Ngoài ra, giảng viên có thể tổ chức buổi họp nhóm ngắn giữa kỳ (offline hoặc online) để tổng kết tiến độ và định hướng lại khi cần thiết.\n    • Kiểm tra tiến độ định kỳ (qua gọi điện, Zalo, Google Meet,...)\n    Giảng viên cần theo dõi tiến độ thực tập của sinh viên ít nhất theo chu kỳ 1–2 tuần/lần, thông qua:\n• Gọi điện hoặc nhắn tin Zalo, Messenger.\n• Tổ chức buổi gặp trực tuyến qua Google Meet/Zoom để thảo luận nhóm.\n• Yêu cầu sinh viên gửi nhật ký định kỳ hoặc cập nhật Google Form kiểm tra tiến độ.\n    Việc theo dõi này không chỉ giúp đôn đốc sinh viên giữ tinh thần làm việc nghiêm túc mà còn kịp thời xử lý những khó khăn về chuyên môn, tương tác, thái độ làm việc hoặc vi phạm nội quy nếu có.\n\n   • Thu nhận báo cáo, đánh giá kết quả và gửi điểm cho phòng đào tạo\n    Cuối kỳ thực tập, giảng viên sẽ:\n    * Thu nhận bản báo cáo thực tập từ sinh viên, kiểm tra nội dung và hình thức trình bày.\n    * Chấm báo cáo theo tiêu chí đã được khoa quy định, gồm: nội dung công việc, mức độ hiểu biết, kỹ năng trình bày, phản tư cá nhân,...\n    * Ghi nhận điểm số vào phiếu đánh giá học phần và gửi về Phòng Quản lý đào tạo đúng thời gian quy định.\n    * Đánh giá tổng thể về thái độ, kỹ năng, sự chủ động và nghiêm túc trong suốt kỳ thực tập để phản ánh đúng năng lực sinh viên.\n    Giảng viên hướng dẫn chính là người chịu trách nhiệm cuối cùng trong việc đảm bảo chất lượng và kết quả học phần \"Thực tập nhận thức\" của sinh viên.\nVI. CÁCH THỨC NỘP VÀ CHẤM BÁO CÁO\n    Sau khi kết thúc thời gian thực tập tại doanh nghiệp, sinh viên cần hoàn thiện báo cáo và tiến hành nộp đúng hạn để được đánh giá và công nhận kết quả học phần “Thực tập nhận thức”. Quy trình và tiêu chí như sau:\n    ● Nộp báo cáo: Bản cứng và bản mềm\n    Sinh viên có trách nhiệm nộp đầy đủ cả bản cứng và bản mềm báo cáo thực tập:\n• Bản cứng: In đóng gáy đầy đủ, trình bày đúng định dạng, nộp trực tiếp tại văn phòng khoa hoặc giảng viên hướng dẫn, theo hướng dẫn cụ thể của từng lớp/nhóm.\n• Bản mềm: Gửi qua một trong các kênh sau (tùy theo yêu cầu của giảng viên/khoa):\no Email cá nhân giảng viên hướng dẫn.\no Google Drive dùng chung (theo liên kết được cung cấp).\no Hệ thống LMS/Canvas (nếu được triển khai).\n    Báo cáo cần được đặt tên file rõ ràng: BCTTNT_HọTên_MSSV_Lớp.\n    ● Hạn cuối nộp báo cáo: \n    Thời hạn nộp báo cáo sẽ được giảng viên hướng dẫn/thông báo cụ thể trong từng đợt thực tập, thường trong vòng 1 tuần sau khi kết thúc thời gian thực tập.\n    Đây là mốc thời gian quan trọng và được áp dụng thống nhất cho toàn bộ sinh viên thực tập. Sinh viên cần:\n    * Chủ động hoàn thành báo cáo sớm để có thời gian chỉnh sửa nếu cần.\n    * Không nộp trễ hạn (trừ trường hợp đặc biệt có lý do chính đáng và được giảng viên xác nhận).\n    * Nếu nộp trễ không có lý do, sinh viên có thể bị trừ điểm rèn luyện hoặc không đủ điều kiện xét đánh giá học phần.\n   ● Chấm điểm: Dựa trên các tiêu chí sau\n    Giảng viên hướng dẫn sẽ tiến hành đánh giá toàn diện kết quả thực tập dựa vào 4 nhóm tiêu chí chính:\n    1. Thời gian thực tập (20%)\n    * Đủ số ngày quy định theo kế hoạch (có giấy xác nhận của doanh nghiệp).\n    * Có mặt thường xuyên và tham gia đầy đủ các hoạt động tại đơn vị.\n    2. Nhật ký thực tập (20%)\n    * Ghi chép đầy đủ, chi tiết, trung thực theo từng tuần.\n    * Có nhận xét, đánh giá quá trình học hỏi và tiến bộ.\n    3. Nội dung báo cáo (40%)\n    * Trình bày đúng cấu trúc, logic, rõ ràng.\n    * Phản ánh đầy đủ công việc đã làm, kiến thức đã học, kỹ năng rèn luyện.\n    * Có nhận xét cá nhân, phản tư, đề xuất hướng phát triển.\n    4. Đánh giá từ doanh nghiệp (20%)\n    * Thái độ, kỹ năng, tinh thần học hỏi, ý thức tuân thủ nội quy.\n    * Kết quả công việc và sự phối hợp trong nhóm.\n    Mức điểm tổng kết sẽ được quy đổi thành điểm học phần và ghi nhận vào bảng điểm chính thức của sinh viên.\n    Lưu ý: Tất cả biểu mẫu thực tập (giấy giới thiệu, nhật ký thực tập, báo cáo, đánh giá doanh nghiệp...) sẽ được cập nhật và phát hành hằng năm bởi Khoa CNTT. Sinh viên có trách nhiệm sử dụng đúng mẫu quy định tại thời điểm thực tập.\n\n\n\nTrang 2\n\n\n",
  "﻿TRIỂN KHAI VÀ NHẮC NHỞ TRƯỚC KHI THỰC TẬP NHẬN THỨC\n(Dành cho SV CNTT năm 2)\nI. MỞ ĐẦU\n1. Giới thiệu mục đích buổi họp\n2. Ý nghĩa và tầm quan trọng của đợt thực tập nhận thức\n3. Tổng quan kế hoạch 10 tuần thực tập\n4. Trình bày vai trò của sinh viên, giảng viên hướng dẫn và doanh nghiệp\nII. NỘI DUNG CHÍNH\n1. Mục tiêu của kỳ thực tập nhận thức\n    * Làm quen với môi trường doanh nghiệp CNTT thực tế\n    * Quan sát quy trình công việc: dự án phần mềm, hệ thống mạng, dịch vụ công nghệ\n    * Phát triển kỹ năng mềm: giao tiếp, làm việc nhóm, phản biện, viết báo cáo\n    * Rèn luyện thái độ chuyên nghiệp, trách nhiệm và chủ động trong công việc\n2. Yêu cầu sinh viên cần chuẩn bị trước khi đi thực tập\n    * Kiến thức cơ bản: lập trình, cơ sở dữ liệu, thuật toán, kỹ năng văn phòng\n    * Trang phục: gọn gàng, phù hợp văn hóa doanh nghiệp\n    * Tài liệu mang theo: sổ ghi chép, nhật ký thực tập mẫu, thông tin liên hệ giảng viên hướng dẫn\n    * Thái độ sẵn sàng học hỏi và cầu tiến\n3. Những việc sinh viên cần thực hiện trong quá trình thực tập\n    * Tuần 1-2: Làm quen công ty, cơ cấu tổ chức, các phòng ban, quy định nội bộ\n    * Tuần 3-6: Quan sát – hỗ trợ kỹ thuật, ghi nhật ký công việc hằng tuần\n    * Tuần 7-9: Tham gia dự án nhỏ (nếu có), hoặc thực hành công việc thực tế theo sự phân công\n    * Tuần 10: Tổng hợp báo cáo, đánh giá kết quả thực tập, tự phản tư\n    * Duy trì liên hệ với GVHD định kỳ (2 tuần/lần)\n\n4. Cách ghi chép nhật ký thực tập\n    * Ghi rõ ngày – nội dung công việc – kết quả – kỹ năng học được – khó khăn – hướng khắc phục\n    * Cuối mỗi tuần có phần đánh giá cá nhân và kế hoạch cải thiện\n5. Các kỹ năng và thái độ cần thể hiện\n    * Kỹ năng: giao tiếp, teamwork, trình bày kỹ thuật, tự học công nghệ mới\n    * Thái độ: đúng giờ, tôn trọng văn hóa doanh nghiệp, bảo mật thông tin, chủ động đề xuất công việc\n6. Báo cáo cuối kỳ\n    * Cấu trúc cơ bản: Tổng quan đơn vị – Mô tả công việc – Những gì học được – Đề xuất cải tiến – Nhận xét\n    * Báo cáo cần có hình ảnh minh họa (nếu được), ghi rõ phần việc cá nhân tham gia\n7. Những điều cần tránh\n    * Vắng mặt không lý do\n    * Giao tiếp thiếu chuyên nghiệp, không đúng mực\n    * Sao nhãng việc ghi nhật ký dẫn đến không đủ cơ sở viết báo cáo\n    * Không chủ động học hỏi, chỉ làm khi được nhắc nhở\nIII. TỔNG KẾT & NHẮC NHỞ\n1. Thời gian bắt đầu và kết thúc thực tập chính thức\n2. Thời gian nộp báo cáo và nhật ký\n3. Hình thức đánh giá (Doanh nghiệp + Giảng viên)\n4. Kênh hỗ trợ trong quá trình thực tập: Email/Zalo nhóm với GVHD\n5. Khuyến khích sinh viên tìm ý tưởng cho khóa luận hoặc đề tài thực tế\nI. MỞ ĐẦU\n1. Giới thiệu mục đích buổi họp\n    Tài liệu này triển khai kế hoạch thực tập nhận thức dành cho sinh viên năm 2 ngành Công nghệ Thông tin. Đây là đợt thực tập đầu tiên mà các bạn sẽ tham gia tại các doanh nghiệp thực tế.\n    Chúng ta sẽ cùng nhau:\n    * Nắm rõ mục tiêu, nội dung và yêu cầu của kỳ thực tập.\n    * Hiểu được vai trò và trách nhiệm của từng bên liên quan: sinh viên, giảng viên hướng dẫn và doanh nghiệp tiếp nhận.\n    * Chuẩn bị tinh thần, kỹ năng và thái độ cần thiết trước khi bước vào môi trường làm việc thực tế.\n2. Ý nghĩa và tầm quan trọng của đợt thực tập nhận thức\n    Thực tập nhận thức là cột mốc đầu tiên đánh dấu việc sinh viên bắt đầu tiếp xúc với môi trường doanh nghiệp thực tế sau khi đã hoàn thành các học phần cơ bản như: lập trình, cơ sở dữ liệu, tư duy thuật toán, kỹ năng văn phòng, v.v...\n    Đợt thực tập này sẽ giúp các bạn:\n    * Quan sát và hiểu rõ mô hình vận hành thực tế trong các doanh nghiệp CNTT.\n    * Hình thành nhận thức nghề nghiệp ban đầu: biết mình phù hợp với công việc gì, định hướng phát triển ra sao.\n    * Rèn luyện các kỹ năng mềm quan trọng: giao tiếp, làm việc nhóm, viết báo cáo, quản lý thời gian.\n    * Tạo nền tảng cho các đợt thực tập chuyên sâu hoặc khóa luận tốt nghiệp sau này.\n    Lưu ý: Đây không phải là kỳ thực tập để đi làm thuê, mà là một trải nghiệm học tập có định hướng. Mục tiêu không phải là “làm thật nhiều”, mà là quan sát – học hỏi – rèn luyện – phản tư.\n3. Tổng quan kế hoạch 10 tuần thực tập\n    * Thời gian thực tập: Theo thông báo chính thức từ Khoa (10 tuần, bắt đầu từ ngày… đến ngày…).\n    * Hình thức: Thực tập tại doanh nghiệp CNTT, phần mềm, mạng, giải pháp số,… do nhà trường hoặc sinh viên tự liên hệ (được xác nhận).\n    * Nội dung thực tập:\no Tuần 1–2: Làm quen môi trường, tìm hiểu mô hình công ty, quy trình công việc.\no Tuần 3–6: Quan sát – hỗ trợ kỹ thuật – ghi chép nhật ký công việc.\no Tuần 7–9: Tham gia dự án nhỏ hoặc thực hành một nhiệm vụ thực tế (nếu có).\no Tuần 10: Tổng hợp, viết báo cáo, nộp kết quả thực tập.\n    * Yêu cầu đầu ra:\no Nhật ký thực tập đầy đủ (tuần/lần)\no Báo cáo thực tập cuối kỳ\no Bảng nhận xét từ doanh nghiệp\no Đánh giá từ giảng viên hướng dẫn\n4. Trình bày vai trò của sinh viên, giảng viên hướng dẫn và doanh nghiệp\n    Đối với sinh viên\n    * Chủ động học hỏi, quan sát, ghi chép và đặt câu hỏi đúng trọng tâm.\n    * Thể hiện thái độ chuyên nghiệp: đúng giờ, nghiêm túc, tuân thủ nội quy doanh nghiệp.\n    * Giao tiếp cởi mở, cầu thị, không e ngại khi được phân công nhiệm vụ.\n    * Ghi đầy đủ nhật ký hằng tuần và phản ánh đúng tiến độ, khó khăn, đề xuất.\n    Đối với giảng viên hướng dẫn\n    * Hướng dẫn sinh viên xây dựng kế hoạch cá nhân và mục tiêu thực tập.\n    * Theo dõi, hỗ trợ, giải đáp khó khăn trong suốt quá trình thực tập.\n    * Nhận và đánh giá nhật ký, báo cáo, kết quả thực tập.\n    * Là cầu nối giữa nhà trường và doanh nghiệp.\n    Đối với doanh nghiệp tiếp nhận\n    * Tạo điều kiện cho sinh viên quan sát, học hỏi và tiếp cận công việc thực tế.\n    * Hướng dẫn, giao nhiệm vụ phù hợp với năng lực sinh viên.\n    * Đánh giá kết quả thực tập: thái độ – kỹ năng – tiềm năng phát triển.\n    * Ký xác nhận và nhận xét cuối kỳ cho báo cáo thực tập.\nII. NỘI DUNG CHÍNH\n1. Mục tiêu của kỳ thực tập nhận thức\n    Thực tập nhận thức không phải để \"làm việc chuyên môn\", mà là một giai đoạn quan sát – làm quen – định hướng, giúp sinh viên hiểu được môi trường doanh nghiệp thực tế, từ đó xây dựng nền tảng phát triển nghề nghiệp tương lai.\n    Dưới đây là bốn nhóm mục tiêu chính:\n    • Làm quen với môi trường doanh nghiệp CNTT thực tế\n    • Sinh viên sẽ được trực tiếp đến doanh nghiệp, tìm hiểu:\n    * Cơ cấu tổ chức: các phòng ban, bộ phận kỹ thuật, hỗ trợ, phát triển phần mềm...\n    * Văn hóa làm việc: quy tắc giao tiếp, giờ giấc, tác phong chuyên nghiệp...\n    * Không gian làm việc: hệ thống máy chủ, phòng họp kỹ thuật, khu lập trình, v.v...\n    Mục tiêu: Giúp sinh viên bớt bỡ ngỡ khi sau này bước vào làm việc thật, hiểu cách doanh nghiệp vận hành, từ đó điều chỉnh thái độ và kỳ vọng nghề nghiệp phù hợp.\n    • Quan sát quy trình công việc: dự án phần mềm, hệ thống mạng, dịch vụ công nghệ.\n    Sinh viên sẽ quan sát và tìm hiểu:\n    * Các bước trong quy trình phát triển phần mềm: phân tích – thiết kế – lập trình – kiểm thử – triển khai (Agile/Scrum).\n    * Vận hành hệ thống mạng, bảo trì thiết bị, xử lý sự cố.\n    * Cách tổ chức và triển khai dịch vụ CNTT cho khách hàng hoặc đối tác.\n    * Một số công cụ, nền tảng, công nghệ doanh nghiệp đang sử dụng (Git, Jira, VS Code, MySQL, v.v.)\n   Mục tiêu: Giúp sinh viên kết nối lý thuyết đã học với thực tiễn, định hình được các nhánh nghề nghiệp: lập trình, quản trị mạng, QA, tư vấn giải pháp,…\n    • Phát triển kỹ năng mềm: giao tiếp, làm việc nhóm, phản biện, viết báo cáo\n    • Trong thời gian thực tập, sinh viên sẽ:\n    * Giao tiếp với cán bộ doanh nghiệp: học cách trình bày vấn đề ngắn gọn, chuyên nghiệp.\n    * Quan sát các cuộc họp nhóm: chia task, làm daily report (nếu có).\n    * Viết nhật ký kỹ thuật và báo cáo tuần: trình bày thông tin rõ ràng, có logic.\n    * Học cách xử lý tình huống: khi gặp sự cố, khi chưa hiểu yêu cầu công việc, v.v.\n    Mục tiêu: Phát triển những năng lực không thể học qua lý thuyết, nhưng rất quan trọng để đi làm: kỹ năng giao tiếp, hợp tác, báo cáo và tự tổ chức công việc.\n    • Rèn luyện thái độ chuyên nghiệp, trách nhiệm và chủ động trong công việc\n    Sinh viên cần:\n* Đúng giờ, đúng tác phong, tuân thủ nội quy doanh nghiệp.\n* Chủ động quan sát, hỏi – học – làm chứ không bị động chờ giao việc.\n* Chịu trách nhiệm với phần việc được giao, không \"làm cho có\".\n* Tôn trọng đồng nghiệp, giữ bí mật thông tin, không làm việc riêng.\n    Mục tiêu: Xây dựng thái độ làm việc tích cực, đây là yếu tố được các doanh nghiệp đánh giá cao hơn cả kỹ năng kỹ thuật đối với sinh viên năm 2.\n    Tóm lại, đợt thực tập nhận thức sẽ giúp sinh viên:\n* Hiểu \"doanh nghiệp thực\" khác gì so với \"môn học trên lớp\".\n* Bắt đầu hình thành tư duy nghề nghiệp: mình phù hợp với lĩnh vực nào?\n* Gieo nền tảng để sau này dễ dàng thích nghi với môi trường làm việc chuyên nghiệp.\n2. Yêu cầu sinh viên cần chuẩn bị trước khi đi thực tập\n    Trước khi bước vào doanh nghiệp thực tập, mỗi sinh viên cần chủ động chuẩn bị đầy đủ về kiến thức, hành trang cá nhân, công cụ hỗ trợ, và đặc biệt là tinh thần cầu tiến và thái độ chuyên nghiệp. Đây là bước rất quan trọng để sinh viên có thể tận dụng tốt nhất 10 tuần thực tập sắp tới.\n    • Kiến thức cơ bản: lập trình, cơ sở dữ liệu, thuật toán, kỹ năng văn phòng\n    Các kiến thức tối thiểu mà sinh viên năm 2 cần nắm chắc trước khi đi thực tập bao gồm:\no Lập trình cơ bản (Python, C++, Java hoặc JavaScript).\no Cơ sở dữ liệu: hiểu được cách tạo bảng, truy vấn SQL, mô hình quan hệ.\no Cấu trúc dữ liệu và giải thuật: hiểu các cấu trúc như mảng, danh sách, cây, thuật toán tìm kiếm, sắp xếp cơ bản.\no Kỹ năng văn phòng: thành thạo Word (viết báo cáo), Excel (bảng biểu, thống kê), PowerPoint (trình bày nội dung), Google Workspace.\no Sử dụng công cụ công nghệ: như Git/GitHub, Visual Studio Code, hoặc phần mềm phù hợp với chuyên ngành đã học.\n    Lưu ý: Các bạn không cần giỏi, nhưng phải đủ hiểu để có thể nhận biết – quan sát – đặt câu hỏi đúng trong quá trình thực tập.\n    • Trang phục: gọn gàng, phù hợp văn hóa doanh nghiệp\n    Mỗi doanh nghiệp có văn hóa khác nhau, nhưng có một số quy tắc chung sinh viên cần tuân thủ:\no Không mặc đồ quá xuề xòa, phản cảm hoặc không phù hợp nơi công sở (quần short, dép lê, áo ba lỗ,...).\no Ưu tiên trang phục lịch sự – gọn gàng – sạch sẽ: áo sơ mi, áo có cổ, quần dài, giày/sneaker kín.\no Đối với doanh nghiệp sáng tạo (startup, công ty phần mềm), sinh viên có thể mặc thoải mái hơn nhưng vẫn cần giữ thái độ chuyên nghiệp trong cách ăn mặc.\n     Trang phục là ấn tượng đầu tiên khi bạn bước vào môi trường làm việc – hãy chọn cho mình một hình ảnh trưởng thành và phù hợp.\n    • Tài liệu mang theo: sổ ghi chép, nhật ký thực tập mẫu, thông tin liên hệ giảng viên hướng dẫn\n    Sổ ghi chép: nên mang một cuốn sổ tay riêng để:\no Ghi lại thông tin quan trọng khi doanh nghiệp hướng dẫn.\no Ghi nội dung cần làm hằng ngày/tuần.\no Đặt câu hỏi và phản ánh cá nhân.\n• Nhật ký thực tập mẫu: nhà trường hoặc giảng viên sẽ cung cấp mẫu; sinh viên cần in hoặc lưu sẵn để hoàn thành hằng tuần.\n• Thông tin liên hệ giảng viên hướng dẫn: số điện thoại/email/Zalo,… để kịp thời liên lạc khi cần hỗ trợ hoặc gặp tình huống khó xử tại doanh nghiệp.\n📝 Ghi chép nghiêm túc là nền tảng để viết báo cáo cuối kỳ tốt hơn và thể hiện thái độ học tập chuyên nghiệp.\n• Thái độ sẵn sàng học hỏi và cầu tiến\n• Đây là yếu tố cốt lõi quyết định sự thành công của kỳ thực tập.\n• Sinh viên cần thể hiện:\no Tinh thần cầu thị: khi không biết, hãy hỏi; khi được hướng dẫn, hãy ghi chép và thực hiện nghiêm túc.\no Sự chủ động: quan sát – tìm hiểu – xin làm thử – hỗ trợ công việc dù nhỏ.\no Tôn trọng và hợp tác với người hướng dẫn, nhân sự trong công ty.\no Sự kiên nhẫn: không đòi hỏi việc “quan trọng” ngay từ đầu; hãy chứng minh khả năng qua những việc nhỏ.\n🌱 Thực tập là “hạt giống nghề nghiệp đầu tiên”, thái độ của bạn chính là đất tốt hay xấu cho hạt giống ấy phát triển.\n\n\n✅ Tóm lại, sinh viên cần đến doanh nghiệp với:\n• Kiến thức vững, trang phục nghiêm túc, dụng cụ đầy đủ, tinh thần sẵn sàng.\n• Khi bạn có sự chuẩn bị kỹ lưỡng, bạn sẽ dễ gây ấn tượng tốt với doanh nghiệp và tận dụng tối đa 10 tuần thực tập để học hỏi – phát triển – trưởng thành.\n3. Những việc sinh viên cần thực hiện trong quá trình thực tập\nĐợt thực tập kéo dài 10 tuần được chia thành các giai đoạn rõ ràng. Mỗi giai đoạn có mục tiêu cụ thể để sinh viên vừa quan sát – học hỏi, vừa từng bước tham gia vào công việc thực tế một cách phù hợp với năng lực và kinh nghiệm hiện tại.\n\n• Tuần 1–2: Làm quen công ty, cơ cấu tổ chức, các phòng ban, quy định nội bộ\nNội dung thực hiện:\n• Tìm hiểu thông tin cơ bản về doanh nghiệp: tên, ngành nghề, sản phẩm – dịch vụ, đối tượng khách hàng, quy mô nhân sự.\n• Làm quen không gian làm việc: vị trí chỗ ngồi, thiết bị, mạng nội bộ, công cụ hỗ trợ.\n• Nắm rõ nội quy công ty: giờ giấc làm việc, an toàn thông tin, quy tắc giao tiếp, sử dụng tài sản,...\n• Gặp gỡ người phụ trách tại doanh nghiệp (mentor), xác định lịch trình, nhiệm vụ cơ bản.\n• Tìm hiểu sơ bộ các phòng ban: kỹ thuật, lập trình, hỗ trợ kỹ thuật, QA, chăm sóc khách hàng,…\nKết quả kỳ vọng:\n• Hiểu được cách doanh nghiệp tổ chức và vận hành.\n• Nắm rõ các nguyên tắc làm việc để tránh vi phạm trong quá trình thực tập.\n\n• Tuần 3–6: Quan sát – hỗ trợ kỹ thuật, ghi nhật ký công việc hằng tuần\nNội dung thực hiện:\n• Tham gia quan sát công việc thực tế: phát triển phần mềm, vận hành mạng, hỗ trợ người dùng,...\n• Học cách sử dụng công cụ kỹ thuật: Git, IDE, công cụ test, hệ quản trị CSDL,...\n• Hỗ trợ xử lý các công việc nhỏ: cập nhật tài liệu, kiểm tra lỗi giao diện, theo dõi tiến độ,...\n• Viết nhật ký thực tập mỗi tuần, ghi rõ:\no Công việc đã quan sát/làm\no Kiến thức/kỹ năng học được\no Khó khăn gặp phải\no Đề xuất cải tiến cá nhân\nKết quả kỳ vọng:\n• Nắm bắt quy trình kỹ thuật cơ bản trong môi trường chuyên nghiệp.\n• Rèn luyện khả năng ghi chép kỹ thuật và phản tư.\n• Tuần 7–9: Tham gia dự án nhỏ (nếu có), hoặc thực hành công việc thực tế theo sự phân công\nNội dung thực hiện:\n• Nếu doanh nghiệp có dự án phù hợp, sinh viên có thể được:\no Viết đoạn mã đơn giản, sửa lỗi nhỏ theo hướng dẫn.\no Hỗ trợ test phần mềm, viết tài liệu kỹ thuật.\no Vẽ sơ đồ hệ thống, phân tích module chức năng,...\n• Nếu không có dự án cụ thể, sinh viên vẫn có thể thực hành qua:\no Cài đặt phần mềm nội bộ, thiết lập cấu hình thiết bị.\no Hỗ trợ nhóm trong vận hành hệ thống.\no Thực hiện các bài tập mô phỏng tình huống thực tế.\nKết quả kỳ vọng:\n• Có trải nghiệm trực tiếp công việc trong chuyên ngành đã học.\n• Hình dung rõ hơn mình phù hợp với mảng nào trong ngành CNTT.\n\n• Tuần 10: Tổng hợp báo cáo, đánh giá kết quả thực tập, tự phản tư\nNội dung thực hiện:\n• Hoàn thiện nhật ký thực tập đầy đủ cho toàn bộ 10 tuần.\n• Viết báo cáo thực tập tổng kết:\no Giới thiệu doanh nghiệp\no Mô tả công việc đã thực hiện\no Kiến thức – kỹ năng học được\no Đánh giá bản thân\no Đề xuất hướng phát triển\n• Gửi báo cáo cho doanh nghiệp ký xác nhận và nhận xét.\n• Chuẩn bị nộp về cho giảng viên hướng dẫn theo mẫu.\nKết quả kỳ vọng:\n• Có một báo cáo chỉn chu, phản ánh đúng trải nghiệm thực tế.\n• Biết cách tự đánh giá và định hướng nghề nghiệp cho bản thân.\n• Duy trì liên hệ với giảng viên hướng dẫn định kỳ (2 tuần/lần)\nHình thức thực hiện:\n• Báo cáo nhanh tiến độ qua email, tin nhắn, hoặc form trực tuyến (theo yêu cầu của GVHD).\n• Trình bày khó khăn nếu có, xin ý kiến điều chỉnh nếu lệch hướng.\n• Nộp nhật ký theo từng đợt (tuần 2 – tuần 4 – tuần 6 – tuần 8 – tuần 10).\nMục đích:\n• Đảm bảo sinh viên thực sự tham gia nghiêm túc.\n• Có sự đồng hành – định hướng – hỗ trợ kịp thời từ phía nhà trường.\n\n✅ Tóm lại, sinh viên cần thực hiện đúng 3 nguyên tắc trong suốt quá trình thực tập:\n1. Ghi chép nghiêm túc – có hệ thống.\n2. Chủ động quan sát – học hỏi – thử sức.\n3. Phản hồi đúng thời điểm – đúng người.\n4. Cách ghi chép nhật ký thực tập\nNhật ký thực tập là tài liệu quan trọng nhất phản ánh quá trình tham gia, quan sát, học hỏi và phát triển của sinh viên trong suốt kỳ thực tập. Việc ghi chép đầy đủ, đúng cách không chỉ phục vụ cho việc viết báo cáo cuối kỳ, mà còn giúp sinh viên rèn luyện tư duy phản biện, hệ thống hóa kiến thức và đánh giá sự tiến bộ của bản thân.\n\n• Ghi rõ: Ngày – Nội dung công việc – Kết quả – Kỹ năng học được – Khó khăn – Hướng khắc phục\nMỗi ngày thực tập, sinh viên cần ghi nhật ký với các mục sau:\n📘 Mẫu bảng nhật ký thực tập hằng ngày\nNgày / Thời gian\nCông việc đã thực hiện / Quan sát\nKết quả đạt được\nKỹ năng / Kiến thức học được\nKhó khăn gặp phải\nHướng khắc phục / Bài học rút ra\n03/06/2025\nQuan sát buổi họp Sprint trong nhóm lập trình ReactJS\nHiểu cách chia task theo mô hình Kanban\nCách sử dụng Trello, hiểu về Scrum Sprint Planning\nKhông hiểu một số thuật ngữ chuyên môn\nGhi chú lại, tìm hiểu sau buổi họp, hỏi mentor hôm sau\n📝 Lưu ý quan trọng:\n• Tránh viết quá sơ sài như: \"Làm việc cả ngày\", \"Học hỏi thêm\"…\n• Ghi bằng ngôn ngữ rõ ràng – ngắn gọn – thực tế, ưu tiên dùng thuật ngữ kỹ thuật đúng chuyên ngành.\n• Nếu không có nhiệm vụ cụ thể, vẫn cần ghi lại những gì đã quan sát, học được, suy nghĩ được.\n\n• Cuối mỗi tuần có phần đánh giá cá nhân và kế hoạch cải thiện\nVào cuối mỗi tuần, sinh viên phải tự tổng kết lại tuần thực tập, bao gồm các nội dung sau:\n1. Tóm tắt công việc trong tuần: (có thể gạch đầu dòng)\n2. Điều học được rõ nét nhất: (về kiến thức, kỹ năng, quy trình làm việc,…)\n3. Khó khăn lớn nhất gặp phải: (về kỹ thuật, giao tiếp, hiểu quy trình,…)\n4. Cách đã hoặc sẽ khắc phục: (tự học, hỏi mentor, xin đổi cách tiếp cận,…)\n5. Kế hoạch cải thiện tuần sau: (cụ thể – khả thi – ngắn gọn, ví dụ: chủ động xin thử làm test, học thêm Git)\nMẫu đánh giá tuần (cuối tuần):\n🔹 Tổng kết tuần 4:\n• Tóm tắt công việc: Quan sát cấu hình mạng nội bộ; học cách sử dụng Wireshark; ghi log hệ thống.\n• Học được: Cách theo dõi lưu lượng truy cập mạng; thao tác ping, trace route.\n• Khó khăn: Chưa hiểu cách xác định gói tin lỗi.\n• Khắc phục: Đọc tài liệu hướng dẫn của Cisco; xin mentor phân tích một tình huống mẫu.\n• Kế hoạch tuần 5: Thử tự bắt lỗi gói tin trong mạng LAN thử nghiệm; ghi lại quy trình vào sổ tay kỹ thuật.\n🎯 Ghi chép nhật ký đều đặn, phản ánh trung thực, không sao chép hoặc ghi đại khái. Nhật ký là một phần điểm đánh giá, đồng thời là tài liệu hỗ trợ rất đắc lực để viết báo cáo cuối kỳ chính xác, thuyết phục.\n\n✅ Tóm lại, một nhật ký thực tập hiệu quả là:\n• Ghi đúng – đủ – rõ – có chiều sâu.\n• Thể hiện quá trình tư duy – học hỏi – tiến bộ cá nhân.\n• Giúp sinh viên nhìn lại chặng đường 10 tuần một cách mạch lạc và có giá trị.\n5. Các kỹ năng và thái độ cần thể hiện\nMột trong những yếu tố mà doanh nghiệp đánh giá cao ở sinh viên thực tập – đặc biệt là sinh viên năm 2 – không chỉ là kiến thức chuyên môn, mà còn là cách sinh viên ứng xử, hợp tác và học hỏi trong môi trường làm việc thực tế.\n\n• Kỹ năng cần thể hiện\n1. Giao tiếp chuyên nghiệp\no Biết cách chào hỏi, trao đổi, lắng nghe với người hướng dẫn, đồng nghiệp.\no Đặt câu hỏi đúng trọng tâm, ngắn gọn khi cần hỗ trợ.\no Sử dụng email, tin nhắn nội bộ, tài liệu báo cáo rõ ràng, đúng chuẩn.\n✅ Lưu ý: Trong môi trường làm việc, cách bạn nói quan trọng không kém so với những gì bạn nói.\n2. Làm việc nhóm (teamwork)\no Quan sát cách nhóm kỹ thuật vận hành (họp nhóm, chia task, báo cáo tiến độ).\no Nếu được phân công việc nhỏ, cần:\n• Phối hợp nhịp nhàng, chủ động hỗ trợ đồng đội.\n• Không tách biệt hay thụ động chờ giao việc.\no Học cách giải quyết mâu thuẫn nhẹ nhàng và linh hoạt.\n🎯 Mỗi sinh viên cần học được rằng: “Mình là một phần của nhóm”, dù chỉ mới bước đầu tiếp cận.\n\n3. Trình bày kỹ thuật rõ ràng\no Biết cách viết mô tả kỹ thuật cho:\n• Công việc đã làm (ghi trong nhật ký).\n• Cách cấu hình, cài đặt, thao tác phần mềm.\n• Kết quả kiểm thử, phát hiện lỗi, đề xuất cải tiến.\no Ưu tiên sử dụng sơ đồ, bảng biểu để thể hiện ý tưởng hoặc mô tả cấu trúc.\n🧠 Trình bày rõ ràng = hiểu vấn đề tốt + giao tiếp hiệu quả.\n4. Tự học và tìm hiểu công nghệ mới\no Trong quá trình thực tập, bạn sẽ:\n• Gặp công cụ/lập trình/ngôn ngữ chưa từng học trên lớp.\n• Được giới thiệu tài liệu, đường link, hoặc gợi ý từ mentor.\no Khi đó, hãy:\n• Chủ động tìm hiểu, ghi chú lại.\n• Thử cài đặt – mô phỏng lại trên máy cá nhân nếu có thể.\n🚀 Tự học là kỹ năng sống còn trong ngành CNTT – và bạn nên bắt đầu luyện từ bây giờ.\n\n• Thái độ chuyên nghiệp cần có\n1. Đúng giờ – đúng cam kết\no Đến đúng thời gian quy định của doanh nghiệp.\no Có lý do chính đáng khi xin nghỉ (và cần báo trước).\no Hoàn thành công việc/nhật ký/báo cáo đúng hạn.\n⏰ Tác phong đúng giờ là biểu hiện đầu tiên của tinh thần tôn trọng và trách nhiệm.\n2. Tôn trọng văn hóa doanh nghiệp\no Tuân thủ quy định về:\n• Trang phục – giờ giấc – sử dụng thiết bị.\n• Giao tiếp nội bộ – không gây ồn ào, không tỏ thái độ thiếu nghiêm túc.\no Luôn thể hiện thái độ lịch sự, cầu thị, và biết nói lời “cảm ơn” – “xin phép” – “xin lỗi” đúng lúc.\n3. Bảo mật thông tin\no Không tự ý chụp ảnh – ghi âm – copy tài liệu công ty nếu không được phép.\no Không chia sẻ thông tin nội bộ lên mạng xã hội.\no Không sử dụng máy móc, phần mềm của doanh nghiệp cho mục đích cá nhân.\n🔐 Vi phạm bảo mật có thể khiến sinh viên bị ngừng thực tập và ảnh hưởng đến uy tín nhà trường.\n4. Chủ động đề xuất công việc\no Khi rảnh, sinh viên nên chủ động hỏi:\n• “Anh/chị có cần em hỗ trợ gì không ạ?”\n• “Em có thể thử làm phần này được không?”\no Đề xuất những gì phù hợp với năng lực, có tinh thần học hỏi và không nản khi bị từ chối hoặc góp ý.\n💡 Chủ động chính là bước đầu tiên để biến thực tập thành cơ hội nghề nghiệp thực sự trong tương lai.\n\n✅ Tóm lại, sinh viên đi thực tập không chỉ mang theo kiến thức mà còn mang theo:\n• Tư duy học hỏi\n• Tác phong nghiêm túc\n• Thái độ chuyên nghiệp\nĐây là “hình ảnh thương hiệu cá nhân” mà bạn để lại trong mắt doanh nghiệp – một yếu tố có thể dẫn đến cơ hội cộng tác, đề tài khóa luận, hay thậm chí là việc làm sau này.\n6. Báo cáo cuối kỳ\nBáo cáo cuối kỳ là sản phẩm tổng hợp toàn bộ quá trình thực tập nhận thức kéo dài 10 tuần, thể hiện mức độ tham gia, hiểu biết, tư duy phản ánh và tinh thần học hỏi của sinh viên. Đây cũng là căn cứ để giảng viên và doanh nghiệp đánh giá kết quả thực tập một cách công bằng và rõ ràng.\n\n• Cấu trúc cơ bản của báo cáo\nDưới đây là bố cục gợi ý cho một báo cáo thực tập nhận thức chuẩn và đầy đủ:\n1. Trang bìa + Lời cảm ơn\no Bao gồm: tên sinh viên, mã số SV, lớp, tên giảng viên hướng dẫn, tên doanh nghiệp tiếp nhận, thời gian thực tập.\no Lời cảm ơn gửi đến doanh nghiệp, giảng viên và nhà trường.\n2. Chương 1: Tổng quan đơn vị thực tập\no Giới thiệu ngắn gọn về công ty: tên, địa chỉ, lĩnh vực hoạt động, quy mô nhân sự, cơ cấu tổ chức.\no Mô tả môi trường làm việc, văn hóa công ty, các quy định nội bộ.\n3. Chương 2: Mô tả công việc đã thực hiện\no Ghi rõ các công việc/hoạt động đã tham gia trong suốt 10 tuần.\no Mô tả quá trình quan sát, hỗ trợ, thực hành (nếu có).\no Ghi nhận các công cụ/kỹ thuật/công nghệ đã sử dụng.\n4. Chương 3: Những điều học được\no Kiến thức chuyên môn: quy trình kỹ thuật, ngôn ngữ lập trình, công cụ công nghệ,...\no Kỹ năng mềm: giao tiếp, teamwork, trình bày, phản biện, quản lý thời gian,...\no Kinh nghiệm thực tế: cách xử lý vấn đề, làm việc trong môi trường chuyên nghiệp.\n5. Chương 4: Đề xuất và đánh giá\no Đề xuất cá nhân nhằm cải tiến quy trình hoặc cách tiếp cận công việc đã quan sát.\no Đánh giá về:\n• Môi trường thực tập.\n• Mức độ hỗ trợ từ mentor/doanh nghiệp.\n• Mức độ phù hợp giữa kiến thức học và thực tế.\no Phản tư bản thân: điểm mạnh – điểm yếu – hướng phát triển sau thực tập.\n6. Chương 5: Kết luận\no Tóm lược lại toàn bộ quá trình thực tập, cảm nhận cá nhân.\no Xác định định hướng nghề nghiệp tương lai (nếu đã rõ ràng).\n7. Phụ lục\no Nhật ký thực tập theo tuần (tóm tắt hoặc đính kèm).\no Hình ảnh minh họa (nếu có).\no Phiếu nhận xét và xác nhận từ doanh nghiệp.\no Các tài liệu hỗ trợ khác (nếu cần).\n\n• Báo cáo cần có hình ảnh minh họa (nếu có thể), ghi rõ phần việc cá nhân tham gia\n1. Hình ảnh minh họa\no Có thể chụp:\n• Giao diện phần mềm bạn tham gia thiết kế/test.\n• Sơ đồ hệ thống mạng bạn quan sát/vẽ lại.\n• Bảng Trello bạn được tham gia sử dụng,...\no Lưu ý: Chỉ dùng hình ảnh khi đã được doanh nghiệp cho phép và không vi phạm bảo mật.\n2. Ghi rõ phần việc cá nhân\no Không nên viết chung chung như “chúng em cùng tham gia”, mà phải ghi cụ thể:\n• “Em được phân công viết tài liệu hướng dẫn cài đặt module A.”\n• “Em tham gia chỉnh sửa giao diện đăng ký trong hệ thống website bán hàng.”\n• “Em thực hiện cấu hình địa chỉ IP trong phòng máy test.”\n🎯 Việc xác định rõ vai trò cá nhân thể hiện sinh viên chủ động – nghiêm túc – có giá trị riêng trong nhóm thực tập.\n\n✅ Tóm lại, một báo cáo tốt là:\n• Trình bày rõ ràng – trung thực – có chiều sâu.\n• Có minh chứng bằng hình ảnh hoặc nhật ký.\n• Phản ánh được quá trình học hỏi, nỗ lực cá nhân và định hướng tương lai.\n🧩 Gợi ý: Nếu làm tốt, bạn hoàn toàn có thể dùng báo cáo này như một phần portfolio cá nhân khi đi xin việc/thực tập chuyên sâu sau này.\n7. Những điều cần tránh\nĐể có một kỳ thực tập hiệu quả, nghiêm túc và để lại ấn tượng tốt, sinh viên không chỉ cần chuẩn bị tốt mà còn phải tránh những hành vi và thói quen tiêu cực. Dưới đây là những lỗi phổ biến mà sinh viên năm 2 thường mắc phải khi đi thực tập – và cần tuyệt đối tránh:\n\n• Vắng mặt không lý do\n• Không đến công ty mà không báo trước, hoặc báo nhưng không có lý do chính đáng.\n• Vắng nhiều buổi làm ảnh hưởng đến tiến độ cá nhân và hình ảnh của nhà trường.\n• Dễ bị doanh nghiệp đánh giá là thiếu kỷ luật và thiếu trách nhiệm, dẫn đến không được ký xác nhận hoặc nhận xét kém.\n⚠ Lưu ý: Nếu có lý do chính đáng (ốm, việc gia đình...), cần báo trước ít nhất 1 ngày cho cả doanh nghiệp và giảng viên hướng dẫn.\n\n• Giao tiếp thiếu chuyên nghiệp, không đúng mực\n• Nói năng thiếu lễ phép, không chào hỏi khi đến/về.\n• Cắt lời, to tiếng, nói chuyện riêng trong giờ làm việc.\n• Gửi email/messenger nội bộ mà không viết đúng chuẩn (không tiêu đề, không dấu câu, không ngữ pháp tối thiểu).\n🎯 Giao tiếp là \"tấm gương\" phản chiếu sự trưởng thành – sinh viên cần rèn luyện thái độ lịch sự – tôn trọng – cầu thị trong mọi tương tác.\n\n• Sao nhãng việc ghi nhật ký dẫn đến không đủ cơ sở viết báo cáo\n• Ghi nhật ký qua loa, viết cho có hoặc... quên luôn không ghi.\n• Đến tuần cuối mới bắt đầu viết lại → thiếu chi tiết, không nhớ rõ công việc → báo cáo không thực tế, dễ bị phát hiện sao chép.\n• Không có nhật ký đầy đủ sẽ ảnh hưởng đến:\no Đánh giá của giảng viên hướng dẫn\no Khả năng hoàn thành báo cáo đúng hạn\n📝 Hãy xem nhật ký như một phần công việc hàng ngày – chỉ cần 10 phút mỗi ngày để ghi lại là đủ.\n\n• Không chủ động học hỏi, chỉ làm khi được nhắc nhở\n• Ngồi chờ được giao việc, không đặt câu hỏi, không tìm hiểu thêm khi rảnh.\n• Không quan sát, không ghi chú, không đề xuất thử làm dù là việc nhỏ.\n• Dễ tạo ấn tượng lười biếng, thiếu đam mê, thụ động – điều tối kỵ trong môi trường IT năng động.\n💡 Thực tập không phải để \"chờ việc\", mà để chủ động tìm việc học. Nếu bạn chủ động, doanh nghiệp sẽ sẵn sàng chỉ thêm – còn nếu bạn im lặng, họ cũng... không rảnh để dạy.\n\n✅ Tóm lại, sinh viên cần:\nTránh\nThay vào đó\nVắng mặt tùy tiện\nBáo trước – giữ cam kết\nGiao tiếp tùy tiện\nGiao tiếp đúng mực, chuyên nghiệp\nKhông ghi nhật ký\nGhi nhật ký đều đặn, có phản tư\nBị động, chờ việc\nChủ động quan sát, đề xuất, học hỏi\n\n📢 Một sinh viên có thái độ sai sẽ không thể học được đúng – hãy đi thực tập với tư cách một người học nghề chuyên nghiệp, không phải khách vãng lai.\nIII. TỔNG KẾT & NHẮC NHỞ\nSau khi đã được triển khai các nội dung quan trọng của đợt thực tập nhận thức, sinh viên cần ghi nhớ các mốc thời gian, hình thức đánh giá và các kênh hỗ trợ cụ thể để hoàn thành đúng – đủ – nghiêm túc kỳ thực tập.\n\n1. Thời gian bắt đầu và kết thúc thực tập chính thức\n• Thời gian bắt đầu: Từ ngày __ /__ /2025\n• Thời gian kết thúc: Đến hết ngày __ /__ /2025\n(Thời gian cụ thể sẽ được khoa thông báo chính thức bằng văn bản và cập nhật trên nhóm lớp hoặc hệ thống LMS)\n⏰ Tổng thời gian: 10 tuần liên tục.\nSinh viên cần chủ động liên hệ với doanh nghiệp sớm để bố trí lịch thực tập phù hợp, tránh trễ hoặc thiếu ngày công.\n\n2. Thời gian nộp báo cáo và nhật ký\n• Hạn chót nộp nhật ký và báo cáo: Trước ngày __ /__ /2025\n• Hình thức nộp:\no Bản mềm: qua email hoặc hệ thống LMS (theo yêu cầu của GVHD).\no Bản in: nộp về văn phòng Khoa/GVHD (kèm chữ ký xác nhận của doanh nghiệp).\n📌 Sinh viên nộp trễ sẽ bị trừ điểm hoặc không được tính kết quả thực tập.\n\n3. Hình thức đánh giá (Doanh nghiệp + Giảng viên)\nKết quả thực tập được đánh giá theo hai nguồn chính:\n🔹 Doanh nghiệp (50%)\n• Nhận xét thái độ, tác phong, kỹ năng làm việc, khả năng thích nghi, trách nhiệm.\n• Xác nhận thời gian thực tập và nội dung đã tham gia.\n• Mẫu nhận xét có sẵn trong bộ hồ sơ thực tập.\n🔹 Giảng viên hướng dẫn (50%)\n• Dựa trên:\no Nội dung nhật ký thực tập (đầy đủ – logic – có chiều sâu).\no Báo cáo cuối kỳ (cấu trúc – chính xác – trung thực).\no Mức độ phản hồi – liên hệ – chủ động của sinh viên trong suốt kỳ thực tập.\n📝 Mọi biểu hiện thiếu nghiêm túc (vắng không lý do, sao chép báo cáo, làm hình thức...) đều có thể bị đánh giá dưới trung bình.\n\n4. Kênh hỗ trợ trong quá trình thực tập: Email/Zalo nhóm với GVHD\nĐể hỗ trợ sinh viên trong quá trình thực tập, nhà trường và giảng viên sẽ thiết lập các kênh liên lạc chính thức như:\n• Zalo nhóm lớp hoặc nhóm theo nhóm thực tập\n• Email cá nhân của giảng viên hướng dẫn\n• Google Drive (để nộp nhật ký, tài liệu minh chứng)\n📣 Sinh viên cần chủ động cập nhật thông tin – không nên chờ bị gọi tên mới phản hồi.\n5. Khuyến khích sinh viên tìm ý tưởng cho khóa luận hoặc đề tài thực tế\n• Trong quá trình quan sát, làm việc tại doanh nghiệp, sinh viên hãy ghi lại:\no Những vấn đề thực tiễn doanh nghiệp đang gặp phải.\no Các công nghệ, quy trình, sản phẩm bạn thấy hứng thú.\no Những việc “nho nhỏ nhưng thực tế” có thể phát triển thành đề tài khóa luận, đồ án cá nhân hoặc nhóm sau này.\n💡 Đây là cơ hội rất tốt để sinh viên vừa học vừa mở rộng tư duy sáng tạo và chuẩn bị cho giai đoạn thực tập chuyên sâu ở năm cuối.\n\n✅ Tóm lại, sinh viên cần nhớ:\nViệc cần làm\nThời điểm\nLiên hệ doanh nghiệp, xác nhận lịch thực tập\nTrước __/__/2025\nGhi nhật ký hằng tuần\nTừ tuần 1 đến tuần 10\nGửi phản hồi cho GVHD (2 tuần/lần)\nTheo lịch định kỳ\nHoàn thành báo cáo & nhật ký, xin xác nhận DN\nTrước __/__/2025\nNộp báo cáo\nTrước __/__/2025\n\n🎓 Thực tập nhận thức là bước đầu tiên để sinh viên bước ra thế giới nghề nghiệp. Làm tốt kỳ này, bạn sẽ tự tin hơn rất nhiều cho các đợt thực tập chuyên sâu và khi đi xin việc sau này.\n\n",
  "﻿VĂN HÓA DOANH NGHIỆP TRONG NGÀNH CNTT HIỆN ĐẠI\nTài liệu hướng dẫn dành cho sinh viên IT trước kỳ thực tập nhận thức\n🔰 Lời mở đầu\nTrước khi bước chân vào kỳ thực tập tại doanh nghiệp, sinh viên ngành Công nghệ Thông tin không chỉ cần chuẩn bị về kiến thức chuyên môn, kỹ năng lập trình hay công cụ kỹ thuật – mà còn cần hiểu rõ văn hóa doanh nghiệp: cách con người làm việc, phối hợp, giao tiếp và phát triển trong một môi trường số hóa năng động.\nTài liệu này được thiết kế dành riêng cho sinh viên năm 2 ngành CNTT, giúp bạn hiểu sâu hơn về những nguyên tắc ứng xử, thái độ làm việc và môi trường văn hóa đặc trưng trong các công ty công nghệ hiện đại. Thông qua các nội dung thực tế, tình huống cụ thể và lời khuyên từ góc nhìn nghề nghiệp, bạn sẽ nắm được:\n• Văn hóa tổ chức trong lĩnh vực công nghệ thông tin và chuyển đổi số.\n• Những kỳ vọng từ doanh nghiệp dành cho thực tập sinh.\n• Các hành vi nên có – và nên tránh – để bạn không “lạc nhịp” với môi trường làm việc mới.\n• Cách để thích nghi, học hỏi và để lại dấu ấn tích cực trong thời gian ngắn.\nHãy xem đây là \"bản đồ định hướng văn hóa\" – để bạn bước vào kỳ thực tập không chỉ với kỹ năng, mà còn với sự tự tin và tư duy đúng đắn.\nTài liệu được chia thành bảy phần chính, xây dựng theo trình tự từ nhận thức nền tảng đến hành vi ứng xử thực tế. Mở đầu là mục tiêu của nội dung, nhằm giúp sinh viên hiểu rõ vai trò thiết yếu của văn hóa doanh nghiệp trong môi trường CNTT hiện đại. Phần tiếp theo trình bày khái niệm cốt lõi về văn hóa doanh nghiệp IT, cùng những đặc điểm nổi bật như tinh thần Agile, giao tiếp hai chiều, đánh giá theo hiệu suất và làm việc nhóm với công cụ số hóa. Trong bối cảnh chuyển đổi số, tài liệu cũng nhấn mạnh đến các giá trị mới như văn hóa dữ liệu, bảo mật, và học tập liên tục.\nĐặc biệt, hai phần nội dung then chốt sẽ giúp sinh viên xác định rõ ứng xử phù hợp và những điều cần tránh trong môi trường làm việc chuyên nghiệp. Cuối cùng là những lời khuyên thiết thực để sinh viên dễ dàng hòa nhập, chủ động thích nghi và phát triển bản thân ngay từ kỳ thực tập đầu tiên.\n\nII. Khái niệm Văn hóa Doanh nghiệp trong lĩnh vực IT\n1. Văn hóa doanh nghiệp là gì?\nVăn hóa doanh nghiệp là tập hợp các giá trị, niềm tin, quy tắc ứng xử và thói quen làm việc được xây dựng, duy trì và chia sẻ bởi các thành viên trong một tổ chức. Nó được thể hiện qua cách con người tương tác với nhau, đưa ra quyết định, xử lý xung đột và hoàn thành công việc.\nTrong doanh nghiệp IT, văn hóa không chỉ đơn thuần là nội quy hay khẩu hiệu treo tường. Văn hóa thực sự được thể hiện mỗi ngày qua cách mọi người:\n• Phản hồi email như thế nào.\n• Giúp đỡ nhau khi gặp lỗi hệ thống.\n• Giao tiếp khi code có bug.\n• Học hỏi công nghệ mới để không bị bỏ lại phía sau.\nTheo Eric Woodard, tác giả The Ultimate Guide to Internships, văn hóa là yếu tố quan trọng giúp bạn “hòa nhập và nổi bật” tại nơi thực tập – vì một thực tập sinh có kỹ năng tốt nhưng không hiểu văn hóa sẽ không thể thành công.\n2. Đặc trưng văn hóa doanh nghiệp IT hiện đại\na. Tư duy đổi mới, linh hoạt và sẵn sàng thay đổi\n• Trong môi trường IT, công nghệ thay đổi liên tục, các framework, ngôn ngữ lập trình, xu hướng UX/UI hay mô hình làm việc (Waterfall → Agile → DevOps) có thể thay đổi chỉ trong vài tháng.\n• Do đó, các doanh nghiệp IT xây dựng văn hóa luôn sẵn sàng thử nghiệm cái mới, chấp nhận thất bại có kiểm soát, và khuyến khích nhân viên đặt câu hỏi: “Làm thế nào để làm tốt hơn?”\n✅ Ví dụ:\nTại nhiều công ty startup công nghệ, câu nói “Fail Fast, Learn Faster” là phương châm hoạt động: thất bại sớm để rút ra bài học nhanh.\nb. Giao tiếp mở, phản hồi nhanh\n• Văn hóa giao tiếp mở không có nghĩa là “nói gì cũng được”, mà là khuyến khích nhân viên, kể cả thực tập sinh, đưa ra phản hồi thẳng thắn, xây dựng và đúng lúc.\n• Phản hồi diễn ra trực tiếp hoặc qua công cụ như Slack, Jira, Google Chat, với tinh thần “vấn đề ở đâu thì giải quyết ở đó”.\n• Đặc biệt trong các team Agile/Scrum, việc tổ chức daily stand-up, retrospective hay code review chính là những điểm chạm thể hiện rõ nét văn hóa phản hồi này.\n✅ Ghi nhớ:\nĐừng ngại hỏi! Ở doanh nghiệp IT tốt, người ta đánh giá cao người chủ động hỏi để hiểu rõ hơn, hơn là người im lặng để… sai.\nc. Đề cao kết quả và sự minh bạch\n• Doanh nghiệp IT thường đánh giá hiệu quả công việc qua kết quả đầu ra (output) chứ không phải số giờ ngồi tại văn phòng.\n• Minh bạch trong chia sẻ tiến độ công việc, giao task rõ ràng, phản hồi công bằng, là điều bắt buộc để làm việc nhóm hiệu quả.\n• Nhiều công ty thực hiện open KPI, OKRs (Objectives & Key Results) hoặc công khai dashboard theo dõi dự án để mọi người cùng nắm rõ mục tiêu chung.\n✅ Thực tế:\nTrong các nhóm Agile, mọi thành viên đều biết ai đang làm gì, vướng chỗ nào, đã xong những gì – vì thông tin được chia sẻ công khai và cập nhật liên tục.\nd. Tự chủ và tinh thần học tập liên tục\n• Nhân sự IT, dù là intern, luôn được kỳ vọng là biết tự học, tự tìm hiểu, không phụ thuộc hoàn toàn vào người hướng dẫn.\n• Văn hóa IT hiện đại không đợi “đào tạo đầy đủ rồi mới làm”, mà là “vừa học vừa làm, học để làm, làm để học”.\n• Các doanh nghiệp thường khuyến khích:\no Truy cập tài nguyên nội bộ (wiki, tài liệu onboarding).\no Tự nghiên cứu thông qua YouTube, blog, Stack Overflow.\no Tham gia các buổi tech talk, sharing nội bộ, hoặc mentoring program.\n✅ Gợi ý cho sinh viên:\nGặp công nghệ mới? Tìm hiểu qua tài liệu chính thức, đặt câu hỏi ngắn gọn, ghi chép cẩn thận, thử làm demo nhỏ – đó là cách bạn thể hiện sự “fit” với văn hóa IT.\nTrong doanh nghiệp CNTT hiện đại, văn hóa không phải là “màu sắc trang trí”, mà là “hệ điều hành của tổ chức” – chi phối cách mọi người cùng làm việc, phát triển và thành công.\nSinh viên IT bước vào kỳ thực tập cần hiểu rằng:\n• Nắm bắt văn hóa doanh nghiệp là một phần quan trọng không kém chuyên môn.\n• Tư duy linh hoạt, biết phản hồi, chủ động học và chia sẻ – đó chính là “chìa khóa mềm” để bạn nổi bật giữa một môi trường đầy cạnh tranh, sáng tạo và đổi mới.\nIII. Đặc điểm nổi bật của Văn hóa Doanh nghiệp IT\n1. Tinh thần Agile – Linh hoạt – Đổi mới\nTrong môi trường doanh nghiệp IT hiện đại, \"Agile\" không chỉ là một phương pháp quản lý dự án, mà đã trở thành một tinh thần văn hóa – tức là cách tư duy và hành động của cả tập thể để thích ứng nhanh với sự thay đổi.\na. Làm việc theo Sprint – Phản hồi nhanh – Không ngại sửa sai\n• Agile thường chia quá trình làm việc thành các chu kỳ ngắn (gọi là Sprint, thường kéo dài 1–2 tuần).\n• Mỗi sprint có mục tiêu rõ ràng, yêu cầu đội nhóm phối hợp chặt chẽ, liên tục cập nhật tình hình tiến độ.\n• Văn hóa Agile thúc đẩy giao tiếp hằng ngày, thường thông qua các buổi stand-up meeting ngắn (5–15 phút), nơi mọi người chia sẻ:\no Đã làm gì?\no Gặp khó khăn gì?\no Dự định làm gì tiếp theo?\n✅ Điều này giúp sinh viên thực tập nhanh chóng:\n• Bắt nhịp với nhóm.\n• Biết mình đang ở đâu và cần học thêm gì.\n• Không để chậm tiến độ do \"bí mà không dám hỏi\".\n🎯 Sinh viên cần hiểu: Môi trường Agile không yêu cầu bạn hoàn hảo, nhưng cần trung thực và chủ động.\nb. Thất bại là một phần tự nhiên – Văn hóa \"Fail Fast, Learn Faster\"\n• Trong môi trường công nghệ, thay đổi là liên tục: tính năng mới, framework mới, yêu cầu mới từ khách hàng.\n• Do đó, thử nghiệm – thất bại – cải tiến là chu trình quen thuộc và được chấp nhận như một phần không thể thiếu của sự phát triển.\n• Các doanh nghiệp có văn hóa Agile thường:\no Cho phép nhân viên và thực tập sinh thử nghiệm ý tưởng mới.\no Không phạt sai lầm nếu người đó có thái độ cầu thị và biết rút kinh nghiệm.\no Tổ chức các buổi “Retrospective” (xem lại sau mỗi sprint) để nhìn nhận điều gì làm tốt – điều gì cần cải thiện – ai cần hỗ trợ thêm.\n📌 Câu nói “Fail Fast, Learn Faster” phản ánh tinh thần:\nSai sớm để sửa sớm, từ đó tiết kiệm thời gian – học được bài học – tránh lặp lại lỗi.\n✅ Gợi ý cho sinh viên:\n• Gặp lỗi không che giấu – hãy mô tả rõ vấn đề, ghi lại log lỗi, và hỏi: “Tại sao nó xảy ra?”.\n• Ghi chú lại những “lesson learned” trong nhật ký thực tập, vì đó là bằng chứng bạn đang trưởng thành.\nc. Đổi mới không ngừng – Học để thích nghi\n• Tinh thần Agile luôn đi kèm với tư duy đổi mới: cải tiến sản phẩm – nâng cao hiệu suất – ứng dụng công nghệ mới.\n• Bạn sẽ thấy những cụm từ như:\no \"Continuous improvement\" – Cải tiến liên tục.\no \"Minimum Viable Product (MVP)\" – Làm cái tối thiểu nhưng có giá trị thật sự.\no \"Customer-first\" – Ưu tiên trải nghiệm người dùng.\n🎯 Môi trường IT là nơi ai học nhanh hơn, người đó đi trước. Và “sáng tạo” không phải là phát minh lớn, mà là:\n• Tìm ra cách làm nhanh hơn, dễ hơn, rõ ràng hơn.\n• Cải tiến tài liệu, code, giao diện, quy trình làm việc…\n✅ Hành động cụ thể:\n• Đừng chỉ “làm cho xong” – hãy hỏi: “Có cách nào làm tốt hơn không?”\n• Thử đề xuất thay đổi nhỏ, như: cải tiến mẫu báo cáo, thêm ghi chú vào mã nguồn, gợi ý một công cụ mới đơn giản hơn cho team.\nMôi trường IT hiện đại không thích người làm việc cứng nhắc, thụ động hoặc “ngại sai”. Họ cần những người:\n• Biết phản ứng nhanh, sẵn sàng học từ sai lầm, và luôn tìm cách làm tốt hơn mỗi ngày.\n🎓 Đối với sinh viên thực tập, tinh thần Agile chính là cơ hội để:\n• Thử – Sai – Học – Tiến bộ nhanh chóng,\n• và để lại dấu ấn dù chỉ trong vài tuần ngắn ngủi của kỳ thực tập.\n2. Môi trường phẳng – Giao tiếp hai chiều\nTrong môi trường doanh nghiệp truyền thống, thông tin và quyết định thường đi từ trên xuống (top-down), tức là từ lãnh đạo ra lệnh – cấp dưới thực hiện. Tuy nhiên, trong các doanh nghiệp IT hiện đại, mô hình quản trị “môi trường phẳng” (flat organization) được ưa chuộng hơn.\n🎯 Môi trường phẳng là gì?\n• Là mô hình tổ chức ít cấp bậc quản lý, nhấn mạnh sự giao tiếp trực tiếp, bình đẳng trong trao đổi thông tin, và khuyến khích mọi người tham gia vào quá trình ra quyết định.\n• Ở môi trường này, bạn có thể thấy một thực tập sinh ngồi cạnh trưởng nhóm, tham dự cuộc họp sản phẩm cùng với CTO (giám đốc công nghệ) – điều rất khó xảy ra trong mô hình cũ.\na. Khuyến khích phản biện – đặt câu hỏi – thảo luận công khai\n• Doanh nghiệp IT thành công luôn khuyến khích nhân viên (dù là junior hay intern) đặt câu hỏi, chia sẻ góc nhìn và phản biện mang tính xây dựng.\n• Mọi người được quyền:\no Hỏi lại lý do tại sao lại chọn giải pháp A thay vì B.\no Đưa ra gợi ý khác (dù chưa chắc đúng).\no Chia sẻ khó khăn khi thực hiện task, thay vì im lặng “làm cho xong”.\n• Các cuộc họp không phải để “nghe mệnh lệnh”, mà là nơi cùng thảo luận – cùng tìm giải pháp.\n\n\n📌 Ghi nhớ:\n“Nói đúng lúc, đúng trọng tâm, đúng cách” quan trọng hơn “nói nhiều”.\nVăn hóa phản biện lành mạnh là bạn phản biện vì mục tiêu chung, không phải để chứng minh mình giỏi hơn người khác.\n✅ Mẹo cho sinh viên:\n• Ghi chú trước khi họp: những chỗ bạn chưa hiểu, muốn hỏi hoặc muốn góp ý.\n• Nếu chưa tự tin nói trước đám đông, hãy nhắn riêng với mentor hoặc leader sau buổi họp.\nb. Tôn trọng ý kiến nhân viên – kể cả thực tập sinh\n• Trong môi trường IT phẳng, tất cả ý kiến đều có giá trị nếu giúp ích cho sản phẩm hoặc quy trình.\n• Một thực tập sinh vẫn có thể:\no Đề xuất cách sửa lỗi nhỏ trong giao diện.\no Gợi ý dùng công cụ tiện hơn để ghi nhận bug.\no Đặt một câu hỏi giúp team nhìn lại cách làm hiện tại.\n🎯 Các công ty công nghệ hàng đầu như Google, Atlassian, Base.vn, FPT Software... đều có những chương trình “Intern Ideas Channel”, “Retrospective Feedback” hay “Innovation Challenge” mở cho cả thực tập sinh.\n✅ Gợi ý cho sinh viên:\n• Nếu bạn mới vào, chưa biết bắt đầu từ đâu, hãy quan sát và đặt câu hỏi “tại sao lại làm vậy” – thường đó là điểm bắt đầu tốt để hiểu sâu hơn hoặc đóng góp góc nhìn mới.\n🧠 Một thực tập sinh thông minh không phải là người “biết hết”, mà là người biết hỏi đúng và lắng nghe đủ.\nc. Giao tiếp qua nhiều kênh – nhưng luôn tôn trọng & rõ ràng\n• Doanh nghiệp IT thường giao tiếp qua nhiều kênh:\no Slack, Google Chat, Microsoft Teams, email, Trello, Notion...\n• Mỗi kênh có mức độ trang trọng, tốc độ phản hồi và ngữ điệu khác nhau.\n• Giao tiếp hiệu quả không chỉ là “nói đúng”, mà còn phải:\no Viết rõ ràng, dễ hiểu, không viết tắt quá nhiều.\no Biết tag đúng người, đặt tiêu đề email hợp lý.\no Tránh gửi tin nhắn ngoài giờ làm nếu không khẩn cấp.\n📌 Nhớ rằng:\nGiao tiếp không hiệu quả là một trong những nguyên nhân lớn gây trì trệ trong doanh nghiệp phần mềm.\nVà ngược lại, thực tập sinh giao tiếp tốt thường được giữ lại làm chính thức.\n“Môi trường phẳng – giao tiếp hai chiều” trong doanh nghiệp IT hiện đại không chỉ là hình thức, mà là văn hóa cốt lõi giúp tăng tốc đổi mới, hiệu quả làm việc và sự phát triển của từng cá nhân.\nĐối với sinh viên thực tập:\n• Đây là cơ hội quý giá để thể hiện quan điểm, học hỏi và trưởng thành.\n• Nếu bạn biết lắng nghe, dám hỏi và phản hồi đúng lúc – bạn sẽ được tôn trọng như một thành viên thực sự trong nhóm, chứ không chỉ là một “intern tạm thời”.\n3. Đánh giá qua hiệu suất, không qua chức danh\nTrong môi trường doanh nghiệp truyền thống, chức danh và thâm niên thường quyết định vị thế, quyền ra quyết định và mức độ ảnh hưởng của một cá nhân. Tuy nhiên, doanh nghiệp IT hiện đại lại chuyển trọng tâm sang đánh giá dựa trên hiệu suất (performance) – tức là dựa vào những gì bạn thực sự tạo ra, chứ không phải bạn là ai hoặc giữ chức vụ gì.\na. Trọng hiệu quả, KPI, chất lượng công việc – không quan trọng “nói hay” hay “chức danh lớn”\n• Trong văn hóa IT, mọi người được đánh giá dựa trên các tiêu chí đo lường được, điển hình như:\no KPI (Key Performance Indicator): Chỉ số thể hiện hiệu quả công việc, ví dụ số lượng task hoàn thành, lỗi được fix, test case được viết,...\no Chất lượng sản phẩm: Code clean, ít bug, có tài liệu đi kèm, dễ bảo trì.\no Mức độ phối hợp nhóm: Phản hồi nhanh, hỗ trợ thành viên khác, cập nhật tiến độ đúng hạn.\no Khả năng giải quyết vấn đề: Chủ động đề xuất giải pháp, không né tránh khó khăn.\n• Hiệu suất công việc tốt có thể giúp một thực tập sinh được chú ý và đề xuất giữ lại làm chính thức, bất kể họ chỉ mới vào team vài tuần.\n✅ Ví dụ thực tế:\nMột thực tập sinh backend, tuy chưa có kinh nghiệm thực chiến, nhưng viết được đoạn code tối ưu hóa truy vấn giúp giảm 50% thời gian xử lý dữ liệu – kết quả này được toàn team công nhận và ghi nhận vào báo cáo sprint.\nb. Nhân sự trẻ có cơ hội thể hiện năng lực và sáng tạo\n• Vì đánh giá dựa trên kết quả thật, nên người mới – kể cả intern – có cơ hội chứng tỏ năng lực ngang hàng với nhân viên chính thức, nếu làm được việc.\n• Trong môi trường “mở” này, bạn có thể:\no Tham gia góp ý trong họp sản phẩm.\no Thực hiện một sáng kiến nhỏ như tạo template báo cáo dễ dùng hơn.\no Xây thử một công cụ tự động hóa việc kiểm tra lỗi đơn giản trong dev workflow.\n🎯 Nhớ rằng:\nTư duy “tôi chỉ là intern nên không dám đề xuất gì” là rào cản lớn nhất khiến bạn mờ nhạt trong môi trường IT.\n✅ Gợi ý cho sinh viên:\n• Trong quá trình thực tập, hãy đặt mục tiêu cụ thể theo tuần (ví dụ: học một công cụ mới, hoàn thành 1 chức năng nhỏ, viết lại 1 đoạn mã cho tối ưu hơn).\n• Ghi lại những gì bạn đã làm – vì sao làm – kết quả là gì. Những điều này chính là dấu ấn cá nhân của bạn tại doanh nghiệp.\nc. Minh bạch – Công khai – Trách nhiệm rõ ràng\n• Môi trường IT thường sử dụng các công cụ như Jira, GitHub, GitLab, Trello,... để theo dõi task – ai làm gì đều rõ ràng.\n• Điều này tạo ra sự minh bạch trong phân công và đánh giá, giảm tình trạng \"lấy công người khác\", \"ngồi chơi hưởng ké\".\n• Việc bạn có được tin tưởng giao task quan trọng hay không hoàn toàn dựa trên lịch sử làm việc của bạn.\n📌 Điều quan trọng:\nLàm tốt nhưng không ghi nhận – không trình bày – không chia sẻ → vẫn không được đánh giá.\nDo đó, kỹ năng báo cáo và trình bày kết quả công việc ngắn gọn – đúng lúc là rất cần thiết.\nDoanh nghiệp IT không nhìn vào thâm niên, không quan tâm bạn học trường nào hay đã làm bao lâu – họ nhìn vào bạn làm được gì và làm như thế nào.\n✅ Đối với sinh viên thực tập:\n• Đây là cơ hội quý giá để chứng minh bản thân bằng năng lực thật.\n• Chỉ cần bạn biết nắm bắt, chủ động học hỏi, không ngại bắt tay vào việc, thì “thẻ intern” sẽ không làm bạn thua kém bất kỳ ai trong team.\n4. Làm việc nhóm & Công cụ số hóa\nTrong môi trường doanh nghiệp IT, làm việc nhóm không đơn thuần là ngồi cùng nhau trong một phòng họp, mà là sự phối hợp liên tục thông qua các nền tảng số, công cụ quản lý dự án, hệ thống giao việc và báo cáo online.\nLàm việc hiệu quả trong môi trường này đòi hỏi mỗi thành viên – kể cả thực tập sinh – phải thành thạo các công cụ giao tiếp và quản lý kỹ thuật số, cũng như hiểu rõ cách phối hợp với người khác một cách chuyên nghiệp và có trách nhiệm.\na. Sử dụng công cụ teamwork hiện đại\nDo đặc thù của công việc CNTT là phân mảnh – mỗi người phụ trách một module, làm việc từ xa hoặc tại nhiều chi nhánh khác nhau – nên các công cụ cộng tác số hóa là không thể thiếu.\nMột số công cụ phổ biến mà bạn gần như chắc chắn sẽ tiếp xúc trong thời gian thực tập:\nNhóm công cụ\nVí dụ\nMục đích sử dụng\nGiao tiếp nội bộ\nSlack, Microsoft Teams\nNhắn tin nhóm, trao đổi nhanh theo chủ đề\nQuản lý công việc\nJira, Trello, ClickUp\nTheo dõi task, phân công, cập nhật tiến độ\nQuản lý tài liệu\nNotion, Google Docs\nViết tài liệu kỹ thuật, hướng dẫn, ghi chú\nQuản lý mã nguồn\nGitHub, GitLab\nCode chung, review code, ghi lại lịch sử\nGhi chú/họp nhóm\nMiro, Google Meet, Zoom\nHọp online, brainstorming, vẽ luồng logic\n🎯 Gợi ý cho sinh viên:\nNgay khi được tiếp nhận, hãy hỏi mentor hoặc leader bạn sẽ sử dụng công cụ nào, xin tài khoản và học cách dùng cơ bản trong tuần đầu tiên. Điều này thể hiện bạn chủ động hòa nhập với môi trường làm việc chuyên nghiệp.\n✅ Hành vi cần tránh:\n• Không kiểm tra task mới giao trong Jira.\n• Trả lời chậm tin nhắn Slack/Teams.\n• Gửi tài liệu lung tung qua Zalo/email cá nhân thay vì Google Drive nội bộ.\nb. Họp online – Báo cáo tự động – Giao việc qua hệ thống\n🌐 Họp online\n• Các cuộc họp daily/weekly (qua Zoom, Meet...) giúp cập nhật tiến độ và xử lý vướng mắc. Sinh viên cần:\no Chuẩn bị trước nội dung chia sẻ.\no Ghi chú lại các đầu việc sau họp (action items).\no Không ngắt lời, giữ micro tắt khi không nói, mở camera nếu yêu cầu.\n📝 Báo cáo tự động\n• Một số team sử dụng Google Form, Notion hoặc Slack bot để cập nhật báo cáo tiến độ hằng ngày/tuần.\n• Dạng báo cáo thường gồm: \"Hôm nay làm gì – Vướng mắc gì – Dự định ngày mai\".\n✅ Lưu ý:\nViết ngắn gọn – đúng nội dung – cập nhật đúng giờ.\nĐiều này không chỉ giúp người hướng dẫn nắm tình hình, mà còn giúp bạn rèn thói quen làm việc chuyên nghiệp.\n📌 Giao việc – phân quyền rõ ràng\n• Không còn cảnh “sếp bảo miệng”, mọi task đều được ghi rõ trên hệ thống (Trello card, Jira issue).\n• Task luôn có deadline, người phụ trách, trạng thái (To do – In progress – Done).\n🎓 Đây là nơi bạn:\n• Tự theo dõi được tiến độ của mình.\n• Biết task nào cần ưu tiên.\n• Biết ai là người mình có thể hỏi hỗ trợ.\n\nc. Tư duy phối hợp nhóm trong môi trường số hóa\n• Trong môi trường số hóa, sự phối hợp hiệu quả không đến từ “ngồi cùng nhau”, mà từ:\no Cập nhật trạng thái công việc thường xuyên.\no Giao tiếp đúng kênh, đúng người, đúng lúc.\no Sẵn sàng giúp đỡ nhau qua công cụ từ xa.\n✅ Kỹ năng “mềm nhưng số”:\n• Biết cách tag người liên quan khi cần hỗ trợ: @anhNam, @frontend-team.\n• Gửi link tài liệu đúng định dạng, có phân quyền truy cập.\n• Biết giữ trật tự thông tin: không spam nhóm, tôn trọng thời gian người khác.\n\nVăn hóa làm việc nhóm trong doanh nghiệp IT ngày nay gắn liền với kỹ năng sử dụng công cụ số và ý thức phối hợp chủ động.\nĐối với sinh viên thực tập:\n• Việc bạn hiểu – sử dụng – tuân thủ đúng công cụ quản lý công việc là một yếu tố cực kỳ quan trọng để được đánh giá cao.\n• Đây cũng là điểm mấu chốt giúp bạn bắt nhịp nhanh, tránh lạc lõng, và khẳng định mình như một người đã sẵn sàng bước vào môi trường làm việc chuyên nghiệp.\nIV. Yếu tố văn hóa đặc trưng trong bối cảnh chuyển đổi số\n1. Văn hóa dữ liệu (Data-driven)\nTrong thời đại chuyển đổi số, dữ liệu không chỉ là tài sản, mà còn là nền tảng để ra quyết định, xây dựng sản phẩm, cải tiến quy trình và đo lường hiệu quả. Các doanh nghiệp IT hiện đại đang dần chuyển từ việc “làm theo cảm tính” sang “làm theo dữ liệu” – gọi là văn hóa dữ liệu (Data-driven culture).\na. Quyết định dựa trên dữ liệu, không dựa trên cảm tính\n• Trong một tổ chức data-driven, mọi quyết định – từ lựa chọn giao diện người dùng, ưu tiên tính năng mới, đến cách tối ưu hạ tầng – đều cần có căn cứ từ dữ liệu thực tế, thay vì dựa vào “suy đoán” hay “kinh nghiệm chủ quan”.\n\n\n📌 Ví dụ:\nTrước khi quyết định thay đổi giao diện app, team sản phẩm sẽ phân tích hành vi người dùng qua Google Analytics, heatmap, thời gian thao tác, và tỷ lệ chuyển đổi (conversion rate) – chứ không chỉ dựa vào “cảm giác nhìn đẹp hơn”.\nb. Dữ liệu được thu thập – chia sẻ – và phân tích có mục tiêu\n• Các doanh nghiệp IT hiện đại thu thập và phân tích nhiều loại dữ liệu:\no Dữ liệu người dùng: tương tác, hành vi, phản hồi.\no Dữ liệu hệ thống: log lỗi, hiệu suất, uptime.\no Dữ liệu vận hành: task hoàn thành, hiệu suất team, thời gian giao hàng.\n• Các công cụ phổ biến trong môi trường data-driven:\no Google Analytics, Mixpanel (hành vi người dùng).\no Metabase, Power BI, Looker (dashboard phân tích).\no ELK stack, Grafana, Prometheus (giám sát hệ thống).\no Airtable, Notion, BigQuery (truy xuất và phân tích dữ liệu nội bộ).\n✅ Đối với sinh viên thực tập:\nDù bạn không trực tiếp xử lý dữ liệu, nhưng hiểu văn hóa này giúp bạn biết cách đặt câu hỏi, đưa ra đề xuất hoặc báo cáo theo hướng “dựa trên số liệu”.\nc. Trách nhiệm sử dụng dữ liệu minh bạch & có đạo đức\n• Dữ liệu là tài nguyên quý giá nhưng cũng ẩn chứa rủi ro: lạm dụng, vi phạm riêng tư, hiểu sai số liệu.\n• Do đó, một doanh nghiệp có văn hóa dữ liệu tốt phải:\no Tôn trọng quyền riêng tư người dùng (theo GDPR, PDPA...).\no Công khai logic phân tích và cách thu thập dữ liệu.\no Không thao túng số liệu để “làm đẹp báo cáo”.\n🎓 Lưu ý cho sinh viên:\nKhi ghi nhận, trích dẫn hoặc báo cáo dữ liệu thực tập, hãy ghi rõ nguồn dữ liệu, thời điểm thu thập, cách đo lường để đảm bảo tính minh bạch và chính xác.\n\n\nd. Tư duy dữ liệu trong mọi vị trí – kể cả intern\n• Trong một tổ chức data-driven, mọi cá nhân đều được kỳ vọng có tư duy dữ liệu, không chỉ riêng vị trí “phân tích dữ liệu” hay “data scientist”.\n• Thực tập sinh cũng có thể áp dụng tư duy này trong những việc đơn giản như:\no Đếm số lượng lỗi lặp lại khi kiểm thử sản phẩm.\no Thống kê thời gian xử lý trung bình mỗi task.\no Ghi nhận tần suất phản hồi từ mentor để cải tiến cách giao tiếp.\n✅ Ví dụ cụ thể:\nMột thực tập sinh DevOps đã chủ động tạo bảng thống kê thời gian downtime của hệ thống qua log và đề xuất cải thiện cấu hình cronjob – được team ghi nhận vì phân tích dựa trên dữ liệu, không chỉ than phiền.\nVăn hóa dữ liệu là cốt lõi trong các tổ chức chuyển đổi số. Nó thúc đẩy tính logic, minh bạch và liên tục cải tiến, giúp tổ chức ra quyết định chính xác hơn – và giúp cá nhân phát triển tư duy phản biện, khách quan.\n✅ Đối với sinh viên thực tập:\n• Đừng chỉ “cảm thấy” – hãy đo lường, ghi nhận, và dựa vào số liệu để học hỏi và cải tiến.\n• Khi bạn tư duy theo hướng data-driven, bạn sẽ:\no Được lắng nghe nhiều hơn.\no Được tin tưởng giao việc.\no Và trở thành một phần giá trị thực sự của team – dù bạn chỉ mới là intern.\n2. Tôn trọng bảo mật và quyền riêng tư\nTrong thời đại số hóa, nơi mọi thao tác – dữ liệu – và hành vi người dùng đều được lưu trữ trên hệ thống, việc bảo mật thông tin và tôn trọng quyền riêng tư không chỉ là trách nhiệm của phòng kỹ thuật, mà là văn hóa bắt buộc đối với toàn bộ nhân viên, kể cả thực tập sinh.\nKhông tuân thủ quy định bảo mật có thể gây hậu quả nghiêm trọng như:\n• Rò rỉ dữ liệu khách hàng.\n• Tấn công mạng (cyber attack).\n• Mất uy tín, thiệt hại tài chính và pháp lý cho doanh nghiệp.\na. Hiểu đúng về bảo mật trong môi trường IT\nBảo mật không chỉ là “không hack”, mà bao gồm:\n• Bảo vệ dữ liệu nội bộ: source code, tài liệu kỹ thuật, roadmap sản phẩm.\n• Bảo vệ dữ liệu người dùng: email, thông tin tài khoản, lịch sử thao tác,...\n• Bảo vệ hạ tầng và tài khoản: không chia sẻ mật khẩu, khóa API, mã OTP,...\n• Tuân thủ quy trình truy cập: đúng người – đúng quyền – đúng thời điểm.\n🎯 Văn hóa bảo mật yêu cầu mỗi cá nhân đều phải:\n• Nhận thức được thông tin nào là nhạy cảm.\n• Không tự ý copy, chia sẻ, hoặc lưu trữ dữ liệu ra ngoài hệ thống.\n• Không chụp ảnh màn hình khi chưa được phép, kể cả khi viết báo cáo thực tập.\nb. Tôn trọng quyền riêng tư của khách hàng và người dùng\n• Trong các doanh nghiệp phát triển phần mềm, ứng dụng web hoặc hệ thống quản trị, bạn có thể sẽ truy cập được vào thông tin thật của người dùng như:\no Họ tên, email, số điện thoại.\no Hành vi truy cập hệ thống.\no File đính kèm, nội dung giao dịch.\n• Tuyệt đối không được sử dụng, lưu lại hoặc chia sẻ các thông tin này – kể cả vô tình.\n✅ Ghi nhớ:\nKhông được “thử” đăng nhập vào tài khoản khách hàng thật, kể cả chỉ để test. Hành vi này có thể bị xem là xâm phạm dữ liệu và bị xử lý nghiêm.\nc. Tuân thủ chính sách bảo mật của công ty\nHầu hết các doanh nghiệp IT đều có quy định bảo mật, bao gồm:\n• Cam kết bảo mật (NDA) cho nhân viên, kể cả intern.\n• Chính sách bảo mật thiết bị: không cắm USB lạ, không gửi mã nguồn qua email cá nhân.\n• Chính sách xử lý dữ liệu cá nhân: tuân thủ các luật như GDPR (Châu Âu), PDP (Singapore), Nghị định 13/2023 của Việt Nam.\n📌 Sinh viên cần:\n• Đọc kỹ nội quy bảo mật ngay ngày đầu nhận việc.\n• Hỏi rõ khi được phân công xử lý dữ liệu thật.\n• Không dùng máy tính cá nhân cho các tác vụ được yêu cầu bảo mật cao, nếu không được cho phép.\nd. Tránh các hành vi vô tình vi phạm bảo mật\nMột số lỗi phổ biến mà sinh viên thực tập thường mắc phải:\n• Copy tài liệu, source code về máy cá nhân để “học thêm”.\n• Gửi hình ảnh màn hình phần mềm nội bộ lên mạng xã hội (Facebook, LinkedIn).\n• Chia sẻ thông tin công việc với bạn bè, người ngoài công ty.\n• Đăng ảnh nơi làm việc có chứa thông tin khách hàng.\n🎓 Lưu ý:\nTrong nhiều công ty công nghệ, chỉ cần một vi phạm nhỏ về bảo mật cũng có thể khiến bạn bị loại khỏi chương trình thực tập ngay lập tức.\nTôn trọng bảo mật và quyền riêng tư là nguyên tắc đạo đức – luật pháp – và là tiêu chuẩn văn hóa trong mọi doanh nghiệp công nghệ hiện đại.\n✅ Đối với sinh viên thực tập:\n• Thái độ cẩn trọng, trách nhiệm và chủ động hỏi khi chưa chắc chắn là dấu hiệu của một người chuyên nghiệp thật sự, dù bạn chỉ là intern.\n• Bạn không cần biết tất cả về an ninh mạng, nhưng bạn phải:\no Nhận thức rõ điều gì là “cấm kỵ”.\no Tuân thủ đúng quy trình khi xử lý thông tin.\n3. Học tập và thích nghi liên tục\nTrong môi trường công nghệ – nơi mọi công nghệ, framework, quy trình có thể \"lỗi thời sau vài tháng\" – việc học không còn là một giai đoạn, mà là một quá trình liên tục, suốt đời. Đây không chỉ là yêu cầu chuyên môn, mà đã trở thành một phần cốt lõi trong văn hóa doanh nghiệp IT hiện đại.\na. Khuyến khích học công nghệ mới – chuyển đổi kỹ năng nhanh\n• Các công ty công nghệ không đánh giá cao những người “giỏi cố định một công cụ”, mà đề cao người có khả năng:\no Thích nghi nhanh với công nghệ mới.\no Tự học – tự cập nhật khi có sự thay đổi.\no Dám học cái mới dù chưa từng biết.\n✅ Ví dụ:\nBackend hôm qua viết Node.js, tuần sau có thể chuyển qua Golang nếu dự án yêu cầu. Frontend dùng React nhưng team đang thử nghiệm với Svelte.\nViệc linh hoạt công nghệ như vậy không phải ngoại lệ – mà là tiêu chuẩn!\n🎓 Lời khuyên cho sinh viên:\n• Đừng nói: “Em chưa học cái đó ở trường.”\nHãy thử nói: “Em chưa biết, nhưng nếu có tài liệu em sẽ nghiên cứu ngay.”\nb. “Learning on the job” – Học khi làm, làm để học\n• Tư duy “được học trước rồi mới làm” không còn phù hợp trong doanh nghiệp IT. Thay vào đó là:\no Học song song trong quá trình làm việc.\no Học từ đồng đội, từ feedback, từ sai lầm.\no Gặp vấn đề → tìm hiểu → thử làm → hỏi mentor → làm lại tốt hơn.\n💡 Văn hóa này giúp bạn:\n• Tự tin hơn khi đối diện với task chưa từng làm.\n• Phát triển “năng lực tự học” – kỹ năng cốt lõi để sống sót trong ngành IT.\n✅ Mẹo nhỏ:\nKhi được giao task mới, đừng chỉ hỏi “Làm sao để làm?”.\nHãy hỏi thêm: “Có tài liệu/dự án mẫu nào em có thể tham khảo không?”\nc. Văn hóa đọc, chia sẻ tài liệu nội bộ\n• Các công ty IT thường xây dựng “kho tri thức nội bộ” (wiki nội bộ, Notion, GitHub Repo, tài liệu trên Google Drive...) nơi nhân viên lưu lại:\no Hướng dẫn sử dụng hệ thống.\no Cách setup môi trường phát triển.\no Kinh nghiệm xử lý lỗi đặc biệt.\no Ghi chú về công cụ, framework, best practices.\n• Nhân viên được khuyến khích chia sẻ kiến thức mới học được dưới nhiều hình thức:\no Viết blog kỹ thuật nội bộ.\no Trình bày tại “tech talk” định kỳ.\no Gửi email hoặc bài viết ngắn trên Slack nhóm.\n✅ Gợi ý cho sinh viên:\n• Nếu học được điều gì hay trong quá trình thực tập (ví dụ: cách debug lỗi mạng, cách setup môi trường nhanh...), hãy viết lại và chia sẻ, dù chỉ trong team nhỏ.\n• Bạn sẽ được đánh giá là “người có tinh thần chia sẻ – chuyên nghiệp”, chứ không chỉ là “học việc”.\nd. Tinh thần cầu tiến – không ngại cái mới – không sợ cái khó\n• Một điểm chung của nhân viên tốt trong môi trường IT: luôn tò mò – luôn muốn hiểu sâu hơn.\n• Văn hóa này khuyến khích:\no Dám hỏi: “Tại sao lại làm như vậy?”\no Dám đề xuất: “Nếu thử làm cách khác thì sao?”\no Dám thử: “Em xin làm thử tính năng này, nếu được góp ý thêm.”\n🎯 Điều quan trọng không phải là “biết hết”, mà là không ngừng học hỏi, thích nghi và tiến bộ mỗi ngày.\nTrong doanh nghiệp IT, học không phải là nhiệm vụ thêm, mà là một phần công việc và văn hóa sống còn.\n✅ Đối với sinh viên thực tập:\n• Bạn sẽ không bị đánh giá vì “không biết”, nhưng sẽ bị đánh giá nếu không chịu học.\n• Người “có tiềm năng giữ lại” không phải là người giỏi nhất – mà là người biết học, biết thay đổi, và không ngừng tiến bộ.\nV. Ứng xử và thái độ phù hợp với văn hóa IT (viết chi tiết)\n• Giao tiếp chuyên nghiệp: rành mạch, đúng nội dung, đúng công cụ\nTrong môi trường IT hiện đại, giao tiếp không chỉ là trao đổi lời nói – mà là kỹ năng nền tảng để vận hành dự án hiệu quả. Giao tiếp chuyên nghiệp bao gồm ba yếu tố cốt lõi:\n1. Rõ ràng – đúng nội dung:\nThay vì viết những tin nhắn chung chung như “em xong rồi” hoặc “anh xem giúp em cái này với”, cần ghi cụ thể nội dung như:\n\"Em đã hoàn thành chức năng A theo yêu cầu ở task #125. Nhờ anh review phần validate dữ liệu ở hàm checkInput() trong file UserService.cs.\"\nCách này giúp tiết kiệm thời gian, tránh hiểu sai, thể hiện rõ tinh thần chuyên nghiệp.\n2. Đúng công cụ – đúng kênh:\nMỗi công cụ có mục đích riêng:\no Slack, Microsoft Teams: dùng cho trao đổi nhanh, thảo luận ngắn.\no Email: dùng khi cần ghi nhận chính thức, tổng hợp hoặc gửi báo cáo.\no Jira, Trello, GitHub Issue: dùng để cập nhật task, tình trạng xử lý.\nKhông nên gửi báo cáo deadline qua chat cá nhân, hoặc đưa ý kiến kỹ thuật phức tạp chỉ qua cuộc gọi thoại không ghi lại nội dung.\n3. Giữ thái độ tích cực – tôn trọng người đối thoại:\nViệc trao đổi thẳng thắn không đồng nghĩa với nói trống không, thiếu lịch sự. Trong văn hóa IT, những người vừa rõ ràng vừa tử tế luôn được đánh giá cao.\n• Làm việc độc lập nhưng luôn sẵn sàng phối hợp\nMột trong những đặc trưng rõ nét của doanh nghiệp IT là tính phân rã công việc nhưng kết nối chặt chẽ về mục tiêu. Mỗi thành viên thường phụ trách module riêng, nhưng kết quả cuối cùng lại phụ thuộc vào sự phối hợp liên phòng ban hoặc giữa nhiều cá nhân.\n• Làm việc độc lập:\nThể hiện ở việc tự chủ động đọc tài liệu, debug lỗi, hoàn thành task mà không chờ nhắc. Một thực tập sinh dù mới vẫn có thể chủ động tìm hiểu, tự test lại chức năng thay vì chờ mentor chỉ từng bước.\n• Sẵn sàng phối hợp:\nKhi có yêu cầu từ QA, DevOps hay PM, cần hợp tác nhanh, trả lời đủ thông tin, chia sẻ source hoặc log đúng lúc. Đừng ngại hỗ trợ người khác khi mình rảnh – đây là cách bạn thể hiện “team player” – điều rất được trân trọng trong văn hóa IT.\n• Tránh “độc lập quá mức”:\nKhông ai làm phần mềm một mình. Nếu gặp vấn đề quá 1-2 giờ không giải quyết được, hãy hỏi đúng người. Tinh thần “tự xử tới cùng” đôi khi trở thành rào cản tiến độ chung.\n✅ Ghi nhớ: Một lập trình viên giỏi không chỉ là người “code giỏi”, mà là người biết làm việc hiệu quả trong hệ thống, với con người và công cụ.\n• Chủ động đề xuất – không thụ động chờ phân công\nTrong các doanh nghiệp IT hiện đại, đặc biệt là những nơi vận hành theo mô hình Agile/Scrum, việc chờ đợi người khác giao việc hoặc nhắc nhở thường bị xem là thiếu tinh thần trách nhiệm.\n• Chủ động là kỹ năng sống còn:\nKhi hoàn thành công việc, thay vì “ngồi đợi”, sinh viên thực tập nên chủ động:\no Hỏi thêm task kế tiếp.\no Gợi ý cải tiến quy trình đang quan sát.\no Đề xuất hỗ trợ thành viên khác trong team.\no Tìm hiểu và học thêm công nghệ mà nhóm đang dùng.\n• Chủ động không có nghĩa là làm thay:\nVí dụ, khi thấy hệ thống chậm, thay vì tự sửa server, hãy đưa ra ý kiến:\n“Em thấy truy vấn trong module X đang load lâu hơn 5 giây, nếu anh/chị cần em log lại chi tiết query để hỗ trợ kiểm tra.”\nTinh thần “thấy việc là hỏi – thấy vướng là gợi ý” được đánh giá cao hơn nhiều so với việc chỉ hoàn thành phần việc được giao.\n✅ Ghi nhớ: Một thực tập sinh chủ động sẽ nhanh chóng trở thành người được tin tưởng và giao nhiệm vụ quan trọng hơn – đó là nền tảng để bạn “chuyển vai” từ người học sang người tạo giá trị.\n• Tôn trọng deadline – báo cáo đúng tiến độ\nDeadline không chỉ là “ngày kết thúc công việc”, mà còn là cam kết trách nhiệm trong mọi dự án IT.\n• Văn hóa tôn trọng thời gian:\no Trễ deadline ảnh hưởng đến toàn bộ team: QA phải chờ để test, PM không thể báo cáo khách hàng.\no Việc hoàn thành đúng tiến độ không chỉ nói lên kỹ năng làm việc mà còn phản ánh thái độ chuyên nghiệp.\n• Cách làm chủ tiến độ hiệu quả:\no Ngay từ đầu, hãy xác định rõ mình mất bao lâu cho từng phần việc.\no Cập nhật thường xuyên trên công cụ quản lý (Jira, Trello…) để cả nhóm nắm được tiến độ.\no Nếu thấy có rủi ro trễ deadline, báo trước ít nhất 1-2 ngày để có phương án hỗ trợ.\n• Về báo cáo:\no Không cần dài dòng, quan trọng là trung thực, rõ ràng, có mốc thời gian và vấn đề phát sinh (nếu có).\no Báo cáo đúng thời điểm là cách bạn thể hiện tôn trọng người hướng dẫn và team.\n✅ Ghi nhớ: \"Em sắp xong rồi\" không phải là báo cáo. \"Em đã xong phần xử lý input và đang test xử lý lỗi null – dự kiến hoàn tất trong sáng mai\" mới là thông tin có giá trị.\n• Không đổ lỗi – nhận trách nhiệm – đề xuất giải pháp\nTrong một môi trường phẳng như IT, nơi mọi thay đổi đều được log lại, việc “đổ lỗi” không những không giúp bạn thoát trách nhiệm mà còn làm mất lòng tin từ đồng đội.\n• Tinh thần trách nhiệm cá nhân:\no Khi gặp lỗi, không nên nói: “Do anh A không nhắc em” hoặc “Tại backend chưa sẵn sàng”.\no Hãy nói: “Phần em làm chưa tính đến trường hợp X. Em đang sửa và sẽ cập nhật lại task trong hôm nay.”\n• Đề xuất thay vì biện minh:\no Người đi thực tập không cần phải biết hết, nhưng cần thể hiện tư duy giải quyết vấn đề:\n“Hiện em chưa rõ cơ chế caching đang dùng. Em đã đọc tài liệu nhưng còn một số điểm chưa hiểu, nhờ anh/chị gợi ý tài liệu hoặc hướng dẫn thêm.”\n• Sai không đáng sợ, sợ là... không dám nhận sai:\nVăn hóa IT đánh giá cao người biết nhận lỗi – và học được điều gì đó từ lỗi đó.\n✅ Ghi nhớ: Thực tập là để sai, nhưng sai rồi không rút kinh nghiệm – đó mới là sai lầm thật sự.\nVI. Những điều nên tránh trong môi trường doanh nghiệp IT\n• Tư duy cứng nhắc, không tiếp thu góp ý\nTrong môi trường IT – nơi công nghệ, công cụ và yêu cầu thay đổi từng ngày – tư duy linh hoạt và tinh thần cầu thị là yếu tố sống còn. Ngược lại, người có tư duy cứng nhắc thường rơi vào trạng thái bị động, khó hòa nhập và bị \"bỏ lại phía sau\".\n• Biểu hiện thường thấy:\no Luôn cho rằng “cách của mình là đúng nhất”, phản bác mọi góp ý mà không cân nhắc.\no Gặp phản hồi code review thì phản ứng phòng thủ: “Em làm theo hướng dẫn rồi mà.”\no Từ chối thử công nghệ mới vì... “trước giờ vẫn làm vậy”.\n• Tác hại:\no Dễ xung đột với đồng nghiệp, mất đi cơ hội học hỏi và cải thiện kỹ năng.\no Không theo kịp sự phát triển chung của dự án hoặc công ty.\no Tự đánh mất hình ảnh của mình trong mắt người hướng dẫn hoặc team leader.\n• Giải pháp khuyến nghị:\no Tiếp nhận phản hồi với thái độ học hỏi, không cá nhân hóa lời góp ý.\no Trả lời lại bằng sự tích cực:\n“Cảm ơn anh/chị đã góp ý, em sẽ thử cách này để cải thiện hiệu năng.”\no Biết phản biện khi cần, nhưng dựa trên lý lẽ kỹ thuật rõ ràng, không dựa vào cảm tính.\n✅ Ghi nhớ: Văn hóa IT không yêu cầu bạn luôn đúng – mà yêu cầu bạn sẵn sàng sửa sai để làm tốt hơn.\n• Thiếu trách nhiệm trong teamwork: “chờ giao việc”, “không phải việc của mình”\nMột trong những điểm trừ lớn nhất trong môi trường làm việc IT là thái độ “làm đúng phần mình, còn lại không quan tâm”. Đây là biểu hiện rõ ràng của việc thiếu tinh thần đồng đội – yếu tố quan trọng trong bất kỳ dự án công nghệ nào.\n• Các biểu hiện thường gặp:\no Đợi được giao việc mới làm, không chủ động nhận task tiếp theo.\no Khi thấy teammate cần giúp đỡ thì im lặng hoặc nói: “Phần đó không liên quan đến em.”\no Khi hệ thống gặp lỗi chung thì chỉ check đúng module của mình, còn lại “kệ”.\n• Vì sao nguy hiểm?\no Mỗi sản phẩm IT là kết quả của một chuỗi liên kết – khi một mắt xích yếu đi, cả hệ thống sẽ bị ảnh hưởng.\no Teamwork không đơn thuần là chia việc, mà còn là chia sẻ trách nhiệm thành công.\n• Hành xử chuyên nghiệp nên có:\no Luôn cập nhật tiến độ dự án để biết mình có thể hỗ trợ phần nào.\no Khi rảnh, chủ động hỏi:\n“Hiện em đã hoàn tất phần xử lý form. Có task nào em có thể hỗ trợ thêm không anh/chị?”\no Nếu thấy lỗi ở phần khác, báo lại hoặc gợi ý khắc phục thay vì bỏ qua.\n✅ Ghi nhớ: Làm việc theo nhóm không phải là “làm đúng phần của mình”, mà là đóng góp để cả nhóm hoàn thành mục tiêu.\n• Giao tiếp không rõ ràng, không phản hồi email/chat nội bộ kịp thời\nTrong môi trường IT, nơi phần lớn tương tác công việc diễn ra qua các kênh online (Slack, Teams, Email, Jira...), việc giao tiếp thiếu rõ ràng hoặc phản hồi chậm là nguyên nhân phổ biến gây đình trệ công việc.\n• Biểu hiện phổ biến:\no Gửi tin nhắn quá ngắn gọn, không có ngữ cảnh: “Xong rồi đó anh”, “Em chưa thấy”, “Nó lỗi”.\no Không xác nhận khi nhận task mới, khiến team không biết tình trạng tiến độ.\no Đọc tin nhắn nhưng không phản hồi, để người khác phải “nhắc lại lần 2”.\n• Tác động tiêu cực:\no Gây hiểu lầm, làm chậm quy trình xử lý task hoặc kiểm thử.\no Làm giảm hiệu quả phối hợp nhóm, nhất là khi làm việc từ xa.\no Tạo ấn tượng thiếu chuyên nghiệp, đặc biệt với mentor hoặc quản lý dự án.\n• Cách cải thiện:\no Luôn cung cấp đủ thông tin: thời điểm, nội dung cụ thể, trạng thái xử lý.\nVí dụ: “Em đã push commit lên branch feature/login-fix. Nhờ anh review trước 3h chiều.”\no Nếu chưa có câu trả lời ngay, phản hồi ngắn: “Em đã nhận được, đang kiểm tra – sẽ phản hồi sớm.”\no Kiểm tra Slack/email ít nhất 2-3 lần mỗi buổi làm việc – kể cả khi không có thông báo.\n✅ Ghi nhớ: Trong văn hóa doanh nghiệp IT, im lặng = không làm việc. Rõ ràng, chủ động và đúng lúc chính là “ngôn ngữ chuyên nghiệp” của người đi thực tập.\n• Vi phạm bảo mật, sao chép mã nguồn, tự ý chia sẻ thông tin\nMột trong những nguyên tắc tối quan trọng trong văn hóa doanh nghiệp IT là bảo mật và đạo đức nghề nghiệp. Sinh viên thực tập cần đặc biệt cẩn trọng vì chỉ một sơ suất nhỏ cũng có thể dẫn đến hậu quả nghiêm trọng, ảnh hưởng đến cả doanh nghiệp.\n• Các hành vi nghiêm cấm:\no Sao chép mã nguồn của công ty về dùng cá nhân, chia sẻ cho bạn bè hoặc đăng lên mạng.\no Chụp ảnh màn hình code, tài liệu nội bộ rồi đăng lên mạng xã hội (ngay cả với mục đích khoe kết quả làm việc).\no Sử dụng dữ liệu khách hàng vào mục đích khác, hoặc lưu trữ trái phép trên thiết bị cá nhân.\no Dùng tài khoản không đúng quy định để truy cập hệ thống công ty.\n• Hậu quả tiềm ẩn:\no Bị kết thúc thực tập ngay lập tức, không được đánh giá kết quả học phần.\no Doanh nghiệp có thể báo cáo vi phạm về trường hoặc khởi kiện nếu nghiêm trọng.\no Mất uy tín cá nhân trong ngành – ảnh hưởng lâu dài đến cơ hội nghề nghiệp.\n• Thái độ đúng đắn:\no Khi không chắc điều gì được phép hoặc không, hãy hỏi trước – làm sau.\no Nếu cần lưu lại thông tin để viết báo cáo, cần xin phép rõ ràng và được đồng ý bằng văn bản/email.\no Đối xử với tài nguyên công ty như tài sản cá nhân: bảo vệ – không chia sẻ – không xâm phạm.\n✅ Ghi nhớ: Dù là sinh viên thực tập, bạn vẫn đang hoạt động trong một môi trường chuyên nghiệp có quy chuẩn pháp lý đầy đủ. Chỉ cần một hành động thiếu suy nghĩ, bạn có thể mất đi nhiều hơn một kỳ thực tập.\nVII. Lời khuyên cho sinh viên khi hòa nhập môi trường IT\n• Quan sát kỹ – học nhanh – giao tiếp đủ\nNgay từ những ngày đầu thực tập, việc chủ động quan sát môi trường làm việc là yếu tố quan trọng giúp bạn thích nghi nhanh chóng và đúng cách.\n• Quan sát kỹ để hiểu bối cảnh:\no Mỗi công ty có cách tổ chức, giao tiếp và xử lý công việc khác nhau. Việc quan sát giúp bạn hiểu: ai làm gì, ai quyết định cái gì, quy trình ra sao, công cụ nào được dùng...\no Thay vì đặt quá nhiều câu hỏi ngay từ đầu, hãy dành thời gian lắng nghe và ghi chép. Hỏi đúng lúc – đúng người – đúng việc là cách học hiệu quả.\n• Học nhanh – nhưng không vội vàng:\no Khi được giao task mới, hãy tìm hiểu kỹ yêu cầu, đọc lại tài liệu liên quan (có thể đã được chia sẻ từ trước), xem qua các ví dụ cũ hoặc hỏi người hướng dẫn về các tình huống tương tự.\no Đừng lo lắng nếu bạn chưa biết công nghệ đó – điều quan trọng là bạn biết cách học và chứng minh mình đang tiến bộ mỗi ngày.\n• Giao tiếp đủ – không dư, không thiếu:\no “Đủ” nghĩa là bạn cập nhật tiến độ đúng lúc, hỏi khi cần thiết, phản hồi khi có yêu cầu – không im lặng, không đoán mò.\no Không nên “spam” tin nhắn, gửi 3–4 câu rời rạc liên tiếp gây loãng thông tin. Thay vào đó, hãy tập thói quen gói gọn thông tin trong một lần gửi, có chủ đề rõ ràng.\n✅ Ghi nhớ: Thực tập không phải để chứng minh bạn biết hết – mà là để thể hiện bạn biết học đúng cách, biết thích nghi đúng lúc và biết giao tiếp đúng mức.\n• Chủ động xin góp ý sau mỗi công việc đã làm\nMột trong những lợi thế lớn nhất khi thực tập là bạn có quyền sai và được sửa sai – miễn là bạn chủ động học từ điều đó. Và cách tốt nhất để học nhanh chính là xin góp ý một cách có chủ đích.\n• Tại sao cần chủ động?\no Người hướng dẫn có thể bận, hoặc không biết bạn đang chờ nhận xét.\no Việc bạn chủ động cho thấy tinh thần học hỏi nghiêm túc – một điểm cộng lớn trong mắt mentor hoặc leader.\n• Cách hỏi góp ý hiệu quả:\no Sau mỗi phần việc (ví dụ: xử lý form, viết API, sửa bug), hãy chủ động hỏi:\n“Anh/chị có thể review giúp em phần này không? Em muốn biết cách viết có rõ ràng và đúng convention chưa.”\no Hoặc sau khi nhận task lớn hơn, hãy hỏi:\n“Phần em làm có gì cần cải thiện thêm không ạ? Em sẵn sàng sửa lại nếu cần.”\n• Tiếp nhận góp ý một cách chuyên nghiệp:\no Không phản ứng phòng thủ hay “bào chữa” cho cái sai của mình.\no Ghi lại các góp ý để tránh lặp lại lỗi trong những lần sau.\no Cảm ơn người góp ý và phản hồi lại sau khi đã sửa.\n✅ Ghi nhớ: Góp ý là tài nguyên quý – người học nhanh nhất là người không đợi bị nhắc, mà tự tìm cơ hội để được chỉnh sửa.\n• Ghi nhận những “điểm văn hóa khác biệt” để tự điều chỉnh dần\nKhi bước vào doanh nghiệp IT, sinh viên sẽ nhận ra nhiều điểm khác biệt so với môi trường học tập ở giảng đường – từ cách giao tiếp, tổ chức công việc, đến kỳ vọng về trách nhiệm cá nhân. Thay vì phản ứng chống đối hoặc cố gắng “ép mình hòa nhập ngay”, hãy chọn cách ghi nhận – phân tích – điều chỉnh từng bước.\n• Văn hóa công ty không phải lúc nào cũng giống nhau:\no Có nơi đề cao quy trình chặt chẽ, có nơi khuyến khích linh hoạt và sáng tạo.\no Có team giao tiếp qua chat nhiều, có team lại ưa gọi trực tiếp hoặc họp nhanh.\no Có nơi nói thẳng, sửa nhanh; nơi khác lại thiên về trao đổi nhẹ nhàng, tránh gây áp lực.\n• Hành vi phù hợp là hành vi biết thích nghi:\no Quan sát cách các thành viên kỳ cựu tương tác, xử lý vấn đề – từ đó xác định “chuẩn mực ngầm” của môi trường đó.\no Ví dụ: khi thấy mọi người đều trả lời email trong vòng 1 giờ, bạn cũng nên điều chỉnh theo – thay vì đợi đến cuối ngày mới phản hồi.\no Việc ghi nhận sự khác biệt sẽ giúp bạn không thấy “sốc văn hóa”, đồng thời hiểu rằng mỗi công ty là một hệ sinh thái riêng, và bạn cần thời gian để hiểu sâu từ bên trong.\n✅ Ghi nhớ: Hòa nhập văn hóa không phải là thay đổi bản chất của bạn – mà là hiểu ngữ cảnh để hành xử phù hợp, không lệch pha với tập thể.\n• Luôn giữ tinh thần tích cực, cầu tiến và sẵn sàng thay đổi\nTrong bất kỳ môi trường công nghệ nào, tinh thần học hỏi và thái độ tích cực luôn được đánh giá cao hơn trình độ kỹ thuật đơn thuần – đặc biệt với sinh viên thực tập chưa có nhiều kinh nghiệm.\n• Tích cực không có nghĩa là “cố tỏ ra vui vẻ”:\no Mà là luôn chủ động trong hành vi: hỏi khi không biết, xin thêm task khi rảnh, nhờ feedback sau mỗi lần làm việc.\no Là không “đóng khung” bản thân với suy nghĩ: “Em chỉ là thực tập sinh, em không dám làm gì.”\n• Cầu tiến thể hiện qua từng hành động nhỏ:\no Tìm hiểu thêm ngoài giờ về công nghệ mà team đang dùng.\no Đọc lại phần code mình viết để tối ưu.\no Ghi chú những gì mình chưa hiểu rõ để hỏi vào buổi họp kế tiếp.\n• Sẵn sàng thay đổi – vì công nghệ luôn thay đổi:\no Hôm nay làm front-end, mai có thể được giao hỗ trợ backend.\no Hôm nay viết SQL thuần, tuần sau có thể dùng NoSQL.\no Đừng ngại thay đổi – hãy xem đó là cơ hội để mở rộng vùng kỹ năng.\n✅ Ghi nhớ: Một người tích cực, cầu tiến và linh hoạt sẽ luôn tìm được vị trí phù hợp trong thế giới công nghệ – kể cả khi bắt đầu từ vị trí thấp nhất như… thực tập sinh.\n🔚 Kết luận\nVăn hóa doanh nghiệp trong ngành CNTT không chỉ là những quy tắc ứng xử, mà còn là nền tảng giúp sinh viên thực tập hòa nhập nhanh, làm việc hiệu quả và phát triển bền vững trong môi trường chuyên nghiệp. Qua tài liệu này, sinh viên không chỉ hiểu được các đặc trưng văn hóa của doanh nghiệp công nghệ hiện đại – như tư duy Agile, giao tiếp mở, học tập liên tục – mà còn được trang bị những hành vi nên có, những lỗi cần tránh, và những thái độ cần nuôi dưỡng ngay từ ngày đầu bước vào doanh nghiệp. Hy vọng đây sẽ là người bạn đồng hành tin cậy, giúp bạn bắt đầu kỳ thực tập với sự tự tin, cầu thị và sẵn sàng để tỏa sáng.\n\n",
  "﻿Chuyển đổi số trong Doanh nghiệp Đắk Lắk: Hành trang cho Sinh viên CNTT đi Thực tập Nhận thức\n🎓 Giới thiệu tài liệu\nTrong thời đại mà công nghệ ngày càng len sâu vào mọi lĩnh vực của đời sống và sản xuất, chuyển đổi số không còn là lựa chọn – mà là điều bắt buộc nếu doanh nghiệp muốn tồn tại và phát triển bền vững. Từ các tập đoàn lớn, tổ chức nhà nước, cho đến các hợp tác xã nông nghiệp và công ty phần mềm quy mô nhỏ tại địa phương – tất cả đều đang trên hành trình chuyển mình nhờ công nghệ.\nVới sinh viên ngành Công nghệ Thông tin, việc hiểu rõ chuyển đổi số không chỉ giúp “theo kịp thời đại”, mà còn mở ra cơ hội để bạn trở thành người tạo ra giá trị thật sự trong doanh nghiệp – ngay từ những ngày đầu đi thực tập nhận thức.\nTài liệu này được thiết kế như một “bản đồ định hướng” dành riêng cho sinh viên CNTT năm 2 khi bắt đầu kỳ thực tập nhận thức tại các doanh nghiệp ở Đắk Lắk. Không chỉ giúp bạn hiểu chuyển đổi số là gì, mà còn chỉ ra cụ thể doanh nghiệp đang làm gì, bạn có thể học gì, đóng góp gì, và phát triển ra sao – từ việc tham gia vào dự án nhỏ đến xây dựng đề tài tốt nghiệp có ứng dụng thực tiễn.\nMở đầu tài liệu là phần lý giải vì sao sinh viên CNTT cần hiểu chuyển đổi số trước khi thực tập, tiếp theo là phần định nghĩa và các dạng chuyển đổi phổ biến, bao gồm chuyển đổi quy trình, mô hình kinh doanh, văn hóa tổ chức và trải nghiệm khách hàng, kèm theo 10 nguyên tắc thực thi thực tiễn. Sau đó, tài liệu đi sâu vào bối cảnh thực tế tại Đắk Lắk thông qua ba nhóm doanh nghiệp tiêu biểu: VNPT – Viettel trong lĩnh vực giáo dục và chính quyền số, Greed Farm với nông nghiệp thông minh, và các công ty phần mềm nhỏ hoạt động linh hoạt theo mô hình outsourcing. Tiếp theo là phần giới thiệu những công nghệ mà sinh viên cần làm quen – từ nền tảng lập trình, công cụ phát triển, đến các hệ thống quản trị và nền tảng cloud. Phần năm định hướng ứng dụng AI vào các đề tài tốt nghiệp gắn với bài toán thực tế doanh nghiệp, dữ liệu thật và khả năng phát triển thành sản phẩm thật. Phần sáu trình bày chiến lược 5 bước giúp sinh viên chủ động hơn trong thực tập, từ việc quan sát, phản tư đến kết nối với giảng viên. Cuối cùng là phụ lục gồm sách nên đọc, công nghệ nên thử, và các khóa học miễn phí về chuyển đổi số, AI dành cho sinh viên.\n🧭 I. Lời mở đầu: Vì sao chuyển đổi số là điều sinh viên cần hiểu trước khi thực tập\nChúng ta đang sống trong một thời kỳ mà công nghệ không chỉ là công cụ, mà còn là nền tảng tái cấu trúc toàn bộ hoạt động doanh nghiệp. Chuyển đổi số (Digital Transformation) không còn là một khái niệm xa vời hay chiến lược dành riêng cho các tập đoàn lớn, mà đã trở thành đòi hỏi sống còn ngay cả với các doanh nghiệp vừa, nhỏ, đặc biệt là trong các tỉnh thành đang phát triển như Đắk Lắk.\n📌 Chuyển đổi số – Từ khái niệm đến thực tiễn địa phương\nTừ việc quản lý chuỗi cung ứng trong ngành nông nghiệp (Greed Farm), triển khai hệ thống học liệu và số hóa trường học (VNPT, Viettel), đến phát triển phần mềm và giải pháp cho khách hàng nội địa và nước ngoài (các công ty outsource nhỏ), các doanh nghiệp tại Đắk Lắk đang bước vào giai đoạn \"tái sinh\" kỹ thuật số — đúng như cách Jaspreet Bindra gọi họ là “The Twice Borns”: những doanh nghiệp phải tái sinh để tồn tại và phát triển trong một thế giới số.\n👨‍💻 Vai trò của sinh viên CNTT trong hệ sinh thái số hóa\nTrong quá trình đó, sinh viên ngành CNTT không còn là người học lý thuyết, mà đang dần trở thành:\n• Người quan sát thực tiễn số hóa trong các doanh nghiệp\n• Người tham gia hỗ trợ công nghệ\n• Và quan trọng nhất, người kiến tạo các giải pháp công nghệ mới phù hợp với bối cảnh địa phương\nThực tế cho thấy nhiều doanh nghiệp tại Đắk Lắk thiếu nhân sự am hiểu công nghệ hiện đại như Cloud, AI, Web/App – điều mà sinh viên có thể tiếp cận sớm hơn thông qua học tập và tự rèn luyện.\n🎯 Thực tập nhận thức – Bước khởi đầu để tạo nên giá trị\nThực tập nhận thức không chỉ là một hoạt động bắt buộc trong chương trình đào tạo, mà là cơ hội chiến lược để sinh viên:\n• Tiếp cận bối cảnh doanh nghiệp đang số hóa từng bước\n• Quan sát quy trình vận hành thực tế dưới góc nhìn công nghệ\n• Gợi mở đề tài tiềm năng cho khóa luận tốt nghiệp hoặc dự án cá nhân\n• Tìm hiểu cách doanh nghiệp ứng dụng công nghệ vào các khâu như: quản lý khách hàng, sản xuất, phân phối, chăm sóc khách hàng, và tự động hóa nội bộ\nKhi hiểu rõ chuyển đổi số đang diễn ra như thế nào, sinh viên có thể chủ động đề xuất ý tưởng, không chỉ đơn thuần làm theo yêu cầu. Đây chính là bước đầu để chuyển mình từ “người học” thành “người góp phần đổi mới”.\n\n📌 Tóm lại, chuyển đổi số không phải là kiến thức lý thuyết trên giấy, mà là hành trình thực tiễn sống động mà mỗi sinh viên CNTT cần nắm vững trước khi bước vào kỳ thực tập – để không chỉ quan sát, mà còn tham gia, phân tích, đề xuất, và có thể là người dẫn dắt thay đổi trong tương lai.\n🌍 II. Chuyển đổi số: Định nghĩa, nền tảng, và xu thế\n1. 📘 Khái niệm & Phân biệt các thuật ngữ thường nhầm lẫn\nTrong thực tế và cả trong môi trường học thuật, ba khái niệm sau thường bị dùng lẫn lộn, nhưng thực chất mỗi thuật ngữ mang ý nghĩa và cấp độ khác nhau:\n🔹 Digitization – Số hóa dữ liệu\n• Là quá trình chuyển đổi thông tin từ dạng vật lý sang dạng kỹ thuật số.\n• Ví dụ: quét tài liệu giấy thành file PDF, ghi dữ liệu từ sổ sách lên Excel.\n• Đây là mức độ thấp nhất, nền tảng ban đầu cho các bước tiếp theo.\n🔹 Digitalization – Số hóa quy trình\n• Là việc ứng dụng công nghệ số vào quy trình kinh doanh hiện tại để tối ưu hiệu quả.\n• Ví dụ: dùng phần mềm quản lý kho thay cho ghi chép tay, hoặc hệ thống ERP để theo dõi sản xuất.\n• Digitalization giúp tăng tốc, giảm lỗi, tiết kiệm thời gian và chi phí.\n🔹 Digital Transformation – Chuyển đổi số toàn diện\n• Là quá trình thay đổi chiến lược, văn hóa và mô hình vận hành của doanh nghiệp dựa trên công nghệ số.\n• Không chỉ thay đổi công cụ, mà còn đặt lại cách doanh nghiệp hoạt động, phục vụ khách hàng và đổi mới sản phẩm/dịch vụ.\n• Đây là mức độ cao nhất trong hành trình tiến hóa số.\n\n2. 🧠 Định nghĩa chuyển đổi số (Digital Transformation)\nTheo George Westerman (Viện Công nghệ Massachusetts - MIT):\n\"Digital transformation is the use of digital technology to radically improve performance or reach of enterprises.\"\n“Chuyển đổi số là việc sử dụng công nghệ số để cải thiện triệt để hiệu suất hoặc tầm ảnh hưởng của doanh nghiệp.”\nKhác với số hóa thông thường, chuyển đổi số không chỉ là “áp dụng công nghệ mới”, mà là hành trình đổi mới toàn diện về con người, quy trình và mô hình kinh doanh. Chuyển đổi số là “chiếc chìa khóa” để doanh nghiệp vừa và nhỏ — đặc biệt ở các địa phương như Đắk Lắk — thoát khỏi mô hình truyền thống lạc hậu và cạnh tranh được với thị trường hiện đại.\nĐể giúp sinh viên dễ hình dung sự khác biệt giữa các cấp độ số hóa, chúng ta có thể nhìn vào một vài ví dụ thực tế. Khi doanh nghiệp chỉ đơn thuần chuyển đổi thông tin từ giấy sang định dạng điện tử, như việc lưu trữ hóa đơn giấy thành file PDF, đó là digitization – số hóa dữ liệu. Khi họ bắt đầu ứng dụng phần mềm để thay thế các quy trình thủ công, chẳng hạn như dùng phần mềm quản lý kho thay cho việc ghi chép bằng sổ tay, thì đó là digitalization – số hóa quy trình. Còn khi doanh nghiệp tiến thêm một bước dài, tái cấu trúc toàn bộ cách thức vận hành, ví dụ như xây dựng hệ thống theo dõi nông sản bằng cảm biến IoT, kết hợp AI để phân tích sản lượng và giám sát qua dashboard thời gian thực, thì đó chính là digital transformation – chuyển đổi số thực sự.\nViệc hiểu rõ ba cấp độ này rất quan trọng với sinh viên khi đi thực tập, vì nó giúp xác định chính xác doanh nghiệp đang ở giai đoạn nào trên hành trình số hóa. Từ đó, sinh viên sẽ đề xuất được những giải pháp phù hợp với thực trạng, tránh tình trạng “vẽ ra giải pháp quá phức tạp cho một hệ thống chưa sẵn sàng”. Đồng thời, sinh viên cũng sẽ hiểu rằng việc doanh nghiệp có phần mềm không có nghĩa là họ đã chuyển đổi số, và điều đó thúc đẩy sự chủ động trong quá trình học hỏi, đề xuất ý tưởng, cũng như lựa chọn đề tài tốt nghiệp có tính ứng dụng thực tiễn cao hơn.\n🔄 2. Các dạng chuyển đổi trong doanh nghiệp\nChuyển đổi số không chỉ dừng lại ở việc cài phần mềm hay xây dựng website, mà là một hành trình thay đổi toàn diện, có thể chia thành bốn dạng chính dưới đây. Mỗi dạng mang lại một góc độ thay đổi cụ thể và đều có liên quan mật thiết đến công nghệ thông tin.\n🔧 a. Chuyển đổi quy trình (Process Transformation)\nĐây là bước đầu tiên và phổ biến nhất. Các doanh nghiệp số hóa và sau đó cải tiến quy trình vận hành nội bộ bằng công nghệ để:\n• Giảm chi phí\n• Tăng tốc độ xử lý\n• Tăng tính minh bạch và khả năng theo dõi\n✅ Ví dụ:\n• Tại Viettel hoặc VNPT Đắk Lắk: Thay vì quản lý học sinh bằng sổ, các trường được cung cấp hệ thống phần mềm quản lý học sinh (hồ sơ, điểm, hạnh kiểm).\n• Tại công ty phần mềm nhỏ: Quản lý tiến độ dự án bằng Jira hoặc Trello thay cho Excel, email rời rạc.\n🎯 Cơ hội cho sinh viên:\n• Tham gia viết hoặc tùy chỉnh phần mềm quản lý nội bộ\n• Phân tích quy trình và đề xuất tự động hóa bằng script, công cụ đơn giản\n🧱 b. Chuyển đổi mô hình kinh doanh (Business Model Transformation)\nỞ cấp độ cao hơn, doanh nghiệp sử dụng công nghệ để tạo ra nguồn doanh thu mới hoặc thay đổi cách họ phục vụ khách hàng.\n✅ Ví dụ:\n• Greed Farm ở Đắk Lắk: Chuyển từ mô hình bán nông sản tại chỗ → sang đặt hàng trực tuyến, theo dõi cây trồng qua IoT, và phân phối toàn quốc.\n• Một công ty phần mềm outsource nhỏ: Thay vì chỉ viết phần mềm theo yêu cầu, họ xây dựng nền tảng SaaS (Software as a Service) để bán cho nhiều khách hàng.\n🎯 Cơ hội cho sinh viên:\n• Được giao nghiên cứu mô hình hệ thống mới\n• Tham gia lập trình backend/frontend cho nền tảng dịch vụ số (platform)\n👥 c. Chuyển đổi tổ chức – văn hóa (Organizational/Cultural Transformation)\nDạng chuyển đổi này thường ít “thấy bằng mắt” nhưng lại cực kỳ quan trọng. Đó là việc thay đổi tư duy lãnh đạo và cách nhân viên tương tác, cộng tác, học hỏi trong môi trường số hóa.\n✅ Ví dụ:\n• Tại công ty outsource: Chuyển từ mô hình làm việc tự do → sang mô hình Scrum/Agile, tổ chức sprint review, daily meeting online.\n• Doanh nghiệp truyền thống: Nhân viên phải học cách dùng phần mềm mới, chấp nhận thay đổi quy trình, tiếp cận dữ liệu thay vì “thói quen cũ”.\n🎯 Cơ hội cho sinh viên:\n• Quan sát môi trường làm việc hiện đại\n• Hiểu và học cách cộng tác qua công cụ số (Slack, Teams, GitHub)\n• Đóng góp vào việc hướng dẫn hoặc tạo tài liệu nội bộ (wiki, tutorial video)\n🌐 d. Chuyển đổi trải nghiệm khách hàng (Customer Experience Transformation)\nCông nghệ được sử dụng để cải thiện toàn bộ hành trình khách hàng, từ tiếp cận → tương tác → mua hàng → hậu mãi.\n✅ Ví dụ:\n• Greed Farm: Dùng website để khách đặt hàng online, theo dõi đơn hàng, nhận tin khuyến mãi, phản hồi qua chatbot.\n• VNPT/Viettel: Phát triển app quản lý học sinh dành cho phụ huynh, giúp theo dõi điểm số – hạnh kiểm – thông báo trường lớp.\n🎯 Cơ hội cho sinh viên:\n• Làm UI/UX design cho sản phẩm\n• Phát triển tính năng hỗ trợ khách hàng (chatbot, app mobile)\n• Tích hợp hệ thống phản hồi người dùng (feedback system, đánh giá sao)\n📌 Tổng kết lại, chuyển đổi số trong doanh nghiệp có thể được chia thành bốn dạng chính, mỗi dạng đều mang theo một mục tiêu cụ thể, một ví dụ rõ ràng tại Đắk Lắk, và mở ra những cơ hội thực hành rất thiết thực cho sinh viên CNTT.\nĐầu tiên là chuyển đổi quy trình, với mục tiêu tăng hiệu quả vận hành nội bộ. Một ví dụ điển hình là việc các trường học sử dụng hệ thống quản lý học sinh thay cho sổ sách truyền thống. Trong môi trường này, sinh viên có thể tham gia viết hoặc tùy chỉnh phần mềm, góp phần cải thiện tốc độ và độ chính xác trong quản lý giáo dục.\nTiếp theo là chuyển đổi mô hình kinh doanh, nhằm thay đổi cách doanh nghiệp tạo ra doanh thu. Chẳng hạn, một số hợp tác xã nông sản tại Đắk Lắk đã chuyển từ hình thức bán hàng truyền thống sang mô hình đặt hàng trực tuyến, giúp tiếp cận thị trường rộng hơn. Đây là cơ hội cho sinh viên thử sức với việc xây dựng nền tảng thương mại điện tử hoặc dịch vụ SaaS đơn giản, phục vụ cho thị trường địa phương.\nVề mặt văn hóa tổ chức, chuyển đổi số thúc đẩy sự thay đổi trong cách làm việc, từ lối quản lý thủ công sang mô hình số hóa – điển hình là việc áp dụng Agile và tổ chức làm việc nhóm linh hoạt trong các công ty phần mềm nhỏ. Với môi trường này, sinh viên không chỉ học kỹ thuật, mà còn trải nghiệm thực tế cách quản lý công việc qua Scrum, sử dụng GitHub để cộng tác, và rèn luyện kỹ năng teamwork hiện đại.\nCuối cùng, chuyển đổi trải nghiệm khách hàng tập trung vào nâng cao dịch vụ, cải thiện giao tiếp và tương tác với người dùng. Tại Đắk Lắk, có thể thấy qua các ứng dụng dành cho phụ huynh học sinh, hoặc chatbot hỗ trợ tư vấn khách hàng trong nông nghiệp, giáo dục và bán lẻ. Đây là môi trường lý tưởng để sinh viên thực hành thiết kế giao diện (UI/UX), xây dựng chatbot hoặc phát triển ứng dụng mobile đơn giản nhưng có tính ứng dụng cao.\nNhìn chung, mỗi dạng chuyển đổi số đều không chỉ là một khái niệm lý thuyết, mà là một “cánh cửa mở” để sinh viên CNTT bước vào thực tế, đóng góp bằng kỹ năng của mình, và tạo ra giá trị thật trong môi trường doanh nghiệp số.\n\n🧩 3. Mười nguyên tắc sống còn khi thực hiện chuyển đổi số\n(Trích lược và diễn giải từ “The Tech Whisperer”)\nChuyển đổi số không phải là một dự án ngắn hạn hay một bản cài đặt phần mềm đắt tiền. Nó là một hành trình dài và đòi hỏi sự thay đổi sâu sắc từ tư duy đến cách tổ chức vận hành. Dưới đây là mười nguyên tắc cốt lõi – cũng là những “luật chơi sống còn” mà mọi doanh nghiệp và cả những người tham gia như sinh viên thực tập cần hiểu để không bị lạc lối giữa cơn sóng công nghệ đang cuộn trào.\nThứ nhất, chuyển đổi số bắt đầu bằng việc tư duy lại toàn bộ hệ thống, chứ không chỉ đơn thuần là nâng cấp công nghệ cũ. Doanh nghiệp không thể chỉ đổi một phần mềm kế toán và nghĩ rằng mình đã “số hóa”. Thay vào đó, cần xem xét lại toàn bộ chuỗi giá trị – từ cách sản phẩm được tạo ra, phân phối, đến cách khách hàng trải nghiệm. Đây là thời điểm để đặt lại câu hỏi: nếu hôm nay chúng ta khởi nghiệp lại từ đầu, chúng ta sẽ làm gì khác?\nThứ hai, hãy luôn ưu tiên “khách hàng số”. Chuyển đổi số thành công khi nó tạo ra giá trị mới cho người dùng – từ tốc độ, sự tiện lợi, đến tính cá nhân hóa. Mọi cải tiến đều nên được đo lường bằng dữ liệu thực tế về hành vi và phản hồi của khách hàng. Không còn chỗ cho phán đoán chủ quan.\nThứ ba, công nghệ dù quan trọng, nhưng văn hóa tổ chức mới là yếu tố quyết định. Nếu nhân viên không sẵn sàng học cái mới, chấp nhận sai và cải tiến liên tục, thì công nghệ tốt đến đâu cũng chỉ là lớp vỏ hào nhoáng. Văn hóa số là văn hóa của thử nghiệm, minh bạch và phản hồi nhanh.\nThứ tư, đừng lẫn lộn giữa “có công nghệ” với “đang chuyển đổi số”. Một doanh nghiệp có website nhưng quy trình vẫn xử lý tay, dữ liệu nằm rải rác và không kết nối – thì vẫn là một doanh nghiệp truyền thống với lớp vỏ kỹ thuật số.\nThứ năm, hãy xây dựng một hệ sinh thái, thay vì chỉ tập trung vào nội bộ. Doanh nghiệp thời số không hoạt động đơn lẻ mà cần kết nối với khách hàng, đối tác, nhà cung cấp, thậm chí cả đối thủ để tạo ra chuỗi giá trị số toàn diện. Với sinh viên, đây là cơ hội học cách làm việc trong các hệ thống mở, liên kết chéo nhiều bên.\nThứ sáu, đừng mù quáng theo xu hướng. Không phải doanh nghiệp nào cũng cần AI, blockchain hay metaverse. Hãy chọn công nghệ phù hợp với bài toán cụ thể. Chuyển đổi số không phải là “show công nghệ” mà là giải pháp thực tế để tối ưu giá trị.\nThứ bảy, dữ liệu là nhiên liệu của chuyển đổi số. Mọi quyết định, cải tiến và cá nhân hóa đều cần được dẫn dắt bởi dữ liệu. Doanh nghiệp cần học cách thu thập, xử lý, bảo mật và khai thác dữ liệu có trách nhiệm.\nThứ tám, tốc độ là yếu tố sống còn. Chuyển đổi số không phải là cuộc đua “làm hoàn hảo” mà là chạy nhanh, thử sớm và điều chỉnh liên tục. Sinh viên tham gia thực tập cần hiểu rằng sản phẩm ban đầu chưa cần hoàn chỉnh – miễn là có thể test nhanh và học được điều gì đó.\nThứ chín, chuyển đổi số là hành trình dài hạn – không có điểm kết thúc rõ ràng. Doanh nghiệp luôn phải thích nghi với công nghệ mới, nhu cầu mới, thị trường mới. Đây là quá trình tiến hóa, không phải cuộc đại tu một lần rồi xong.\nVà cuối cùng, thứ mười, con người là trung tâm. Công nghệ chỉ có ý nghĩa khi giúp con người làm việc tốt hơn, sống thông minh hơn. Chuyển đổi số thành công khi nó làm cho con người – từ nhân viên đến khách hàng – cảm thấy giá trị hơn, được hỗ trợ tốt hơn và phát triển hơn.\n💡 Tóm lại, nắm vững mười nguyên tắc này sẽ giúp sinh viên không chỉ hiểu chuyển đổi số là gì, mà còn biết cách đánh giá thực trạng doanh nghiệp nơi mình thực tập. Từ đó, sinh viên có thể chủ động tìm vai trò của bản thân trong hành trình số hóa của doanh nghiệp – không phải là người ngoài cuộc, mà là người góp sức thay đổi.\n🏢 III. Bối cảnh thực tiễn tại Đắk Lắk: Các mô hình chuyển đổi số doanh nghiệp tiêu biểu\n1. VNPT, Viettel Đắk Lắk – Động lực số hóa cho giáo dục và quản trị địa phương\nTrong bức tranh chuyển đổi số tại Đắk Lắk, VNPT và Viettel nổi bật như hai lực đẩy công nghệ mạnh mẽ, không chỉ cung cấp hạ tầng viễn thông mà còn đóng vai trò then chốt trong việc xây dựng hệ thống chính quyền điện tử và giáo dục thông minh. Đây là những doanh nghiệp công nghệ có mặt sớm tại tỉnh và đang từng bước kéo các lĩnh vực truyền thống bước vào kỷ nguyên số.\nThứ nhất, một trong những lĩnh vực mà VNPT và Viettel đầu tư mạnh mẽ là hệ thống học liệu số và quản lý giáo dục thông minh. Nhiều trường học trong tỉnh hiện nay đã không còn phụ thuộc hoàn toàn vào sổ điểm giấy hay quản lý thủ công. Thay vào đó, các phần mềm quản lý học sinh như VnEdu (VNPT) hay SMAS (Viettel) đã được triển khai giúp giáo viên nhập điểm, theo dõi hạnh kiểm, in học bạ, thậm chí gửi thông báo trực tiếp đến phụ huynh qua ứng dụng di động. Học sinh có thể học trực tuyến, làm bài tập, tra cứu kết quả học tập, và phụ huynh có thể đồng hành sát sao hơn với nhà trường. Đây là ví dụ điển hình cho quá trình digitalization – số hóa quy trình – đang diễn ra ngay trong giáo dục phổ thông.\nThứ hai, cả hai doanh nghiệp này đều tích cực phát triển sản phẩm công nghệ để giới thiệu tới trường học và cộng đồng giáo dục địa phương. Họ tổ chức các buổi demo sản phẩm, các mô hình lớp học thông minh với bảng tương tác, camera AI, hệ thống kiểm soát vào lớp, nhận diện khuôn mặt, điểm danh tự động. Những hoạt động này không chỉ nhằm mục đích thương mại mà còn thể hiện định hướng lâu dài: đưa công nghệ sâu vào môi trường giáo dục – nơi hình thành thói quen số từ sớm cho thế hệ trẻ. Sinh viên CNTT có thể tham gia vào các hoạt động triển khai, hỗ trợ kỹ thuật, đào tạo người dùng hoặc thậm chí tham gia phát triển tính năng mới dựa trên phản hồi từ thực tế.\nThứ ba, ở cấp độ tỉnh, VNPT và Viettel cũng là đối tác chiến lược trong việc xây dựng nền tảng quản lý số hóa cho chính quyền điện tử. Họ hỗ trợ UBND tỉnh và các cơ quan hành chính triển khai cổng dịch vụ công trực tuyến, số hóa thủ tục hành chính, xây dựng hệ thống quản lý công văn, tài liệu điện tử, và tích hợp chữ ký số. Điều này giúp giảm thiểu giấy tờ, tăng tính minh bạch và nâng cao hiệu quả quản lý nhà nước. Đặc biệt, VNPT có các hệ thống như VNPT-iOffice, VNPT-PAK, còn Viettel triển khai VOffice, Cổng tương tác người dân, và các dashboard phân tích dữ liệu phục vụ điều hành.\n🎯 Cơ hội dành cho sinh viên thực tập\nĐối với sinh viên CNTT đi thực tập nhận thức tại các chi nhánh hoặc dự án phối hợp cùng VNPT, Viettel tại Đắk Lắk, đây là môi trường lý tưởng để quan sát quy mô triển khai lớn, tiếp xúc với các công nghệ thực tế như:\n• Phát triển ứng dụng web/mobile phục vụ giáo dục\n• Tìm hiểu về tích hợp hệ thống (integration) giữa các phần mềm hành chính\n• Học cách vận hành hệ thống backend phục vụ hàng ngàn người dùng\n• Trải nghiệm xử lý dữ liệu giáo dục, xây dựng dashboard phân tích\nKhông chỉ là cơ hội tiếp cận công nghệ, đây còn là dịp để sinh viên quan sát cách doanh nghiệp lớn tổ chức triển khai chuyển đổi số ở quy mô cấp tỉnh, từ khâu khảo sát, xây dựng giải pháp, đến hỗ trợ vận hành. Với sự chủ động quan sát và tìm hiểu, sinh viên có thể hình thành những đề tài tốt nghiệp có tính thực tiễn cao như: tối ưu hóa giao diện người dùng cho phần mềm học đường, xây dựng chatbot giải đáp thông tin cho phụ huynh, hay hệ thống đánh giá học tập dựa trên AI.\n📌 Tóm lại, VNPT và Viettel không chỉ là nhà mạng, mà là người mở đường cho chuyển đổi số tại Đắk Lắk. Sinh viên CNTT có thể xem đây là những “phòng thí nghiệm sống” để học hỏi cách công nghệ vận hành trong giáo dục và chính quyền, chuẩn bị tốt hơn cho hành trình nghề nghiệp sau này.\n🌱 2. Greed Farm và nông nghiệp thông minh\nTại Đắk Lắk – thủ phủ cà phê và nông sản đặc trưng của Tây Nguyên – việc chuyển đổi số trong nông nghiệp không còn là ý tưởng xa vời. Một trong những mô hình tiêu biểu là Greed Farm, một doanh nghiệp đã tiên phong ứng dụng công nghệ cao trong sản xuất, giám sát và phân phối nông sản. Đây không chỉ là bước tiến về kỹ thuật canh tác, mà còn là một mô hình chuyển đổi số toàn diện, với sự kết hợp của IoT, blockchain và nền tảng dữ liệu thời gian thực.\nThứ nhất, Greed Farm đã triển khai hệ thống IoT để giám sát tưới tiêu và theo dõi cây trồng theo thời gian thực. Những cảm biến nhỏ đặt trong vườn cà phê hoặc rau củ giúp đo độ ẩm đất, ánh sáng, nhiệt độ và cảnh báo các chỉ số vượt ngưỡng. Dữ liệu từ các thiết bị này được gửi về hệ thống trung tâm qua mạng không dây và được hiển thị trên dashboard số hóa, cho phép người quản lý theo dõi từ xa qua điện thoại hoặc máy tính bảng. Thay vì “đi rẫy bằng cảm giác”, giờ đây việc tưới tiêu và chăm sóc được lập trình, chính xác và tiết kiệm tài nguyên hơn.\nThứ hai, Greed Farm ứng dụng Blockchain trong truy xuất nguồn gốc nông sản – một bước đi tiên tiến mà ít doanh nghiệp nhỏ tại địa phương làm được. Mỗi lô sản phẩm đều được gắn mã QR hoặc RFID, cho phép người tiêu dùng quét để biết thông tin từ thời điểm gieo trồng, chăm sóc, thu hoạch, đóng gói đến vận chuyển. Blockchain đảm bảo rằng dữ liệu không bị sửa đổi, tạo lòng tin với người tiêu dùng và mở rộng cơ hội xuất khẩu. Với sinh viên CNTT, đây là ví dụ thực tế về việc tích hợp dữ liệu chuỗi cung ứng với công nghệ bảo mật hiện đại.\nThứ ba, toàn bộ hệ thống vận hành được theo dõi và điều khiển qua dashboard giám sát thông minh, được thiết kế trực quan, dễ dùng và kết nối với các thiết bị IoT. Dashboard không chỉ hiển thị dữ liệu cảm biến mà còn cảnh báo bất thường, đề xuất lịch tưới tiêu, phân bón, thậm chí phân tích xu hướng sâu bệnh theo mùa. Hệ thống này thường sử dụng nền tảng web viết bằng React, backend API xử lý bằng NodeJS hoặc Python, lưu trữ dữ liệu qua Firebase hoặc cơ sở dữ liệu thời gian thực như InfluxDB.\n🎯 Cơ hội dành cho sinh viên thực tập\nVới sinh viên CNTT thực tập nhận thức tại các doanh nghiệp như Greed Farm, đây là cơ hội hiếm có để tiếp xúc với hệ thống công nghệ tích hợp thực tế, không chỉ trên lý thuyết:\n• Quan sát trực tiếp mô hình IoT hoạt động ngoài thực địa\n• Học cách đọc dữ liệu từ cảm biến, xử lý và biểu diễn qua dashboard\n• Tìm hiểu tích hợp Blockchain với ứng dụng web di động\n• Hỗ trợ phát triển app mobile, website cho người dùng nông dân, đại lý hoặc người tiêu dùng\n• Gợi mở đề tài tốt nghiệp như: “Xây dựng hệ thống cảnh báo sớm sâu bệnh dựa trên dữ liệu thời tiết và cảm biến vườn cây”, hoặc “Phát triển giải pháp truy xuất nguồn gốc dựa trên QR code kết hợp Blockchain dành cho HTX nông nghiệp”\nKhông những thế, sinh viên còn có thể hỗ trợ truyền thông nội bộ, tư vấn kỹ thuật cho đội ngũ sản xuất – những người không có chuyên môn về CNTT – nhờ đó rèn luyện khả năng giao tiếp kỹ thuật, vốn là một kỹ năng quan trọng khi bước vào thị trường lao động thực tế.\n📌 Tóm lại, Greed Farm là một ví dụ sống động về nông nghiệp công nghệ cao tại Đắk Lắk, nơi công nghệ không chỉ góp phần tăng năng suất mà còn tạo ra mô hình sản xuất thông minh và minh bạch, mở đường cho sinh viên CNTT bước chân vào lĩnh vực AgriTech – một hướng đi đầy triển vọng trong kỷ nguyên chuyển đổi số.\n💻 3. Các công ty phần mềm nhỏ (Code outsourcing)\nBên cạnh những “ông lớn” như VNPT hay Viettel, thì các công ty phần mềm quy mô nhỏ tại Đắk Lắk cũng đang đóng vai trò quan trọng trong hệ sinh thái công nghệ của tỉnh. Những doanh nghiệp này thường hoạt động theo mô hình gia công phần mềm (outsourcing) hoặc cung cấp giải pháp số hóa tùy chỉnh cho khách hàng vừa và nhỏ (SMEs) trong và ngoài tỉnh.\nDù quy mô khiêm tốn – có nơi chỉ vài đến vài chục người – nhưng đây lại là mảnh đất thực hành lý tưởng cho sinh viên CNTT thực tập nhận thức, bởi bạn sẽ có nhiều cơ hội được “chạm tay vào việc thật”, trải nghiệm quy trình làm phần mềm bài bản, và học hỏi gần gũi từ các anh chị kỹ sư có kinh nghiệm thực tế.\nThứ nhất, các công ty phần mềm nhỏ thường làm việc theo mô hình Agile hoặc Scrum, nghĩa là họ chia dự án thành các vòng phát triển ngắn (sprint), tổ chức họp daily để cập nhật tiến độ, và linh hoạt thay đổi yêu cầu theo phản hồi của khách hàng. Mỗi nhóm thường có leader, developer backend – frontend, tester và có thể có UI/UX designer. Việc này giúp sinh viên hiểu được quy trình phát triển phần mềm thực tế, không giống lý thuyết một chiều như trong trường học.\nThứ hai, sản phẩm mà họ phát triển chủ yếu là website, hệ thống quản lý nội bộ, ứng dụng mobile hoặc web app dành cho doanh nghiệp nhỏ, như: phần mềm bán hàng, quản lý kho, quản lý nhân sự, đặt lịch, theo dõi tiến độ công việc, hay hệ thống CRM. Họ có thể nhận dự án từ khách hàng ở TP.HCM, Hà Nội, hoặc nước ngoài qua các nền tảng như Upwork, Freelancer. Dù không phải những dự án quy mô lớn, nhưng đây là những bài toán rất thực tế, có yêu cầu rõ ràng và áp lực thời gian cụ thể.\nThứ ba, điều đặc biệt quan trọng là sinh viên có cơ hội được tham gia vào nhiều khâu của quá trình phát triển, thay vì chỉ quan sát. Nếu bạn chủ động, bạn có thể được giao xử lý một module nhỏ: lập trình frontend bằng React, viết API backend bằng NodeJS hoặc Laravel, thiết kế database, hoặc thực hiện kiểm thử. Ngoài ra, nhiều nhóm làm việc với DevOps như Docker, GitHub Actions, CI/CD để triển khai phần mềm nhanh và an toàn.\nĐặc biệt, một số công ty bắt đầu thử nghiệm tích hợp trí tuệ nhân tạo (AI) vào sản phẩm, như:\n• Gợi ý sản phẩm thông minh trong hệ thống bán hàng\n• Chatbot tư vấn khách hàng tự động\n• Phân tích hành vi người dùng từ dữ liệu truy cập\n• Nhận diện hình ảnh sản phẩm hoặc tài liệu qua AI\nĐây là những ứng dụng AI dễ triển khai và có giá trị thực tiễn cao, rất phù hợp để sinh viên tiếp cận, thử sức và làm thành đề tài khóa luận sau này.\n🎯 Cơ hội dành cho sinh viên thực tập\nKhi thực tập tại công ty phần mềm nhỏ, sinh viên không chỉ “học kỹ thuật”, mà còn có thể học được những kỹ năng mềm quan trọng như:\n• Làm việc nhóm theo quy trình chuyên nghiệp\n• Quản lý thời gian và tiến độ công việc\n• Giao tiếp kỹ thuật với khách hàng\n• Tự học và tự triển khai ý tưởng mới\nNgoài ra, bạn cũng có thể gợi ý với công ty về những ý tưởng chuyển đổi số mà bạn đã thấy ở nơi khác – ví dụ như chatbot, AI phân loại hình ảnh, tích hợp hệ thống kế toán... Từ đó, biến ý tưởng thành đề tài thực tập có thật, có người dùng, và có thể phát triển thành sản phẩm sau này.\n📌 Tóm lại, các công ty phần mềm nhỏ tại Đắk Lắk tuy không ồn ào nhưng lại là nơi giúp sinh viên “chạm tay vào thực tế”, hiểu sâu về quy trình phát triển phần mềm, và có cơ hội tạo ra sản phẩm có ích cho cộng đồng doanh nghiệp địa phương. Đây chính là nơi để bạn học nghề một cách thực tế, chủ động và có định hướng nghề nghiệp rõ ràng hơn trong lĩnh vực công nghệ thông tin.\n🧠 IV. Những công nghệ sinh viên cần làm quen khi đi thực tập\n1. Nền tảng phổ biến: Kiến thức cốt lõi, công cụ cần thiết\nTrong môi trường thực tập thực tế – dù ở doanh nghiệp lớn như Viettel, VNPT hay ở các công ty phần mềm nhỏ tại Đắk Lắk – sinh viên CNTT sẽ sớm nhận ra rằng kiến thức học trên lớp là chưa đủ. Điều quan trọng là khả năng sử dụng thành thạo các công cụ, ngôn ngữ và nền tảng đang được dùng phổ biến trong ngành. Dưới đây là những công nghệ mà sinh viên nên chủ động tìm hiểu và luyện tập trước khi bước vào kỳ thực tập:\n🧰 Git – Quản lý mã nguồn\nGit là công cụ giúp bạn quản lý phiên bản của mã nguồn, theo dõi sự thay đổi trong quá trình lập trình, làm việc nhóm hiệu quả và tránh mất dữ liệu. Tất cả các công ty phần mềm hiện đại – kể cả nhóm chỉ có 2–3 người – đều dùng Git.\n• GitHub là nền tảng chia sẻ mã nguồn phổ biến nhất, nơi bạn có thể đẩy mã, tạo pull request, báo bug và review code.\n• Sinh viên nên biết cách: tạo repo, commit, push, pull, merge, tạo branch.\n👉 Ví dụ thực tế: Một nhóm làm app bán hàng có thể chia thành các nhánh (branch) cho backend, frontend, và UI design. Mỗi người làm xong sẽ đẩy lên GitHub để người khác tích hợp.\n📋 Jira – Quản lý công việc theo Agile\nJira là công cụ giúp nhóm phát triển phần mềm theo mô hình Scrum hoặc Kanban. Nó dùng để tạo các “nhiệm vụ” nhỏ (task), sắp xếp theo sprint, theo dõi tiến độ và phối hợp giữa các thành viên.\n• Bạn không cần phải “quá giỏi Jira”, nhưng nên hiểu cách tạo task, comment, cập nhật trạng thái (To Do → In Progress → Done).\n• Ngoài Jira, một số công ty dùng Trello hoặc Notion cho mục đích tương tự.\n💻 VS Code – Môi trường lập trình phổ biến\nVisual Studio Code (VS Code) là trình soạn thảo mã nhẹ, mạnh mẽ và miễn phí, được gần như mọi công ty phần mềm sử dụng cho frontend, backend, và cả DevOps. Nó hỗ trợ hàng trăm plugin, dễ dùng cho cả người mới bắt đầu.\n👉 Gợi ý cho sinh viên:\n• Làm quen với các extension như: Prettier, GitLens, ESLint, Live Server.\n• Biết cách debug đơn giản và chạy code local.\n🌐 HTML – CSS – JavaScript – Kiến thức nền tảng của Web\nDù bạn theo frontend, backend hay mobile, thì kiến thức cơ bản về HTML (cấu trúc trang), CSS (giao diện) và JavaScript (tương tác) vẫn là nền móng quan trọng.\n• HTML5 & CSS3: Biết tạo bố cục, định dạng, responsive design.\n• JavaScript: Hiểu biến, hàm, xử lý sự kiện, vòng lặp, mảng, JSON, fetch API.\n• Đây là \"ABC\" của lập trình web – học tốt phần này sẽ giúp bạn dễ học React, Vue, hay các framework phức tạp hơn.\n⚛️ React – Thư viện frontend mạnh mẽ\nReact là công cụ xây dựng giao diện người dùng (UI) rất phổ biến. Rất nhiều dự án thực tập (nhất là tại các công ty outsource nhỏ) dùng React để phát triển:\n• Website bán hàng\n• Dashboard quản trị\n• Ứng dụng học trực tuyến\n👉 Sinh viên nên biết: JSX, component, props, state, useEffect, gọi API, routing.\n🌐 NodeJS – Lập trình backend hiện đại\nNodeJS giúp bạn viết server backend bằng JavaScript – rất phù hợp cho sinh viên vì dễ học nếu đã biết JS. Nó được dùng để:\n• Xử lý dữ liệu người dùng\n• Kết nối database\n• Tạo API\nBạn có thể dùng framework ExpressJS để viết các ứng dụng backend đơn giản.\n🔥 Firebase – Nền tảng cloud miễn phí cho MVP\nFirebase của Google cung cấp mọi thứ bạn cần để làm một sản phẩm nhỏ nhưng hoàn chỉnh:\n• Authentication (đăng nhập)\n• Database (Firestore, Realtime DB)\n• Hosting\n• Cloud Functions\nRất phù hợp cho sinh viên xây app demo, dự án tốt nghiệp, hoặc sản phẩm thực tế cho startup nhỏ.\n🧱 Laravel (PHP) – Framework quen thuộc của nhiều công ty\nLaravel là framework PHP hiện đại, dễ tiếp cận, được dùng nhiều trong các công ty vừa và nhỏ để xây hệ thống quản lý nội bộ, website thương mại điện tử…\n• Có thể học Laravel để biết cách xây API, kết nối cơ sở dữ liệu, xác thực người dùng.\n• Các công ty tại Đắk Lắk cũng đang sử dụng Laravel để tiết kiệm chi phí và triển khai nhanh.\n🧰 .NET – Nền tảng mạnh cho ứng dụng doanh nghiệp\nDù không còn phổ biến với startup trẻ, .NET vẫn là nền tảng vững chắc được nhiều cơ quan, ngân hàng, đơn vị hành chính sử dụng cho phần mềm quản lý, ứng dụng desktop hoặc web nội bộ.\n• Sinh viên có thể học C#, ASP.NET nếu định hướng làm cho cơ quan nhà nước hoặc công ty lớn.\n📌 Tóm lại, để bước vào kỳ thực tập nhận thức một cách chủ động và hiệu quả, sinh viên CNTT cần làm quen với những công nghệ phổ biến đang được sử dụng thực tế trong các doanh nghiệp phần mềm hiện nay.\nTrước tiên là Git và GitHub – bộ đôi không thể thiếu trong quy trình làm việc nhóm và quản lý mã nguồn. Sinh viên cần biết sử dụng ở mức cơ bản: từ việc clone dự án, commit thay đổi, push lên kho lưu trữ đến thao tác pull về máy để cập nhật phiên bản mới. Đây là kỹ năng nền tảng mà hầu như mọi công ty đều yêu cầu.\nTiếp theo là Jira hoặc Trello, hai công cụ quản lý công việc phổ biến theo mô hình Agile hoặc Kanban. Việc hiểu cách tạo task, chia giai đoạn công việc, và cập nhật tiến độ sẽ giúp sinh viên hòa nhập nhanh vào quy trình nhóm và phối hợp hiệu quả hơn với các thành viên trong dự án.\nVề công cụ lập trình, Visual Studio Code (VS Code) là lựa chọn hàng đầu nhờ nhẹ, mạnh, và dễ tùy biến. Sinh viên nên sử dụng thành thạo VS Code để viết code, cài plugin hỗ trợ như Prettier, GitLens, hoặc Live Server nhằm tăng tốc độ phát triển và kiểm thử.\nVề kiến thức lập trình nền, việc học chắc HTML, CSS và JavaScript là cực kỳ quan trọng. Đây là bộ ba nền tảng cho mọi ứng dụng web. Khi nắm vững chúng, sinh viên sẽ dễ dàng nâng cấp lên các công nghệ phức tạp hơn như React hoặc NodeJS.\nVới React, sinh viên có thể xây dựng giao diện web hoặc ứng dụng hiện đại, có khả năng tái sử dụng cao, dễ bảo trì và mang lại trải nghiệm người dùng tốt. Trong khi đó, NodeJS là lựa chọn lý tưởng để viết API backend, xử lý dữ liệu, hoặc kết nối với cơ sở dữ liệu – phù hợp với những bạn yêu thích làm việc phía server.\nĐối với các dự án nhỏ hoặc demo nhanh, Firebase là giải pháp tuyệt vời. Nó cung cấp sẵn các tính năng như xác thực người dùng, cơ sở dữ liệu thời gian thực và hosting – giúp sinh viên tích hợp và triển khai ứng dụng dễ dàng chỉ trong vài bước.\nCuối cùng, tùy theo định hướng công việc hoặc yêu cầu của nơi thực tập, sinh viên có thể làm quen với các framework khác như Laravel (PHP) hoặc .NET (C#). Đây là những nền tảng được sử dụng phổ biến tại các công ty phần mềm truyền thống, doanh nghiệp nội bộ hoặc trong các hệ thống hành chính công.\nNắm vững các công nghệ này không chỉ giúp sinh viên thích nghi nhanh với môi trường thực tế, mà còn tạo nền tảng vững chắc để tiếp tục phát triển kỹ năng chuyên sâu trong các dự án tiếp theo, kể cả đề tài tốt nghiệp hoặc sản phẩm khởi nghiệp cá nhân.\n\n☁️ 2. Công nghệ chuyển đổi số thực tế\nKhi các doanh nghiệp ở Đắk Lắk bắt đầu hành trình chuyển đổi số, họ không thể chỉ dừng lại ở việc thiết kế website hay dùng phần mềm quản lý đơn giản. Để vận hành hiệu quả, tiết kiệm chi phí và mở rộng quy mô nhanh, họ cần những nền tảng công nghệ thực tế có thể tích hợp, mở rộng, và đồng bộ dữ liệu. Sinh viên CNTT khi thực tập cần biết và làm quen với các công nghệ sau đây – đây là những \"xương sống\" của chuyển đổi số trong thực tiễn.\n☁️ 1. Cloud Computing – Điện toán đám mây (GCP, AWS, Azure)\nCloud là hạ tầng nền tảng của chuyển đổi số hiện đại. Thay vì phải mua máy chủ vật lý, doanh nghiệp thuê tài nguyên từ các nhà cung cấp lớn như Google Cloud Platform (GCP), Amazon Web Services (AWS) hoặc Microsoft Azure. Điều này giúp:\n• Tiết kiệm chi phí phần cứng và bảo trì\n• Tăng tính linh hoạt: mở rộng hay thu hẹp theo nhu cầu\n• Tăng tính sẵn sàng và bảo mật hệ thống\nVí dụ thực tế tại địa phương:\n• Công ty phần mềm ở Buôn Ma Thuột dùng GCP để host hệ thống quản lý bán hàng\n• Dịch vụ cloud mail nội bộ sử dụng Microsoft 365 trên nền Azure\n👉 Sinh viên cần biết gì?\n• Cách tạo máy chủ ảo (VM), lưu trữ file, triển khai web lên Cloud\n• Làm quen với các dịch vụ như Firebase (trên GCP), EC2/S3 (trên AWS), Azure Web Apps\n🧩 2. No-code/Low-code – Giải pháp nhanh cho doanh nghiệp không có IT mạnh\nKhông phải doanh nghiệp nào ở Đắk Lắk cũng có đội ngũ lập trình viên chuyên nghiệp. Vì vậy, nền tảng no-code hoặc low-code giúp họ xây dựng ứng dụng nhanh mà không cần viết nhiều code.\nHai công cụ phổ biến:\n• PowerApps (thuộc Microsoft): Tạo ứng dụng nội bộ nhanh từ Excel, SharePoint\n• Retool: Xây dashboard quản trị, kết nối API, hiển thị dữ liệu theo bảng biểu mà không cần viết backend phức tạp\n👉 Sinh viên cần biết gì?\n• Cách kéo – thả để tạo app đơn giản, kết nối dữ liệu từ Google Sheets, SQL\n• Tích hợp ứng dụng Retool vào hệ thống quản trị nội bộ như kho, đơn hàng, nhân viên\n📌 Lợi ích lớn nhất là sinh viên có thể thử nghiệm nhanh, làm sản phẩm demo hoặc đề tài tốt nghiệp thực tế mà không cần quá nhiều code phức tạp.\n\n\n🏢 3. Hệ thống quản trị doanh nghiệp: ERP, CRM – Nền tảng kết nối toàn bộ vận hành\nMột khi doanh nghiệp mở rộng, họ sẽ cần hệ thống ERP (Enterprise Resource Planning) hoặc CRM (Customer Relationship Management) để quản lý toàn bộ hoạt động một cách đồng bộ: từ mua hàng, bán hàng, kho, nhân sự, kế toán, đến chăm sóc khách hàng.\nHai nền tảng mã nguồn mở nổi bật:\n• ERPNext: Giao diện thân thiện, đầy đủ module từ HRM đến tài chính\n• Odoo: Linh hoạt, dễ tùy biến, có thể chạy trên cloud hoặc tại chỗ\nVí dụ thực tế:\n• Một hợp tác xã nông nghiệp ứng dụng Odoo để quản lý đơn hàng, kho nông sản, hóa đơn bán lẻ.\n• Một công ty thiết kế tại Buôn Ma Thuột dùng CRM trong Odoo để theo dõi tiến độ khách hàng và chiến dịch marketing.\n👉 Sinh viên cần biết gì?\n• Cách cài đặt, cấu hình cơ bản ERPNext hoặc Odoo\n• Hiểu luồng dữ liệu trong hệ thống quản trị doanh nghiệp\n• Có thể phát triển thêm module: ví dụ tích hợp chatbot vào CRM, hoặc kết nối dữ liệu cảm biến từ IoT vào module kho\n🎯 Tóm lại\nCác công nghệ chuyển đổi số thực tế này giúp doanh nghiệp:\n• Linh hoạt mở rộng hoạt động mà không cần đầu tư phần cứng\n• Tiết kiệm thời gian triển khai giải pháp\n• Kết nối mọi bộ phận thành một hệ thống vận hành thông minh\nVới sinh viên CNTT, việc làm quen với các công nghệ cloud, nền tảng no-code/low-code, và hệ thống ERP/CRM không chỉ giúp bạn “biết thêm công cụ”, mà còn hiểu rõ cách doanh nghiệp vận hành, từ đó có thể đề xuất giải pháp công nghệ thực tế, tạo ra đề tài tốt nghiệp giá trị, và dễ dàng bước vào thị trường việc làm ngay sau khi ra trường.\n🧩 3. Mô hình thực tế để sinh viên tham gia\nKhông phải đợi đến khi ra trường mới bắt đầu làm sản phẩm thực tế. Ngay trong giai đoạn thực tập nhận thức, sinh viên CNTT có thể quan sát các bài toán thực tế trong doanh nghiệp và bắt tay xây dựng giải pháp số. Dưới đây là những mô hình phổ biến mà nhiều doanh nghiệp tại Đắk Lắk đang triển khai hoặc đang cần cải tiến. Đây cũng là những đề tài tuyệt vời để sinh viên học hỏi, đề xuất ý tưởng, thậm chí phát triển thành dự án tốt nghiệp trong các năm tiếp theo.\n\n🏫 1. Quản lý đào tạo, quản lý học sinh – Nền tảng giáo dục số hóa\nVới sự đồng hành của các doanh nghiệp như VNPT, Viettel, nhiều trường học tại Đắk Lắk đang áp dụng hệ thống quản lý học sinh – sinh viên như VnEdu, SMAS hoặc các hệ thống riêng do công ty địa phương phát triển.\nTuy nhiên, nhiều hệ thống này còn rời rạc, thiếu tính cá nhân hóa và chưa thân thiện với người dùng. Đây là cơ hội để sinh viên CNTT:\n• Xây dựng module mới như điểm danh bằng QR code\n• Cải thiện giao diện cho giáo viên nhập điểm nhanh hơn\n• Tích hợp chatbot tư vấn học sinh, phụ huynh qua Zalo/Telegram\n👉 Ví dụ đề tài:\nThiết kế hệ thống đăng ký học phần online cho trung tâm đào tạo nghề tại Đắk Lắk – giao diện đơn giản, phù hợp người dùng phổ thông.\n\n🛒 2. Hệ thống bán hàng thông minh – Tối ưu hóa hoạt động kinh doanh địa phương\nCác cửa hàng, quán cà phê, siêu thị mini hay hợp tác xã đều có nhu cầu quản lý bán hàng, kho, đơn đặt, chăm sóc khách hàng. Nhiều doanh nghiệp nhỏ chưa có đủ điều kiện để triển khai ERP phức tạp, nên họ cần giải pháp gọn nhẹ, dễ dùng, có thể chạy trên điện thoại hoặc trình duyệt.\nSinh viên có thể đề xuất xây dựng các hệ thống như:\n• Web/app đặt hàng nội bộ\n• Dashboard thống kê đơn hàng, doanh thu, sản phẩm bán chạy\n• Hệ thống tính hoa hồng theo hiệu suất bán hàng\n• Tích hợp báo cáo doanh thu qua email hoặc Telegram Bot\n👉 Công nghệ phù hợp:\nReact (frontend), NodeJS/Laravel (backend), Firebase/SQLite, deploy trên Firebase Hosting hoặc VPS giá rẻ.\n👉 Ví dụ đề tài:\nXây dựng hệ thống quản lý đơn hàng và báo cáo doanh số cho hợp tác xã nông sản tại huyện Krông Pắc.\n\n🤖 3. Tích hợp chatbot AI hoặc nhận diện hình ảnh – Khởi đầu cho hệ thống thông minh\nNếu doanh nghiệp đã có hệ thống web hoặc app cơ bản, thì bước tiếp theo trong chuyển đổi số chính là ứng dụng trí tuệ nhân tạo (AI) để nâng cao trải nghiệm người dùng, giảm tải cho con người.\nSinh viên hoàn toàn có thể:\n• Tích hợp chatbot AI trả lời câu hỏi thường gặp (FAQ) về sản phẩm, dịch vụ, lịch làm việc…\n• Tạo chatbot tư vấn học sinh chọn môn học phù hợp với năng lực\n• Phát triển ứng dụng nhận diện hình ảnh sản phẩm – ví dụ: nhận diện độ chín của trái cây, loại sâu bệnh, đọc hóa đơn giấy thành dữ liệu điện tử\n👉 Công cụ gợi ý:\n• Dialogflow (chatbot thông minh)\n• Teachable Machine, TensorFlow.js (AI hình ảnh cơ bản)\n• Google Vision API, OpenAI API (văn bản, ngôn ngữ tự nhiên)\n👉 Ví dụ đề tài:\nXây dựng chatbot hỗ trợ tư vấn sản phẩm cà phê cho khách hàng nước ngoài bằng tiếng Anh và tiếng Việt, tích hợp trên website hợp tác xã.\n\n🎯 Lưu ý cho sinh viên khi chọn tham gia mô hình thực tế\n• Hãy chủ động hỏi và quan sát: Đừng đợi được giao việc, hãy tìm hiểu quy trình đang có và gợi ý cải tiến.\n• Bắt đầu nhỏ, đơn giản, nhưng phải có người dùng thật: Một công cụ tính lương Excel tự động hóa cũng là một giải pháp số nếu nó được dùng hàng tháng.\n• Chọn bài toán có thể mở rộng: Nếu bài toán đủ lớn, bạn có thể tiếp tục phát triển trong kỳ thực tập chuyên ngành hoặc làm đề tài tốt nghiệp.\n• Gắn giải pháp với một vấn đề cụ thể của doanh nghiệp: Đừng làm app vì “muốn học React”, mà hãy làm app vì doanh nghiệp cần “giải bài toán đặt hàng thủ công”.\n📌 Tóm lại, các mô hình thực tế là nơi sinh viên CNTT có thể \"tập lái\" trên đường đua công nghệ thực tiễn. Việc bạn làm trong kỳ thực tập nhận thức hôm nay có thể trở thành dự án khởi nghiệp nhỏ, sản phẩm dùng thật, hoặc đề tài tốt nghiệp có tính ứng dụng cao ngày mai.\n🤖 V. Hướng đi tiếp theo: AI, dữ liệu, và các đề tài tốt nghiệp\n1. Kết nối AI với hệ thống chuyển đổi số\nChuyển đổi số giúp số hóa quy trình, kết nối dữ liệu, tự động hóa thao tác. Nhưng khi doanh nghiệp đã “số hóa” đủ nhiều, câu hỏi tiếp theo sẽ là: “Làm sao để dữ liệu trở nên thông minh?”. Đó chính là lúc trí tuệ nhân tạo – AI bước vào cuộc chơi, đóng vai trò nâng cấp các hệ thống hiện tại, đưa ra gợi ý, ra quyết định, và tạo ra giá trị mới mà con người không thể tự làm được.\nDưới đây là ba hướng ứng dụng AI rất thực tế và rất phù hợp để sinh viên CNTT ở Đắk Lắk triển khai thành đề tài khóa luận hoặc dự án tốt nghiệp.\n\n🌾 Dự báo nông nghiệp bằng cảm biến và học máy (Machine Learning)\nNhiều nông trại hiện đại tại Đắk Lắk – như Greed Farm – đã lắp đặt cảm biến IoT đo nhiệt độ, độ ẩm, ánh sáng, pH đất, mưa… Tuy nhiên, phần lớn các hệ thống hiện tại chỉ hiển thị dữ liệu dạng thô trên dashboard.\nĐây là cơ hội để sinh viên phát triển các mô hình học máy (Machine Learning) giúp dự đoán:\n• Thời điểm cần tưới hoặc bón phân\n• Khả năng cây trồng bị sâu bệnh dựa vào điều kiện khí hậu\n• Năng suất dự kiến của vụ mùa sắp tới\n👉 Công nghệ gợi ý:\n• Python với thư viện Scikit-Learn, Pandas\n• TensorFlow cho mô hình đơn giản\n• Data từ Firebase hoặc xuất từ hệ thống IoT sẵn có\n👉 Ví dụ đề tài:\nXây dựng mô hình dự đoán năng suất cây cà phê dựa trên dữ liệu cảm biến và thời tiết theo mùa.\n\n🥦 AI hỗ trợ phân loại nông sản, tìm lỗi hình ảnh\nPhân loại nông sản – như cà phê, tiêu, sầu riêng – hiện nay vẫn đang làm bằng tay hoặc máy cơ bản. Với sự trợ giúp của AI thị giác máy tính (Computer Vision), sinh viên có thể xây dựng hệ thống:\n• Nhận diện trái bị sâu, hỏng, kém chất lượng\n• Phân loại trái theo kích thước, độ chín\n• Chuyển hình ảnh sang dữ liệu có thể dùng để thống kê, phân tích\n👉 Công nghệ gợi ý:\n• Teachable Machine (Google) – đơn giản, dễ huấn luyện\n• TensorFlow hoặc PyTorch – cho mô hình nâng cao\n• OpenCV – xử lý ảnh đầu vào\n👉 Ví dụ đề tài:\nXây dựng ứng dụng nhận diện lỗi trái bơ từ camera điện thoại để hỗ trợ người thu hoạch phân loại nhanh.\n\n💬 Chatbot trả lời câu hỏi khách hàng địa phương – Dùng AI tạo trải nghiệm mới\nCác doanh nghiệp nhỏ như hợp tác xã, trung tâm giáo dục, cửa hàng đặc sản... thường thiếu nhân lực tư vấn, nhưng lại có nhiều câu hỏi lặp đi lặp lại từ khách hàng. Đây là cơ hội tuyệt vời để tích hợp chatbot thông minh, giúp:\n• Tư vấn sản phẩm, dịch vụ cơ bản\n• Cung cấp thông tin giờ làm việc, địa chỉ, hướng dẫn sử dụng\n• Giao tiếp song ngữ (Việt – Anh) hoặc tiếng địa phương đơn giản\n👉 Công nghệ gợi ý:\n• Dialogflow (Google) – chatbot thông minh, hỗ trợ tiếng Việt tốt\n• Botpress, Rasa – chatbot mã nguồn mở\n• Kết nối với Zalo OA, Facebook Messenger, hoặc website riêng\n👉 Ví dụ đề tài:\nThiết kế chatbot hỗ trợ khách hàng đặt cà phê đặc sản, trả lời câu hỏi về sản phẩm, giá, giao hàng, tích hợp trên Zalo OA.\n\n🧠 Tóm lại, trí tuệ nhân tạo (AI) đang mở ra nhiều hướng ứng dụng thực tiễn mà sinh viên CNTT hoàn toàn có thể tiếp cận và phát triển thành các đề tài tốt nghiệp có tính khả thi cao. Trong bối cảnh doanh nghiệp ở Đắk Lắk đang từng bước số hóa, việc kết hợp AI vào hệ thống chuyển đổi số hiện có không chỉ giúp tăng hiệu quả vận hành mà còn tạo ra giá trị mới.\nMột hướng ứng dụng tiêu biểu là dự báo trong nông nghiệp, giúp người nông dân hoặc hợp tác xã đưa ra quyết định chính xác hơn trong việc tưới tiêu, phòng trừ sâu bệnh, hoặc ước lượng năng suất mùa vụ. Sinh viên có thể tận dụng các dữ liệu từ cảm biến IoT, kết hợp với các công cụ như Python, TensorFlow để xây dựng mô hình học máy cơ bản, và lưu trữ hoặc triển khai trên nền tảng Firebase để dễ dàng tích hợp với hệ thống hiện tại.\nMột hướng đi khác mang tính trực quan hơn là nhận diện và phân loại nông sản bằng hình ảnh. Thông qua việc sử dụng OpenCV hoặc Teachable Machine, sinh viên có thể xây dựng các hệ thống giúp phát hiện trái cây bị hỏng, phân loại sản phẩm theo kích thước hoặc độ chín – hỗ trợ đáng kể cho quá trình thu hoạch và kiểm soát chất lượng sản phẩm.\nNgoài ra, với nhu cầu tư vấn khách hàng ngày càng tăng, đặc biệt trong các doanh nghiệp nhỏ không có đội ngũ chăm sóc khách hàng chuyên trách, sinh viên có thể phát triển chatbot thông minh phục vụ việc tư vấn sản phẩm, hướng dẫn mua hàng, hoặc trả lời các câu hỏi thường gặp. Các nền tảng như Dialogflow của Google hoặc tích hợp chatbot vào Zalo OA API sẽ giúp triển khai hệ thống này một cách đơn giản, dễ vận hành và phù hợp với hành vi người dùng tại địa phương.\nBa hướng trên – dự báo nông nghiệp, nhận diện hình ảnh, và chatbot hỗ trợ – không chỉ là các ý tưởng sáng tạo, mà còn là những bài toán có thật, có dữ liệu thật và đang chờ những giải pháp số thông minh từ chính các bạn sinh viên. Đây chính là cơ hội để các bạn không chỉ học hỏi công nghệ mới, mà còn tạo ra sản phẩm hữu ích cho cộng đồng nơi mình sinh sống và học tập.\n\n🎓 Gợi ý chiến lược cho sinh viên:\n• Quan sát hệ thống sẵn có tại nơi thực tập → hỏi: “AI có thể làm gì để thông minh hơn?”\n• Tìm hiểu dữ liệu đã có → đề xuất bài toán có thể giải bằng mô hình học máy\n• Làm thử mô hình nhỏ, demo → phản hồi với doanh nghiệp → mở rộng thành đề tài khóa luận năm cuối\n🧩 2. Hướng xây dựng đề tài có giá trị\nTrong quá trình thực tập nhận thức, sinh viên CNTT không chỉ nên dừng lại ở việc quan sát quy trình và ghi chép, mà nên chủ động suy nghĩ về những đề tài tiềm năng có thể phát triển thành dự án nghiên cứu – ứng dụng thực tế cho các năm học sau, đặc biệt là khóa luận tốt nghiệp. Một đề tài có giá trị không nằm ở việc “làm cái gì mới lạ”, mà ở chỗ nó giải được bài toán thật, có người dùng thật, và có thể phát triển tiếp thành sản phẩm hữu ích.\nĐầu tiên, sinh viên nên bắt đầu từ những vấn đề thực tế tại chính doanh nghiệp mình đang thực tập. Đó có thể là một quy trình đang làm thủ công, một hệ thống cũ khó dùng, một công việc lặp đi lặp lại mà có thể tự động hóa, hoặc đơn giản là một nhu cầu chưa được số hóa. Khi bài toán xuất phát từ thực tiễn, thì hướng giải quyết cũng sẽ thiết thực, có tính ứng dụng ngay, và dễ thuyết phục cả thầy cô lẫn doanh nghiệp hỗ trợ.\nMột yếu tố quan trọng nữa là có dữ liệu thật để phát triển và kiểm chứng giải pháp. Dữ liệu này có thể là thông tin học sinh – sinh viên trong hệ thống quản lý giáo dục, nhật ký cảm biến trong trang trại, dữ liệu đơn hàng từ phần mềm bán hàng, hay các cuộc hội thoại với khách hàng qua tin nhắn. Dữ liệu thật sẽ giúp bạn xây dựng mô hình sát với thực tế, dễ kiểm tra hiệu quả, và làm nổi bật tính khả thi của sản phẩm. Hãy luôn hỏi: \"Doanh nghiệp này đang có dữ liệu gì, và dữ liệu đó có thể giúp giải bài toán nào?\"\nCuối cùng, một đề tài có giá trị nên có tiềm năng phát triển tiếp thành sản phẩm thật. Nghĩa là sau khi bạn tốt nghiệp, hệ thống đó có thể được triển khai trong doanh nghiệp, hoặc bạn có thể tiếp tục cải tiến nó thành một dự án khởi nghiệp nhỏ, một nền tảng cung cấp giải pháp cho các doanh nghiệp tương tự. Ví dụ, nếu bạn làm một chatbot tư vấn nông sản cho Greed Farm, thì sau khi hoàn thiện, nó hoàn toàn có thể được nhân rộng cho các hợp tác xã khác trong tỉnh. Từ một đề tài nhỏ, bạn có thể bước sang hành trình lớn hơn: đồng hành cùng chuyển đổi số thực tế tại địa phương.\n\n📌 Tóm lại, một đề tài tốt nghiệp có giá trị nên bắt đầu từ bài toán thật, dùng dữ liệu thật, và có tiềm năng triển khai thật. Đó là cách bạn biến kỳ thực tập nhận thức thành cơ hội thiết kế sản phẩm công nghệ đầu tiên của chính mình – không chỉ để lấy điểm, mà để tạo ra tác động thực sự cho cộng đồng xung quanh.\n🎯 VI. Chiến lược cho sinh viên: Hiểu rõ để chủ động\nThực tập nhận thức không chỉ là thời gian đến công ty ngồi quan sát rồi viết báo cáo cuối kỳ. Đây là một cơ hội quan trọng để sinh viên kết nối giữa kiến thức lý thuyết và thực tiễn, để nhìn thấy bức tranh thật của ngành công nghệ thông tin trong đời sống, và đặc biệt, là dịp để bắt đầu một hành trình học tập chủ động – nơi sinh viên có thể tự tạo ra cơ hội học hỏi và phát triển cho bản thân.\nĐể tận dụng tối đa kỳ thực tập nhận thức, sinh viên nên đi theo một chiến lược 5 bước rõ ràng, giúp không chỉ hiểu đúng, mà còn hành động hiệu quả, từ những ngày đầu tiên tại doanh nghiệp.\nBước một, hãy tìm hiểu mô hình chuyển đổi số của nơi mình thực tập. Công ty đã số hóa những gì? Họ đang dùng phần mềm nào, có hệ thống nào đang vận hành? Đâu là bài toán còn thủ công? Việc này giúp bạn nắm được “điểm xuất phát” của doanh nghiệp trên hành trình số hóa – từ đó dễ xác định được bạn có thể học gì, hỗ trợ gì.\nBước hai, đừng ngại hỏi: họ đang dùng gì, và họ muốn gì tiếp theo? Đừng chỉ nhìn hệ thống đang có – hãy tìm hiểu xem doanh nghiệp đang muốn phát triển tính năng nào, gặp khó khăn gì trong vận hành, hay đang ấp ủ ý tưởng số hóa mới. Những thông tin này sẽ mở ra cơ hội để bạn đề xuất ý tưởng, hoặc định hướng cho một đề tài thực tế có thể làm ngay từ bây giờ.\nBước ba, hãy chủ động đề xuất hỗ trợ bằng công nghệ mà bạn biết. Dù là làm một dashboard thống kê nhỏ, viết một đoạn mã tự động hóa nhập liệu, thiết kế lại giao diện người dùng, hay đề xuất xây một chatbot đơn giản, bạn vẫn đang tạo ra giá trị thật – và chứng minh rằng bạn không chỉ đến học, mà đến để góp sức. Chủ động là chìa khóa để biến kỳ thực tập thành trải nghiệm đáng nhớ.\nBước bốn, hãy ghi chép phản tư hàng tuần. Mỗi tuần trôi qua, bạn học được gì? Bạn quan sát được gì? Bạn có ý tưởng gì mới? Ghi chép này sẽ giúp bạn hệ thống hóa kiến thức, đồng thời làm nền tảng cho báo cáo thực tập, đề tài nghiên cứu hoặc thậm chí là sản phẩm cá nhân sau này.\nVà bước năm, đừng quên liên kết với giảng viên hướng dẫn càng sớm càng tốt để chia sẻ ý tưởng, thảo luận đề tài hoặc xin tư vấn về hướng đi. Việc kết nối giữa doanh nghiệp – sinh viên – nhà trường chính là điểm then chốt để tạo ra những đề tài tốt nghiệp có chiều sâu, có người hỗ trợ, và có giá trị thực tiễn cao.\n📌 Tóm lại, kỳ thực tập không phải là kỳ nghỉ kéo dài giữa các học phần. Nó là một “cánh cửa đầu tiên” dẫn bạn bước ra khỏi giảng đường để chạm vào thế giới thật của ngành CNTT. Và nếu bạn đi đúng chiến lược, chủ động học hỏi, chủ động đề xuất, bạn sẽ biến mỗi ngày thực tập thành một bước tiến nghề nghiệp, mỗi bài quan sát thành một ý tưởng đề tài, và mỗi lần phản tư thành một viên gạch dựng xây hành trình phát triển của chính mình.\n📚 VII. Phụ lục – Tài nguyên & tài liệu tự học\n📘 1. Tên các sách nên đọc – dịch ngắn gọn theo mục tiêu thực tập\nDưới đây là những cuốn sách nổi bật về chuyển đổi số, công nghệ và chiến lược áp dụng CNTT vào doanh nghiệp – được chọn lọc từ các ebook quốc tế, dịch gọn theo hướng phù hợp với sinh viên CNTT:\n• The Tech Whisperer (Jaspreet Bindra)\n→ Tư duy chiến lược về chuyển đổi số, giải thích dễ hiểu, có ví dụ gần với Việt Nam. Rất phù hợp cho sinh viên muốn hiểu “chuyển đổi số là gì” từ góc nhìn lãnh đạo.\n• Digital Transformation Best Practices (Sandeep Raut)\n→ Cẩm nang thực tế để áp dụng chuyển đổi số trong doanh nghiệp nhỏ. Có hướng dẫn rõ ràng về từng bước triển khai, phù hợp cho sinh viên tìm đề tài.\n• Digital Transformation Handbook (Krunoslav Ris)\n→ Toàn cảnh về chuyển đổi số: từ văn hóa doanh nghiệp, công nghệ, đến quản trị. Đọc để có cái nhìn hệ thống, dễ áp dụng khi đi thực tập trong các công ty vừa và nhỏ.\n• Maximizing Value with Automation and Digital Transformation (Willcocks et al.)\n→ Sách dành cho những bạn muốn tìm hiểu sâu hơn về tự động hóa, AI, và giá trị doanh nghiệp.\n\n💻 2. Danh sách công nghệ nên cài đặt và thử nghiệm\nDưới đây là các công cụ và nền tảng sinh viên nên tự cài đặt trước khi đi thực tập, để chủ động học và thử nghiệm tại nhà:\n• VS Code (code editor đa năng)\n• Git + GitHub (quản lý mã nguồn, version control)\n• Node.js (lập trình backend, API)\n• React (frontend web hiện đại)\n• Postman (kiểm thử API)\n• XAMPP / Laragon (chạy PHP – Laravel local)\n• Firebase (đám mây – host web, auth, realtime database)\n• Jira hoặc Trello (quản lý công việc nhóm)\n• Teachable Machine (huấn luyện mô hình AI đơn giản)\n• Dialogflow (tạo chatbot hỗ trợ tiếng Việt)\nNgoài ra, sinh viên có thể thử Odoo / ERPNext (dạng demo online) để hình dung cách doanh nghiệp quản lý vận hành số.\n\n🎓 3. Link khóa học miễn phí về chuyển đổi số và AI cho sinh viên\nCác khóa học sau đều miễn phí, ngắn gọn và thực tế – được thiết kế cho người mới bắt đầu hoặc sinh viên đang cần định hướng thực tập, làm đề tài.\n• Khóa học chuyển đổi số nền tảng – Bộ TT&TT Việt Nam\n🔗 https://dx.onetouch.mic.gov.vn\n→ Giải thích rõ chuyển đổi số là gì, ứng dụng thế nào tại Việt Nam.\n• AI for Everyone – Andrew Ng (Coursera)\n🔗 https://www.coursera.org/learn/ai-for-everyone\n→ Dành cho sinh viên chưa học AI, giúp hiểu cách áp dụng AI vào doanh nghiệp.\n• Google Cloud Skill Boost – học cloud miễn phí\n🔗 https://www.cloudskillsboost.google\n→ Học cách dùng Firebase, Cloud Functions, BigQuery…\n• Microsoft Learn – PowerApps & Low-Code\n🔗 https://learn.microsoft.com/en-us/training\n→ Tự học Power Platform – ứng dụng tạo app không cần viết code.\n\n✅ KẾT LUẬN TÀI LIỆU\nChuyển đổi số không còn là xu hướng, mà đã là thực tại trong mọi lĩnh vực, từ giáo dục, nông nghiệp đến dịch vụ và sản xuất. Với sự phát triển nhanh chóng của công nghệ, doanh nghiệp ở Đắk Lắk đang từng bước số hóa để nâng cao hiệu quả và cạnh tranh bền vững. Trong hành trình đó, sinh viên CNTT không chỉ là người quan sát, mà có thể và nên trở thành người tham gia, người đề xuất, và người sáng tạo ra giải pháp mới.\nThực tập nhận thức là cơ hội vàng để bạn kết nối lý thuyết với thực tiễn, tìm hiểu nhu cầu thật, và xây dựng nền móng cho đề tài tốt nghiệp thực sự có giá trị. Hãy chủ động, quan sát thông minh, đặt câu hỏi đúng, đề xuất giải pháp nhỏ, và từ đó tạo dựng những bước tiến lớn trong hành trình nghề nghiệp của mình.\nChúc bạn – người kỹ sư công nghệ tương lai – sẽ tìm được hướng đi rõ ràng, thực tế và đầy cảm hứng từ kỳ thực tập nhận thức đầu tiên này.\n\n\n",
  "﻿Giới thiệu AI ứng dụng: Hành trang thực tập nhận thức dành cho sinh viên CNTT tại Đắk Lắk\n\nKhi bước vào kỳ thực tập nhận thức, sinh viên CNTT năm hai thường mang tâm thế quan sát là chính, bởi kiến thức chuyên ngành chưa nhiều. Tuy nhiên, trong thời điểm mà trí tuệ nhân tạo (AI) đang len lỏi vào mọi ngành nghề – từ nông nghiệp, giáo dục đến phần mềm – thì đây lại chính là cơ hội tốt để sinh viên làm quen sớm với AI ứng dụng trong bối cảnh thực tế. Ngay tại Đắk Lắk, nhiều doanh nghiệp nhỏ như hợp tác xã nông nghiệp công nghệ cao, các công ty phần mềm outsource, hay chi nhánh của VNPT và Viettel đã bước đầu triển khai AI để tối ưu quy trình và dịch vụ.\nTài liệu này được biên soạn như một hành trang nhập môn về AI ứng dụng, dành riêng cho sinh viên năm 2 ngành CNTT khi đi thực tập nhận thức. Với cách trình bày gần gũi, gợi mở từng bước, tài liệu giúp sinh viên hiểu được: AI là gì, hiện diện như thế nào trong doanh nghiệp, và làm thế nào để từ một sinh viên chưa học AI bài bản vẫn có thể tạo ra sản phẩm AI nhỏ, gắn với nhu cầu thực tế nơi mình thực tập. Đồng thời, đây cũng là một nguồn tham khảo để sinh viên hình thành đề tài tốt nghiệp sớm, kết hợp cùng doanh nghiệp và giảng viên để tạo ra giá trị thật cho cộng đồng.\n\nTài liệu được chia thành 7 phần, mỗi phần đóng vai trò như một bước trên hành trình tiếp cận AI ứng dụng:\n1. Mở đầu – Giải thích lý do vì sao sinh viên cần quan tâm đến AI, ngay cả khi chưa học chuyên sâu.\n2. Tổng quan AI – Trình bày khái niệm, các nhóm công nghệ AI (machine learning, NLP, computer vision...), kèm theo xu hướng AI trong doanh nghiệp như tự động hóa quy trình, chatbot, phân tích dữ liệu.\n3. Các công cụ AI đơn giản – Gợi ý những nền tảng dễ tiếp cận như Teachable Machine, Dialogflow, GPT + FAISS... giúp sinh viên có thể bắt đầu thực hành ngay.\n4. Gợi ý đề tài gắn với doanh nghiệp tại Đắk Lắk – Nêu cụ thể các hướng AI sinh viên có thể triển khai tại VNPT, Viettel, Greed Farm, các công ty phần mềm SME.\n5. Hướng đề tài AI dễ triển khai – Đề xuất cụ thể 5 dạng đề tài khả thi, từ chatbot tài liệu nội bộ, AI phân loại ảnh, đến ứng dụng AI no-code, phân tích cảm xúc.\n6. Chiến lược tiếp cận AI cho sinh viên năm 2 – Hướng dẫn cách học theo từng bước: thử công cụ đơn giản, demo nhỏ, làm việc nhóm và gắn đề tài với doanh nghiệp.\n7. Tài liệu & khóa học gợi ý – Danh sách sách và khóa học miễn phí phù hợp với sinh viên mới bắt đầu, giúp tiếp tục học sau thực tập.\n🧭 I. Mở đầu: Vì sao nên biết về AI khi đi thực tập?\nKhi bước vào kỳ thực tập nhận thức, nhiều sinh viên CNTT năm hai thường nghĩ rằng mình chỉ cần quan sát quy trình làm việc và tìm hiểu môi trường doanh nghiệp. Nhưng thực tế, đây cũng chính là thời điểm vàng để các bạn bắt đầu làm quen với những xu hướng công nghệ đang định hình lại toàn bộ hoạt động của doanh nghiệp – trong đó, trí tuệ nhân tạo, hay gọi tắt là AI, đang đóng vai trò cực kỳ quan trọng.\nAI không còn là thứ gì đó xa vời, chỉ xuất hiện trong các phòng nghiên cứu hay các công ty công nghệ lớn. Ngay tại Đắk Lắk, nhiều doanh nghiệp địa phương như VNPT, Viettel, các hợp tác xã nông nghiệp thông minh, hay các công ty phần mềm nhỏ, đã và đang ứng dụng AI vào trong các hoạt động thực tế. Có nơi dùng AI để theo dõi cây trồng qua hình ảnh, có nơi tích hợp chatbot hỗ trợ khách hàng, có nơi lại sử dụng AI để phân tích phản hồi từ người dùng trên nền tảng số.\nDù các bạn sinh viên năm hai chưa được học bài bản về AI trong chương trình chính khóa, nhưng điều đó không có nghĩa là AI nằm ngoài tầm với. Ngày nay, có rất nhiều công cụ và nền tảng đơn giản giúp các bạn tiếp cận và thử nghiệm AI một cách dễ dàng. Ví dụ, Google Teachable Machine cho phép huấn luyện mô hình phân loại hình ảnh chỉ bằng vài cú click chuột. ChatGPT có thể trả lời câu hỏi kỹ thuật, hoặc hướng dẫn cách viết mã. Và với một chút hướng dẫn, các bạn còn có thể tạo chatbot nội bộ sử dụng mô hình RAG, giúp doanh nghiệp trả lời câu hỏi từ tài liệu, văn bản sẵn có một cách tự động.\nHiểu và chạm tay vào AI trong giai đoạn thực tập nhận thức không chỉ giúp các bạn tự tin hơn, mà còn mở ra cánh cửa để hình thành các đề tài tốt nghiệp gắn liền với thực tiễn doanh nghiệp. Một dự án nhỏ trong kỳ thực tập hôm nay hoàn toàn có thể trở thành sản phẩm hữu ích ngày mai – phục vụ cộng đồng, hỗ trợ doanh nghiệp và làm nổi bật chính bạn trên hành trình nghề nghiệp phía trước.\n🌍 II. Tổng quan AI: Khái niệm, ứng dụng và xu hướng\n1. AI là gì? Các nhóm công nghệ AI\nKhi nhắc đến trí tuệ nhân tạo – hay còn gọi là AI – nhiều người thường hình dung đến những robot biết suy nghĩ như con người, hoặc các hệ thống phức tạp chỉ có ở những công ty lớn. Nhưng thật ra, AI là tập hợp các công nghệ giúp máy móc có khả năng “hiểu, học, và phản ứng thông minh” với thông tin, giống như con người – tuy mức độ thông minh đó còn tùy theo mục đích cụ thể.\nAI không phải là một công nghệ duy nhất, mà là một hệ sinh thái gồm nhiều nhánh nhỏ. Đầu tiên là Machine Learning, hay học máy – đây là công nghệ giúp máy tính học từ dữ liệu quá khứ để đưa ra dự đoán hoặc quyết định. Một nhánh mạnh hơn của nó là Deep Learning, sử dụng mạng nơ-ron nhân tạo để xử lý dữ liệu lớn và phức tạp hơn, đặc biệt hiệu quả trong nhận diện hình ảnh hoặc giọng nói.\nMột nhóm quan trọng khác là Natural Language Processing, hay NLP – dùng để máy hiểu và xử lý ngôn ngữ tự nhiên của con người, ví dụ như khi bạn nói chuyện với chatbot, dùng tính năng gõ văn bản bằng giọng nói, hay yêu cầu Google Dịch dịch nhanh một câu tiếng Anh.\nBên cạnh đó, còn có Computer Vision – công nghệ giúp máy “nhìn” và phân tích hình ảnh hoặc video, chẳng hạn như nhận diện khuôn mặt, phân biệt các loại trái cây, hay phát hiện vết sâu bệnh trên lá cây.\nCuối cùng, là một công nghệ khá mới nhưng đang rất được quan tâm – đó là RAG, viết tắt của Retrieval-Augmented Generation. Đây là mô hình kết hợp khả năng “truy xuất thông tin” từ tài liệu với khả năng “tạo câu trả lời mới” của các mô hình ngôn ngữ lớn như ChatGPT. Nhờ RAG, các chatbot không chỉ phản hồi chung chung, mà còn có thể đưa ra câu trả lời cụ thể, chính xác dựa trên tài liệu riêng của doanh nghiệp – chẳng hạn như nội quy, quy trình, hay hướng dẫn đào tạo.\nTất cả những công nghệ này, tuy nghe có vẻ cao siêu, nhưng đều có những ví dụ rất gần gũi với các bạn sinh viên. Ví dụ như AI có thể phân loại trái cây từ hình ảnh camera tại trang trại, trả lời câu hỏi về nội quy thực tập cho sinh viên, hay dự báo khả năng cây trồng bị bệnh dựa trên dữ liệu cảm biến từ đất, độ ẩm và thời tiết.\nNắm được bức tranh tổng quan này không chỉ giúp các bạn hiểu rõ hơn AI là gì, mà còn mở ra hướng tư duy: \"Liệu bài toán nào ở nơi thực tập có thể giải được bằng AI?\"\n2. Xu hướng AI doanh nghiệp hiện nay\n(Trích từ các tài liệu như Digital Champion và Power Platform Playbook)\nHiện nay, khi nói đến AI trong doanh nghiệp, người ta không chỉ nhắc đến công nghệ, mà nhấn mạnh vào việc AI có thể giúp giải quyết những bài toán thực tế nào và mang lại giá trị gì cho hoạt động sản xuất – kinh doanh hằng ngày.\nMột trong những xu hướng nổi bật đầu tiên là AI kết hợp với tự động hóa quy trình, còn gọi là Intelligent Automation. Ở cấp độ cơ bản, doanh nghiệp có thể dùng phần mềm để tự động xử lý hóa đơn, nhập liệu, hoặc gửi thông báo. Nhưng khi kết hợp thêm AI, hệ thống không chỉ “làm theo quy trình” mà còn hiểu và thích ứng với tình huống, như tự động phân loại email, xác định mức độ ưu tiên của công việc, hoặc gợi ý phương án xử lý hiệu quả hơn. Ví dụ tại một công ty phần mềm nhỏ, AI có thể giúp kiểm tra lỗi logic trong tài liệu mô tả yêu cầu, hoặc tạo trước kịch bản xử lý cho các lỗi phổ biến trong quá trình vận hành hệ thống.\nXu hướng thứ hai là AI nâng cao trải nghiệm khách hàng. Điều này thể hiện rõ qua các chatbot và voicebot – trợ lý ảo có khả năng trò chuyện và phản hồi tự nhiên. Nhiều doanh nghiệp nhỏ ở Đắk Lắk, như các đơn vị phân phối nông sản, trường học, trung tâm tư vấn giáo dục, đã bắt đầu thử nghiệm chatbot trả lời các câu hỏi thường gặp như giờ làm việc, thông tin khóa học, hay tình trạng đơn hàng. Với khả năng học từ dữ liệu trước đó và trả lời nhanh chóng 24/7, AI không chỉ giúp tiết kiệm thời gian mà còn tạo trải nghiệm chuyên nghiệp hơn cho người dùng cuối – dù doanh nghiệp chưa có đội ngũ hỗ trợ lớn.\nCuối cùng là xu hướng AI kết hợp với phân tích dữ liệu nội bộ, thông qua các hệ thống gọi là Business Intelligence – hay viết tắt là BI. Với sự hỗ trợ của AI, doanh nghiệp không chỉ xem được báo cáo dạng biểu đồ tĩnh, mà còn có thể nhận gợi ý thông minh: đâu là sản phẩm bán chạy nhất trong tuần, nguyên nhân doanh thu giảm trong tháng qua, hay dự đoán đơn hàng sẽ tăng đột biến vào dịp lễ. AI giúp nhìn vào dữ liệu quá khứ và dự đoán tương lai, từ đó hỗ trợ ra quyết định nhanh hơn, chính xác hơn.\nNhững xu hướng này không còn là lý thuyết xa xôi, mà đã và đang được triển khai từng bước tại các doanh nghiệp vừa và nhỏ, thậm chí tại các đơn vị công lập như trường học, trung tâm hành chính. Với góc nhìn đó, sinh viên CNTT khi đi thực tập không chỉ là người học việc, mà hoàn toàn có thể đóng vai trò người đề xuất – mang theo góc nhìn công nghệ mới, hỗ trợ doanh nghiệp từng bước tiếp cận AI và chuyển đổi số hiệu quả hơn.\n🧪 III. Các công cụ AI đơn giản sinh viên có thể thử\nMột trong những rào cản khiến sinh viên CNTT năm hai ngại tiếp cận với AI là cảm giác “AI phức tạp lắm”, “phải biết nhiều toán và lập trình mới làm được”. Nhưng thực tế, nhờ sự phát triển của các nền tảng đơn giản và miễn phí, ngày nay bất kỳ sinh viên nào chỉ cần một trình duyệt và một chút tò mò học hỏi cũng có thể tự mình thử nghiệm và tạo ra những ứng dụng AI cơ bản nhưng đầy tính thực tiễn.\n• Teachable Machine: phân loại hình ảnh, cử chỉ (cho nông nghiệp, nhận diện sản phẩm)\nCông cụ đầu tiên mà sinh viên có thể thử ngay là Teachable Machine của Google. Đây là một nền tảng học máy trực quan, cho phép bạn huấn luyện mô hình phân loại hình ảnh hoặc cử chỉ mà không cần viết bất kỳ dòng mã nào. Bạn chỉ cần chuẩn bị vài hình ảnh ví dụ – chẳng hạn như các loại trái cây chín khác nhau, hình ảnh cây trồng bị sâu bệnh, hoặc cử chỉ tay – rồi đưa vào hệ thống. Sau đó, chỉ với một nút bấm, Teachable Machine sẽ tự động tạo ra mô hình giúp bạn nhận diện các hình ảnh mới thuộc các nhóm đã học. Công cụ này cực kỳ phù hợp để làm các đề tài nhỏ trong lĩnh vực nông nghiệp thông minh, nhận diện sản phẩm, hoặc hỗ trợ người lao động trong các quy trình kiểm tra đơn giản.\n• Dialogflow + Zalo OA: tạo chatbot nội dung trả lời học sinh/khách hàng\nCông cụ thứ hai là Dialogflow, một nền tảng tạo chatbot của Google, có thể kết hợp với Zalo Official Account (Zalo OA) để xây dựng chatbot trả lời tự động cho người dùng Việt Nam. Với Dialogflow, sinh viên có thể tạo ra các kịch bản hội thoại như trả lời câu hỏi về nội quy thực tập, thông tin môn học, lịch nộp bài, hoặc tư vấn cơ bản về sản phẩm. Khi tích hợp với Zalo OA, chatbot sẽ hoạt động trực tiếp trên nền tảng mà phần lớn người dùng Việt Nam quen thuộc, giúp việc triển khai thử nghiệm trở nên dễ dàng hơn rất nhiều. Đây là lựa chọn lý tưởng cho các công ty phần mềm nhỏ, trung tâm giáo dục, hoặc các đơn vị hành chính địa phương muốn cải thiện tương tác với người dân.\nĐiểm hay ở cả hai công cụ này là sinh viên không cần phải học chuyên sâu về AI mới có thể dùng được, nhưng vẫn có thể làm ra sản phẩm có ích cho thực tiễn. Quan trọng hơn, những công cụ này có thể trở thành bàn đạp để sinh viên hiểu sâu hơn về AI, và nếu có hứng thú, tiếp tục học nâng cao bằng các công cụ như TensorFlow, PyTorch, hoặc LangChain trong tương lai.\nGPT + FAISS/Chroma: xây chatbot trả lời từ tài liệu nội bộ (RAG)\nMột trong những công cụ nâng cao nhưng vẫn đủ thân thiện cho sinh viên tiếp cận là việc kết hợp GPT với FAISS hoặc ChromaDB, nhằm xây dựng một mô hình chatbot thông minh có thể trả lời dựa trên tài liệu nội bộ – được gọi là RAG, hay Retrieval-Augmented Generation. Đây là dạng chatbot có thể trả lời chính xác dựa trên văn bản cụ thể như nội quy thực tập, tài liệu đào tạo, giáo trình môn học hoặc quy trình nghiệp vụ tại doanh nghiệp.\nNguyên lý hoạt động như sau: tài liệu ban đầu – có thể là PDF, Word hoặc văn bản thuần túy – được chia nhỏ thành từng đoạn, sau đó chuyển thành các vector số hóa bằng cách sử dụng mô hình embedding. Các vector này được lưu trong một cơ sở dữ liệu đặc biệt gọi là vector database, chẳng hạn như FAISS (mã nguồn mở của Facebook, rất nhẹ) hoặc ChromaDB (một lựa chọn đơn giản, dễ tích hợp với Python). Khi người dùng đặt câu hỏi, hệ thống sẽ tìm những đoạn văn bản gần giống nhất với câu hỏi đó, và gửi cùng với câu hỏi tới mô hình GPT. Nhờ vậy, câu trả lời mà chatbot tạo ra không chỉ chung chung, mà có nội dung sát với thông tin thật trong tài liệu.\nMô hình này tuy nghe có vẻ phức tạp, nhưng hiện nay đã có rất nhiều thư viện và mẫu mã nguồn mở cho phép sinh viên thiết lập chỉ trong vài giờ, đặc biệt nếu được hỗ trợ hướng dẫn ban đầu. Đây là công cụ cực kỳ tiềm năng để sinh viên thực hiện các đề tài như AI tutor môn học, chatbot nội quy thực tập, hay trợ lý ảo đào tạo nhân viên tại doanh nghiệp nhỏ.\n• Google Colab + Python: xử lý mô hình học máy đơn giản\nTiếp theo, một công cụ nền tảng mà bất kỳ sinh viên CNTT nào cũng nên biết – đó là Google Colab kết hợp với Python. Google Colab là một nền tảng lập trình trên trình duyệt, cho phép bạn viết và chạy mã Python mà không cần cài đặt gì cả. Với Colab, sinh viên có thể thử các mô hình học máy đơn giản, như phân loại văn bản, dự đoán kết quả học tập, hoặc nhận diện mẫu từ dữ liệu cảm biến. Chỉ với một vài dòng mã, các bạn có thể huấn luyện mô hình nhỏ trên dữ liệu thực tế và quan sát kết quả ngay lập tức.\nĐiều đặc biệt hữu ích là Google Colab đã có sẵn thư viện học máy như Scikit-learn, TensorFlow, Pandas, giúp sinh viên dễ dàng thử nghiệm ý tưởng mà không cần cấu hình phức tạp. Đây là công cụ lý tưởng để làm các đề tài như dự đoán thời tiết nông nghiệp, phân tích dữ liệu sinh viên, hoặc thậm chí là huấn luyện mô hình AI đơn giản cho hệ thống thông minh tại nơi thực tập.\nKhi kết hợp Google Colab để xử lý mô hình và FAISS để quản lý dữ liệu tri thức, sinh viên hoàn toàn có thể xây dựng những sản phẩm AI nhỏ nhưng có ích, phục vụ đúng nhu cầu của doanh nghiệp địa phương.\n🏢 IV. Gợi ý đề tài AI gắn với doanh nghiệp thực tế ở Đắk Lắk\n1. Với VNPT/Viettel: Mở ra cơ hội xây dựng các trợ lý ảo và hệ thống hỗ trợ giáo dục số\nHai đơn vị lớn là VNPT và Viettel chi nhánh Đắk Lắk hiện không chỉ cung cấp dịch vụ viễn thông, mà còn đang tham gia rất tích cực vào các chương trình chuyển đổi số trong giáo dục, chính quyền và doanh nghiệp địa phương. Đây là môi trường lý tưởng để sinh viên thực tập và đề xuất các đề tài AI có tính ứng dụng cao, xuất phát từ nhu cầu thực tế.\n• Chatbot hỏi đáp tài liệu nội quy thực tập\nMột trong những đề tài khởi đầu đơn giản nhưng rất hữu ích là xây dựng chatbot hỏi đáp tài liệu nội quy thực tập. Khi sinh viên mới đến doanh nghiệp, có rất nhiều câu hỏi lặp đi lặp lại như: giờ làm việc, cách báo cáo hàng tuần, quy định về trang phục, hoặc quy trình nộp báo cáo. Thay vì để cán bộ phụ trách trả lời từng người, chatbot có thể tự động phản hồi chính xác từ một nguồn tài liệu nội bộ đã có sẵn. Đây chính là mô hình RAG – Retrieval-Augmented Generation mà sinh viên có thể xây dựng với GPT và vector database như FAISS hoặc ChromaDB. Chatbot này có thể được tích hợp vào website nội bộ, ứng dụng Zalo OA, hoặc thậm chí cài trên Google Chat – nơi nhân viên và sinh viên đều đang sử dụng hàng ngày.\nMột hướng đề tài khác có thể triển khai là trợ lý ảo đọc hiểu tài liệu đào tạo số. VNPT và Viettel đều có hệ thống học liệu điện tử, gồm các giáo trình đào tạo nội bộ, hướng dẫn sử dụng phần mềm, hoặc bài giảng cho trường học. Sinh viên có thể xây dựng một AI tutor giúp người học tra cứu nhanh nội dung, hỏi đáp kiến thức theo từng mục, hoặc thậm chí gợi ý tài liệu liên quan để học sâu hơn. Điều này không chỉ hữu ích cho sinh viên, mà còn giúp doanh nghiệp cải thiện chất lượng đào tạo nội bộ mà không cần tăng nhân sự hỗ trợ.\nNgoài ra, một đề tài tiềm năng nữa là AI phân tích tương tác người học trên hệ thống quản lý giáo dục số. Nhiều trường học tại Đắk Lắk đã triển khai các nền tảng LMS (Learning Management System) do VNPT hoặc Viettel cung cấp. Nếu được cấp quyền truy cập dữ liệu, sinh viên có thể phân tích lịch sử truy cập, thời gian học tập, tỷ lệ hoàn thành bài học... từ đó xây dựng mô hình đánh giá mức độ tương tác của học sinh, giúp giáo viên và nhà trường điều chỉnh cách dạy, hoặc cảnh báo sớm các học sinh có nguy cơ bỏ học. Đây là dạng đề tài sử dụng học máy đơn giản nhưng mang lại giá trị thiết thực cho giáo dục địa phương.\nTất cả các đề tài trên đều có một điểm chung: xuất phát từ nhu cầu thực tế, có dữ liệu thật, và có khả năng triển khai trong môi trường doanh nghiệp địa phương. Đây chính là cơ hội tuyệt vời để sinh viên không chỉ học về AI, mà còn trở thành một phần trong quá trình chuyển đổi số của doanh nghiệp nơi mình thực tập.\n• Trợ lý ảo đọc hiểu tài liệu giáo dục/hướng dẫn số\nMột đề tài AI rất thực tế và có thể triển khai ở cấp độ sinh viên năm hai chính là xây dựng trợ lý ảo có khả năng đọc hiểu và trả lời câu hỏi từ tài liệu giáo dục hoặc hướng dẫn nội bộ số hóa. Hiện nay, các doanh nghiệp lớn như VNPT và Viettel đang đóng vai trò chủ lực trong việc xây dựng hệ thống học liệu điện tử cho trường học và cơ quan hành chính tại Đắk Lắk. Họ cung cấp nền tảng LMS, thư viện số, cổng thông tin đào tạo, cùng hàng trăm tài liệu hướng dẫn sử dụng, chính sách nội bộ hoặc quy trình nghiệp vụ.\nTuy nhiên, thực tế cho thấy, người dùng cuối như giáo viên, học sinh, phụ huynh hoặc thậm chí nhân viên trong doanh nghiệp thường khó khăn trong việc tra cứu nhanh thông tin cần thiết. Tài liệu có thể dài hàng chục trang, nhưng người dùng chỉ cần biết một mục nhỏ như \"cách nhập điểm\", \"cách khôi phục mật khẩu\", hoặc \"hướng dẫn nộp bài kiểm tra\".\nĐây chính là lúc AI trợ lý ảo đọc hiểu tài liệu phát huy hiệu quả. Sinh viên CNTT có thể xây dựng một chatbot nội bộ sử dụng kiến trúc RAG – Retrieval-Augmented Generation, kết hợp các mô hình ngôn ngữ như GPT với dữ liệu được trích từ tài liệu PDF hoặc Word có sẵn. Khi người dùng đặt câu hỏi, chatbot sẽ tìm đúng phần nội dung liên quan trong tài liệu, và tạo câu trả lời ngắn gọn, rõ ràng theo văn phong tự nhiên.\nTrợ lý ảo này có thể tích hợp ngay vào nền tảng web của hệ thống LMS, app mobile học liệu, hoặc giao tiếp qua Zalo, Facebook Messenger – tùy theo nơi triển khai. Ví dụ, phụ huynh có thể hỏi chatbot: \"Làm sao để đăng ký tài khoản cho con học lớp 6?\" – và nhận được hướng dẫn cụ thể được trích ra từ tài liệu chính thức mà doanh nghiệp đã cung cấp.\nVề mặt kỹ thuật, sinh viên có thể sử dụng các công cụ như LangChain, FAISS hoặc Chroma để xây dựng hệ thống tìm kiếm, và kết hợp với OpenAI GPT API để tạo phần phản hồi ngôn ngữ tự nhiên. Toàn bộ dự án có thể chạy thử trên Google Colab, sử dụng mã nguồn mở và hoàn toàn miễn phí trong giai đoạn phát triển.\nVới đề tài này, sinh viên không chỉ học cách xử lý tài liệu, tạo chatbot và tích hợp AI, mà còn giúp doanh nghiệp cải thiện đáng kể khả năng tự phục vụ của người dùng cuối, giảm gánh nặng cho bộ phận hỗ trợ kỹ thuật. Đây là một hướng đi vừa dễ bắt đầu, vừa tạo ra sản phẩm thực sự hữu ích – đặc biệt trong môi trường giáo dục số đang ngày càng mở rộng ở các tỉnh như Đắk Lắk.\n• AI đánh giá mức độ tương tác của học sinh trên LMS\nMột đề tài rất tiềm năng trong lĩnh vực giáo dục số và hoàn toàn phù hợp để sinh viên CNTT thực hiện trong kỳ thực tập nhận thức, đó là xây dựng hệ thống AI đánh giá mức độ tương tác của học sinh trên nền tảng LMS – tức là hệ thống quản lý học tập trực tuyến. Đây là một nhu cầu đang nổi lên rõ rệt tại các trường học sử dụng giải pháp của VNPT và Viettel, những đơn vị đang triển khai mạnh mẽ các nền tảng học liệu số tại địa phương như Đắk Lắk.\nTrong quá trình chuyển đổi số giáo dục, các trường học đã bắt đầu lưu trữ dữ liệu học tập dưới dạng số hóa: từ lịch sử đăng nhập của học sinh, thời gian truy cập bài giảng, số lần hoàn thành bài tập, cho đến việc tham gia các buổi học trực tuyến. Tuy nhiên, một câu hỏi lớn đặt ra là: liệu học sinh chỉ truy cập bài giảng rồi thoát ra thì có gọi là “tương tác”? Làm thế nào để giáo viên hoặc nhà trường biết được học sinh nào đang học tích cực, học sinh nào đang có dấu hiệu bỏ cuộc hoặc giảm động lực học?\nĐây chính là nơi mà AI có thể can thiệp để phân tích hành vi học tập và đưa ra đánh giá thông minh. Sinh viên thực tập có thể xây dựng một mô hình AI đơn giản – sử dụng Python và thư viện học máy như Scikit-learn – để tổng hợp dữ liệu hành vi từ hệ thống LMS, chẳng hạn như tần suất đăng nhập, thời lượng học mỗi tuần, tỷ lệ hoàn thành bài tập, số lần xem lại video bài giảng, v.v. Dựa trên các đặc trưng này, mô hình có thể phân nhóm học sinh thành các mức độ tương tác: cao, trung bình hoặc thấp.\nKết quả phân tích có thể hiển thị trên một dashboard trực quan dành cho giáo viên hoặc ban giám hiệu. Với cái nhìn tổng thể này, nhà trường có thể can thiệp sớm với các học sinh có dấu hiệu giảm tương tác, đưa ra các biện pháp hỗ trợ kịp thời như gọi điện, tư vấn hoặc điều chỉnh phương pháp dạy.\nĐiều quan trọng là sinh viên không cần xử lý dữ liệu lớn hay viết mô hình phức tạp. Dữ liệu học tập thường có cấu trúc rõ ràng và dễ thao tác – chỉ cần sử dụng Google Colab hoặc Pandas để xử lý là đã có thể làm được bước đầu. Nếu được phối hợp với doanh nghiệp và nhà trường, đề tài này hoàn toàn có thể mở rộng thành hệ thống thật, triển khai trong một học kỳ và đo lường hiệu quả rõ ràng.\nĐây không chỉ là bài tập AI đơn giản, mà là một ví dụ điển hình cho thấy AI có thể giúp nâng cao chất lượng giáo dục một cách thiết thực, và sinh viên thực tập có thể là người khởi đầu cho sự thay đổi ấy.\n2. Với Greed Farm: Nông nghiệp thông minh và cơ hội áp dụng AI\n• AI phân loại trái cây dựa trên hình ảnh (Teachable Machine + Firebase)\nMột trong những đề tài đơn giản nhưng rất trực quan và đầy tiềm năng cho sinh viên thực tập tại các doanh nghiệp nông nghiệp như Greed Farm, đó là xây dựng hệ thống AI phân loại trái cây dựa trên hình ảnh. Trong bối cảnh nông nghiệp đang từng bước hiện đại hóa, việc ứng dụng AI để hỗ trợ phân loại, kiểm tra chất lượng sản phẩm là hướng đi vô cùng thực tế.\nTại các nông trại như Greed Farm, việc phân loại trái cây thường được thực hiện thủ công, dựa vào mắt thường của người lao động. Điều này vừa tốn thời gian, vừa thiếu nhất quán, và khó mở rộng quy mô. Tuy nhiên, nếu có thể dùng AI để nhận diện hình ảnh trái cây – chẳng hạn như phân biệt các mức độ chín, nhận biết trái có bị sâu, dập, hay lỗi ngoại hình – thì doanh nghiệp sẽ tăng đáng kể hiệu suất và tính chuyên nghiệp trong khâu sơ chế, đóng gói.\nSinh viên CNTT hoàn toàn có thể tiếp cận bài toán này bằng cách sử dụng công cụ Teachable Machine của Google, vốn rất dễ dùng và không yêu cầu kiến thức lập trình phức tạp. Các bạn chỉ cần chụp một số hình ảnh trái cây ở các trạng thái khác nhau – ví dụ: chín – chưa chín – hư hỏng – đạt tiêu chuẩn – không đạt – rồi dùng các ảnh này để huấn luyện mô hình phân loại. Teachable Machine sẽ tự động tạo ra một mô hình nhận diện, có thể chạy thử ngay trên trình duyệt hoặc xuất thành mã để tích hợp vào ứng dụng web.\nĐể nâng cao hơn một bước, sinh viên có thể kết hợp với Firebase để tạo một ứng dụng di động hoặc web đơn giản. Ứng dụng này cho phép người dùng – ví dụ như nhân viên tại nông trại – chụp ảnh trái cây trực tiếp từ điện thoại, gửi lên hệ thống, và nhận kết quả phân loại ngay lập tức. Các kết quả này cũng có thể được lưu trữ trong thời gian thực, giúp ban quản lý theo dõi được chất lượng sản phẩm theo từng ngày, từng lô hàng.\nKhông chỉ giúp cải thiện quy trình, đề tài này còn mở ra cơ hội để sinh viên tìm hiểu thêm về Computer Vision, tích hợp AI vào sản phẩm thực tế, và nếu mở rộng, có thể phát triển thành sản phẩm thương mại hoặc giải pháp chuyển giao cho nhiều nông trại khác trong khu vực.\nVới dữ liệu thật, nhu cầu thật, và khả năng triển khai rõ ràng, đây là một đề tài AI lý tưởng cho sinh viên mới tiếp cận, và hoàn toàn có thể trở thành một phần quan trọng trong chiến lược chuyển đổi số nông nghiệp tại Đắk Lắk.\n• Hệ thống dự báo sâu bệnh, thời tiết theo cảm biến (IoT + ML)\nMột đề tài đặc biệt ý nghĩa trong bối cảnh nông nghiệp hiện đại tại Đắk Lắk, đó là xây dựng hệ thống dự báo sâu bệnh và thời tiết cho cây trồng bằng cách kết hợp công nghệ IoT với học máy – hay còn gọi là machine learning. Đây không chỉ là một bài toán công nghệ, mà còn là giải pháp trực tiếp giúp người nông dân phòng tránh rủi ro, tối ưu hóa quy trình chăm sóc cây trồng và nâng cao năng suất canh tác.\nTại các doanh nghiệp như Greed Farm, nhiều loại cây trồng có chu kỳ phát triển phụ thuộc chặt chẽ vào yếu tố môi trường như độ ẩm đất, nhiệt độ, ánh sáng, và lượng mưa. Ngoài ra, sự xuất hiện của sâu bệnh cũng thường liên quan đến các điều kiện bất lợi hoặc thay đổi đột ngột trong khí hậu. Để theo dõi và dự đoán những yếu tố này, doanh nghiệp có thể sử dụng các thiết bị cảm biến IoT được đặt trong khu vực canh tác – các thiết bị này có khả năng thu thập dữ liệu theo thời gian thực, như nhiệt độ không khí, độ ẩm đất, độ pH, lượng ánh sáng, và thậm chí hình ảnh của cây trồng.\nPhần việc mà sinh viên CNTT có thể tham gia chính là xử lý dữ liệu thu thập được từ các cảm biến, sử dụng Python và các thư viện học máy cơ bản như Scikit-learn hoặc TensorFlow để huấn luyện mô hình dự báo. Ví dụ, mô hình có thể học từ dữ liệu của các ngày trước đó để dự đoán khả năng phát sinh sâu bệnh vào ngày hôm sau, hoặc cảnh báo sớm nếu độ ẩm đất đang giảm nhanh – có thể dẫn đến stress nước cho cây trồng.\nSinh viên cũng có thể phát triển một giao diện dashboard đơn giản, sử dụng Streamlit hoặc Firebase để hiển thị trực quan các chỉ số như dự báo thời tiết, nguy cơ sâu bệnh, hay đề xuất tưới tiêu. Khi người nông dân hoặc kỹ sư nông nghiệp mở điện thoại, họ sẽ thấy ngay bản đồ khu vực trồng, các điểm đo môi trường, và nhận thông báo nếu có nguy cơ cao cần can thiệp.\nĐề tài này không chỉ giúp sinh viên hiểu cách xây dựng mô hình AI trên dữ liệu thực tế, mà còn cho thấy giá trị rõ ràng của công nghệ trong lĩnh vực nông nghiệp – một ngành quan trọng và giàu tiềm năng tại Đắk Lắk. Hơn nữa, đây cũng là đề tài lý tưởng để phát triển thành dự án nhóm giữa sinh viên CNTT và sinh viên nông nghiệp, hoặc mở rộng thành đề tài nghiên cứu – ứng dụng cấp trường, cấp tỉnh trong tương lai.\nVới xu hướng nông nghiệp bền vững và dữ liệu hóa, việc ứng dụng AI để dự báo và ra quyết định trong canh tác sẽ ngày càng trở thành tiêu chuẩn, và các bạn sinh viên hôm nay hoàn toàn có thể là người mở đường cho xu hướng đó ngay từ kỳ thực tập đầu tiên.\n• Dashboard AI tổng hợp dữ liệu vườn, ra quyết định canh tác\nMột đề tài mở rộng từ hệ thống cảm biến và dự báo mà sinh viên CNTT có thể triển khai tại các doanh nghiệp nông nghiệp như Greed Farm, đó là xây dựng một dashboard AI – hay bảng điều khiển thông minh – giúp tổng hợp dữ liệu từ vườn trồng và hỗ trợ ra quyết định canh tác. Đây là bước tiến từ việc chỉ giám sát sang quản trị nông trại một cách có chiến lược dựa trên dữ liệu, với sự hỗ trợ của trí tuệ nhân tạo.\nTrong quá trình chăm sóc cây trồng, người quản lý thường phải theo dõi rất nhiều chỉ số khác nhau như độ ẩm đất, mức ánh sáng, lượng mưa, nhiệt độ trung bình, tình trạng sinh trưởng, tỷ lệ sâu bệnh... Nếu không có công cụ tổng hợp, những dữ liệu này rơi rạc, khó phân tích và dễ bị bỏ sót thông tin quan trọng. Nhưng với một dashboard AI, toàn bộ thông tin này có thể được thu thập từ cảm biến IoT, lưu trữ trên nền tảng cloud (như Firebase hoặc Google Sheets), và trình bày lại một cách trực quan, dễ theo dõi theo từng ngày, từng khu vực trồng.\nPhần việc mà sinh viên có thể thực hiện là xây dựng hệ thống lấy dữ liệu từ các cảm biến đã có – hoặc mô phỏng dữ liệu nếu cảm biến chưa sẵn sàng – sau đó thiết kế một giao diện trực quan bằng Streamlit, Dash hoặc một app web đơn giản. Trên đó, người dùng có thể xem được xu hướng nhiệt độ trong 7 ngày qua, biểu đồ độ ẩm theo thời gian, hoặc cảnh báo khi một chỉ số nào đó vượt ngưỡng cho phép. Quan trọng hơn, sinh viên có thể tích hợp thêm các mô hình AI nhỏ để đề xuất hành động cụ thể, ví dụ như: “Gợi ý tưới nước cho khu vườn B vào sáng mai”, hoặc “Dự báo khả năng phát sinh nấm bệnh trong 2 ngày tới nếu độ ẩm tiếp tục cao”.\nMột dashboard như vậy không chỉ giúp doanh nghiệp theo dõi được tình trạng vườn trồng từ xa, mà còn giúp đưa ra quyết định chính xác hơn về lịch tưới, bón phân, hay thu hoạch. Về mặt học thuật, sinh viên được trải nghiệm cả ba kỹ năng quan trọng trong phát triển hệ thống AI ứng dụng: thu thập dữ liệu – xử lý dữ liệu – trình bày dữ liệu và hành động dựa trên dữ liệu.\nĐặc biệt, với những doanh nghiệp nông nghiệp đang muốn số hóa quản lý nhưng chưa có giải pháp phần mềm riêng, đây chính là cơ hội để sinh viên thể hiện năng lực, từ đó đề xuất triển khai thực tế, mở rộng quy mô và thậm chí thương mại hóa giải pháp nếu làm tốt.\nĐề tài này không chỉ là bài học lập trình hay học máy, mà còn là một bài học sâu sắc về cách AI và dữ liệu có thể thay đổi tư duy quản lý nông nghiệp, từ kinh nghiệm cảm tính sang mô hình dự báo khoa học – điều mà nông nghiệp Đắk Lắk đang rất cần trong giai đoạn phát triển bền vững.\n3. Với công ty phần mềm SME: Đề tài AI hỗ trợ lập trình viên – Gợi ý code tự động (Copilot-like)\n• Gợi ý code tự động (Copilot-like)\nTrong bối cảnh nhiều công ty phần mềm nhỏ tại Đắk Lắk đang phát triển theo mô hình outsourcing hoặc nhận dự án cho khách hàng trong và ngoài nước, việc tối ưu hoá thời gian lập trình là yếu tố then chốt để nâng cao năng suất. Một đề tài AI thiết thực mà sinh viên có thể đề xuất hoặc cùng phát triển trong môi trường thực tập đó là: xây dựng hệ thống gợi ý code tự động – tương tự như GitHub Copilot, nhưng ở quy mô nhỏ, tùy biến theo dự án của công ty.\nÝ tưởng ở đây là sử dụng mô hình ngôn ngữ lớn – như GPT – để hỗ trợ lập trình viên trong việc viết các đoạn code quen thuộc, tạo khung hàm, xử lý lỗi phổ biến hoặc gợi ý logic lập trình. Ví dụ, khi lập trình viên đang viết một REST API bằng Node.js, công cụ AI có thể gợi ý sẵn cấu trúc router, controller hoặc khung xử lý try-catch. Khi làm việc với React, AI có thể tự động điền phần useEffect hoặc gợi ý đoạn mã mẫu cho việc xử lý form, gọi API, và hơn thế nữa.\nSinh viên có thể bắt đầu đơn giản bằng cách xây dựng một plugin tích hợp với VS Code, sử dụng API của OpenAI hoặc Hugging Face. Plugin này có thể được thiết kế để tự động gửi đoạn code vừa nhập cùng với “câu hỏi ngầm” như: \"hoàn thành đoạn code này\", \"viết function xử lý logic này\", và hiển thị kết quả gợi ý ngay trong cửa sổ lập trình. Ngoài ra, nếu muốn giữ toàn bộ dữ liệu nội bộ, doanh nghiệp có thể cân nhắc dùng các mô hình mã nguồn mở như CodeBERT, StarCoder hoặc LLaMA 2 để huấn luyện trên mã nguồn riêng.\nĐiều đặc biệt thú vị là sinh viên có thể “huấn luyện nhẹ” mô hình gợi ý dựa trên mã nguồn thực tế của chính công ty đang thực tập. Điều này giúp hệ thống gợi ý trở nên phù hợp hơn, sát với phong cách lập trình, kiến trúc hệ thống, hoặc framework mà công ty đang sử dụng – ví dụ như Laravel, .NET, hoặc Flutter.\nNgoài việc tăng tốc độ lập trình, đề tài này còn giúp sinh viên hiểu rõ cách hoạt động của mô hình ngôn ngữ, cách tích hợp AI vào quy trình phát triển phần mềm, và tạo ra một công cụ nội bộ có giá trị lâu dài. Đối với doanh nghiệp, nếu triển khai hiệu quả, hệ thống này còn có thể trở thành lợi thế cạnh tranh, giúp tiết kiệm thời gian đào tạo, chuẩn hóa chất lượng code và cải thiện hiệu suất làm việc của đội ngũ lập trình viên.\nTừ một đề tài nhỏ trong kỳ thực tập, sinh viên hoàn toàn có thể mở rộng dự án này thành đề tài tốt nghiệp hoặc thậm chí là sản phẩm AI hỗ trợ lập trình thương mại hóa trong tương lai – một bước tiến từ thực tập tới sáng tạo và làm chủ công nghệ.\n• AI phân tích yêu cầu khách hàng, trích xuất thông tin chính\nMột đề tài AI khác rất sát với nhu cầu thực tế tại các công ty phần mềm nhỏ, đó là xây dựng công cụ hỗ trợ phân tích yêu cầu khách hàng và tự động trích xuất các thông tin chính. Trong môi trường outsourcing hoặc nhận dự án từ nhiều khách hàng khác nhau, việc đọc – hiểu – và bóc tách yêu cầu kỹ thuật từ email, tài liệu mô tả, hoặc bản brief của khách hàng là công việc tốn nhiều thời gian, và thường gây sai sót nếu không được chuẩn hóa.\nĐây chính là một bài toán mà AI, đặc biệt là các mô hình xử lý ngôn ngữ tự nhiên (NLP), có thể hỗ trợ hiệu quả. Với công cụ phù hợp, sinh viên hoàn toàn có thể phát triển một hệ thống cho phép nhân viên kỹ thuật tải lên một tài liệu yêu cầu (dưới dạng PDF, DOC hoặc text), và hệ thống AI sẽ phân tích nội dung, nhận diện các thông tin cốt lõi như: mục tiêu chức năng, tính năng chính, deadline, công nghệ yêu cầu, hay ràng buộc đặc biệt về bảo mật, giao diện, hiệu suất...\nCách tiếp cận có thể bắt đầu đơn giản bằng cách sử dụng GPT (hoặc các mô hình mã nguồn mở như Mistral hoặc LLaMA2) để “hỏi – đáp” theo văn bản đã tải lên. Kết hợp với kỹ thuật Retrieval-Augmented Generation (RAG), sinh viên có thể cho phép hệ thống truy xuất các đoạn văn bản có chứa thông tin quan trọng, sau đó tạo tóm tắt thông minh, thậm chí là biến yêu cầu tự nhiên thành cấu trúc JSON để lập trình viên dễ sử dụng.\nVí dụ, với một yêu cầu khách hàng viết bằng tiếng Việt: “Tôi muốn xây dựng một trang web cho cửa hàng thú cưng có thể đặt hàng online, đăng nhập tài khoản, và theo dõi tình trạng đơn hàng”, hệ thống AI có thể tự động rút ra:\n• Loại hệ thống: Website thương mại điện tử\n• Chức năng chính: Đặt hàng, quản lý tài khoản, theo dõi đơn hàng\n• Đối tượng người dùng: Khách mua hàng\n• Nền tảng đề xuất: Web responsive\n• Ngôn ngữ mô tả: Tiếng Việt\nNhững thông tin này có thể được trình bày rõ ràng trong một giao diện trực quan – giúp lập trình viên và quản lý dự án tiết kiệm thời gian đọc hiểu tài liệu, tăng độ chính xác khi chuyển giao công việc, và dễ dàng trao đổi lại với khách hàng.\nKhông dừng lại ở trích xuất thông tin, sinh viên cũng có thể tích hợp thêm AI hỗ trợ viết lại yêu cầu theo mẫu chuyên nghiệp, chuyển ý tưởng mơ hồ thành đặc tả có cấu trúc, hoặc đề xuất công nghệ phù hợp dựa trên từ khóa mô tả. Đây là dạng đề tài vừa tận dụng kỹ năng lập trình, vừa rèn luyện tư duy phân tích – phù hợp để nhóm sinh viên phát triển cùng giảng viên hướng dẫn và áp dụng ngay tại nơi thực tập.\nVề lâu dài, hệ thống này có thể được tích hợp vào quy trình nhận dự án của doanh nghiệp, giúp chuẩn hóa cách tiếp nhận yêu cầu, giảm rủi ro hiểu sai từ phía khách hàng, và chuyên nghiệp hóa toàn bộ quy trình làm phần mềm.\n• Tạo RAG chatbot nội bộ để hướng dẫn nhân viên mới\nMột đề tài đơn giản, dễ triển khai nhưng vô cùng thiết thực cho các công ty phần mềm nhỏ tại Đắk Lắk, đó là xây dựng một chatbot nội bộ – sử dụng kiến trúc RAG – để hỗ trợ hướng dẫn nhân viên mới. Đây là một bài toán có thật, bởi ở các công ty SME, mỗi năm có thể tiếp nhận nhiều thực tập sinh, nhân sự mới hoặc cộng tác viên, và việc hướng dẫn lặp lại từ đầu là điều không tránh khỏi.\nThay vì để các nhân viên kỳ cựu hoặc quản lý phải trả lời đi trả lời lại các câu hỏi quen thuộc như “project lưu ở đâu?”, “quy trình commit code thế nào?”, “sử dụng Jira ra sao?”, “mẫu báo cáo hằng tuần đâu rồi?”, công ty có thể tập hợp tất cả các tài liệu hướng dẫn nội bộ, quy định làm việc, quy trình vận hành… và để một chatbot thông minh đảm nhận vai trò hỗ trợ tự động.\nVề mặt kỹ thuật, đây chính là bài toán RAG – Retrieval-Augmented Generation, một trong những ứng dụng phổ biến và dễ tiếp cận nhất của AI hiện nay. Sinh viên thực tập hoàn toàn có thể xây dựng chatbot này bằng cách sử dụng các tài liệu có sẵn của công ty (PDF, DOCX, Markdown...), chia nhỏ nội dung thành từng đoạn, chuyển thành vector embedding bằng các công cụ như OpenAI Embedding API hoặc SentenceTransformers, sau đó lưu vào một vector database như FAISS hoặc ChromaDB.\nKhi người dùng – ở đây là nhân viên mới – đặt một câu hỏi tự nhiên như: “Cách chạy project React trên local?”, hoặc “Báo cáo tiến độ gửi qua đâu?”, hệ thống sẽ tìm đoạn văn bản phù hợp nhất từ tài liệu nội bộ, kết hợp với mô hình GPT để tạo ra câu trả lời tự nhiên, dễ hiểu và chính xác theo ngữ cảnh. Nhờ vậy, nhân viên mới có thể tự học, tự tìm hiểu, và giảm áp lực cho người hướng dẫn.\nSinh viên có thể triển khai chatbot này trên giao diện đơn giản bằng Streamlit, Telegram bot, hoặc tích hợp vào Slack/Discord nội bộ của công ty. Dự án cũng có thể phát triển thành dạng plugin hoặc widget nhúng trực tiếp vào cổng thông tin nội bộ.\nĐiều quan trọng là, ngoài kỹ năng lập trình và AI, sinh viên còn có cơ hội học hỏi thêm về cách tổ chức tài liệu, tối ưu trải nghiệm người dùng, và tư duy thiết kế hệ thống thực tế. Đây là một bài học rất gần với yêu cầu nghề nghiệp sau khi ra trường.\nNếu làm tốt, chatbot nội bộ này không chỉ phục vụ trong thời gian thực tập, mà còn có thể trở thành một phần chính thức trong hạ tầng hỗ trợ nhân sự của công ty. Thậm chí, nó còn có thể được mở rộng thành công cụ đào tạo nhân sự từ xa – một nhu cầu đang lên mạnh mẽ tại các doanh nghiệp vừa và nhỏ trong giai đoạn số hóa hiện nay.\n🤖 V. Hướng đề tài AI dễ triển khai (cho nhóm sinh viên và giảng viên)\n🔹 1. Chatbot tài liệu nội bộ\nMột trong những đề tài AI đơn giản nhưng có tính ứng dụng rất cao trong môi trường doanh nghiệp và giáo dục hiện nay là xây dựng chatbot nội bộ có khả năng đọc hiểu và trả lời câu hỏi từ tài liệu có sẵn. Đây là một giải pháp đặc biệt hữu ích trong các tổ chức thường xuyên tiếp nhận sinh viên thực tập, nhân viên mới hoặc có hệ thống tài liệu nội bộ phong phú nhưng khó tra cứu.\nThông thường, tài liệu hướng dẫn nội bộ như quy trình làm việc, nội quy thực tập, tài liệu kỹ thuật, hướng dẫn sử dụng phần mềm, thường được lưu dưới dạng file PDF, Word hoặc văn bản thuần túy. Tuy nhiên, khi có câu hỏi cụ thể như “báo cáo thực tập gửi ai?”, “cách chạy phần mềm kiểm thử nội bộ?”, hoặc “mẫu phân tích yêu cầu nằm ở đâu?”, người mới sẽ phải đọc hàng chục trang để tìm đúng thông tin. Việc này gây mất thời gian, dễ bỏ sót, và tạo áp lực cho người hướng dẫn.\nVới chatbot tài liệu nội bộ, toàn bộ khối tài liệu này sẽ được trích xuất, chia nhỏ theo đoạn, mã hóa thành vector embedding và lưu trữ vào một cơ sở dữ liệu đặc biệt gọi là vector database, như FAISS hoặc ChromaDB. Khi người dùng đặt câu hỏi, hệ thống sẽ tìm các đoạn tài liệu có nội dung liên quan, và kết hợp với mô hình ngôn ngữ lớn như GPT-3.5 hoặc GPT-4 để tạo ra câu trả lời tự nhiên, rõ ràng và chính xác theo ngữ cảnh.\nVí dụ, một sinh viên thực tập có thể hỏi: “Mẫu báo cáo tuần ở đâu?” – và chatbot sẽ phản hồi: “Bạn có thể sử dụng mẫu báo cáo tuần được đính kèm trong mục 3.2 của tài liệu 'Hướng dẫn thực tập 2025'. Mẫu này bao gồm thông tin về ngày, công việc đã làm, và đề xuất cải tiến.” Điều này không chỉ giúp tiết kiệm thời gian mà còn nâng cao trải nghiệm và hiệu quả làm việc trong môi trường nội bộ.\nVề mặt công nghệ, sinh viên có thể sử dụng LangChain – một framework mạnh mẽ hỗ trợ xây dựng pipeline xử lý dữ liệu văn bản, kết nối với mô hình GPT, và tạo giao diện chatbot đơn giản. Hệ thống có thể triển khai ngay trên Streamlit, Telegram bot, hoặc web app tích hợp vào nền tảng nội bộ của công ty.\nĐây là đề tài hoàn hảo cho nhóm sinh viên, trong đó có thể chia vai trò: người xử lý dữ liệu, người tích hợp giao diện, và người quản lý logic hội thoại. Đặc biệt, giảng viên có thể đóng vai trò kết nối với doanh nghiệp để cung cấp tài liệu thật, từ đó sinh viên có thể triển khai và thử nghiệm trực tiếp trong quá trình thực tập.\nChatbot tài liệu nội bộ không chỉ là một bài học AI đơn thuần, mà còn là minh chứng cho việc AI có thể giải quyết các vấn đề nhỏ nhưng thiết thực trong hoạt động hằng ngày của doanh nghiệp hoặc nhà trường. Với những công cụ sẵn có, sinh viên năm hai hoàn toàn có thể thực hiện được, và đây cũng có thể là bước khởi đầu cho các sản phẩm AI sâu hơn về sau.\n🔹 2. AI nông nghiệp\nTrong bối cảnh Đắk Lắk là một trong những vùng nông nghiệp trọng điểm của cả nước, việc đưa công nghệ, đặc biệt là trí tuệ nhân tạo (AI), vào sản xuất nông nghiệp không chỉ là xu hướng, mà đã trở thành một nhu cầu thiết thực. Đây cũng là cơ hội để sinh viên CNTT có thể tham gia vào các đề tài vừa gần gũi, vừa có tính thực tiễn rất cao. Một trong những đề tài đó là xây dựng hệ thống AI nhận diện hình ảnh cây trồng, phân loại trái cây, hoặc dự báo sâu bệnh dựa trên dữ liệu cảm biến.\nTại các nông trại như Greed Farm hay một số hợp tác xã nông nghiệp công nghệ cao ở Đắk Lắk, sản phẩm nông nghiệp thường cần phân loại thủ công theo mức độ chín, kích thước, màu sắc, hoặc loại bỏ những trái bị sâu, dập. Việc này không những tốn nhiều công sức mà còn thiếu nhất quán. Bài toán đặt ra là: liệu AI có thể “nhìn” và “phân biệt” được những điều đó thay con người không? Câu trả lời là hoàn toàn có thể.\nVới những công cụ đơn giản như Teachable Machine của Google, sinh viên có thể bắt đầu bằng việc thu thập hình ảnh của các loại trái cây ở các mức độ khác nhau – ví dụ như chín – chưa chín – hư hỏng – hoặc đạt và không đạt tiêu chuẩn. Chỉ cần vài chục bức ảnh, hệ thống đã có thể được huấn luyện để phân biệt các loại hình ảnh một cách tự động. Sau đó, sinh viên có thể tích hợp mô hình này vào một ứng dụng web hoặc di động bằng Firebase, để nông dân có thể chụp ảnh trái cây và nhận phản hồi tức thì.\nỞ mức độ cao hơn, sinh viên có thể sử dụng TensorFlow hoặc OpenCV để xây dựng hệ thống có khả năng xử lý hình ảnh từ camera cố định tại nông trại, hoặc ảnh chụp định kỳ từ thiết bị di động. Với các kỹ thuật như phân đoạn ảnh, trích xuất đặc trưng màu sắc, hình dạng, hoặc học sâu, hệ thống có thể phân tích cây trồng ở từng giai đoạn sinh trưởng và đưa ra cảnh báo nếu phát hiện dấu hiệu bất thường.\nKhông chỉ dừng ở hình ảnh, đề tài cũng có thể mở rộng sang hướng phân tích dữ liệu cảm biến từ môi trường, chẳng hạn như độ ẩm đất, nhiệt độ không khí, hoặc ánh sáng – từ đó dự báo nguy cơ phát sinh sâu bệnh. Mô hình học máy đơn giản, kết hợp với dashboard hiển thị dữ liệu, có thể giúp người nông dân ra quyết định tốt hơn, như tưới tiêu đúng lúc hoặc phòng ngừa sớm dịch bệnh trên cây.\nĐiều quan trọng là, đề tài AI nông nghiệp không đòi hỏi sinh viên phải làm ra sản phẩm hoàn chỉnh ngay lập tức. Chỉ cần xây dựng một nguyên mẫu hoạt động được (prototype), chứng minh được khả năng phân loại cơ bản hoặc cảnh báo đơn giản, đã là một bước tiến lớn trong việc đưa AI đến gần hơn với đời sống sản xuất nông nghiệp ở địa phương.\nVới sự kết hợp giữa kiến thức lập trình, học máy, và hiểu biết về nhu cầu thực tế, đây sẽ là một trong những hướng đề tài dễ triển khai nhất cho sinh viên năm hai, đồng thời cũng là bước khởi đầu để phát triển các sản phẩm nông nghiệp thông minh quy mô nhỏ – vừa học, vừa giúp cộng đồng.\n🔹 3. Trợ lý đào tạo số (AI tutor)\nTrong môi trường giáo dục hiện đại, sinh viên không chỉ học từ giảng viên trên lớp mà còn cần khả năng tự học, tra cứu và giải đáp thắc mắc nhanh chóng từ nguồn học liệu số. Tuy nhiên, với lượng tài liệu ngày càng nhiều như slide bài giảng, giáo trình PDF, hướng dẫn môn học và các thông báo từ nhà trường, việc tìm đúng thông tin khi cần thiết là một thách thức. Đây chính là lúc trợ lý đào tạo số – AI tutor phát huy vai trò của mình.\nĐề tài này hướng tới việc xây dựng một hệ thống Q&A tự động, nơi sinh viên có thể đặt câu hỏi về môn học, nội dung bài giảng hoặc yêu cầu học vụ, và nhận được câu trả lời chính xác, được trích xuất từ chính các tài liệu của nhà trường. Ví dụ, khi sinh viên hỏi “Cách tính điểm giữa kỳ môn Cơ sở dữ liệu?”, chatbot sẽ tìm đoạn liên quan trong đề cương môn học hoặc slide buổi đầu và trả lời đúng theo nội dung được giảng viên ban hành.\nVề mặt kỹ thuật, đề tài sử dụng mô hình RAG – Retrieval-Augmented Generation, kết hợp giữa GPT (mô hình ngôn ngữ lớn) và cơ sở dữ liệu vector chứa nội dung tài liệu học tập. Các bước triển khai gồm: thu thập tài liệu (PDF, DOCX, slide), chia nhỏ nội dung thành từng đoạn, chuyển sang dạng vector embedding bằng OpenAI hoặc HuggingFace, lưu trữ vào vector database như Pinecone, FAISS hoặc ChromaDB, và sau đó kết nối với LangChain để xây dựng giao diện hỏi – đáp.\nĐiểm mạnh của mô hình này là: hệ thống không “bịa” thông tin, mà chỉ tạo câu trả lời từ chính nguồn tài liệu do giảng viên hoặc nhà trường cung cấp. Điều đó vừa đảm bảo tính chính xác, vừa tránh gây nhầm lẫn cho người học. Sinh viên có thể hỏi bất kỳ lúc nào, từ bất kỳ đâu – qua website khoa, ứng dụng LMS, hay chatbot trên Zalo hoặc Facebook Messenger – và nhận được câu trả lời gần như tức thì.\nĐây là một đề tài rất phù hợp cho các nhóm sinh viên thực tập tại bộ môn, phòng đào tạo, hoặc các trung tâm hỗ trợ sinh viên. Nhóm có thể chia vai trò rõ ràng: người xử lý tài liệu, người lập trình backend, người xây dựng giao diện, và người kiểm thử nội dung. Nếu phối hợp với giảng viên hướng dẫn, đề tài có thể được áp dụng thử nghiệm ngay trong một học phần cụ thể, từ đó hoàn thiện dần và nhân rộng cho các môn khác.\nQuan trọng hơn, đề tài AI tutor này không chỉ giúp người học thuận tiện hơn, mà còn góp phần giảm tải cho giảng viên và bộ phận học vụ, đồng thời thúc đẩy quá trình chuyển đổi số trong nhà trường. Với quy mô nhỏ, công nghệ mã nguồn mở sẵn có và tài liệu thực tế dễ tiếp cận, đây là một hướng đi rất khả thi cho sinh viên năm 2 bắt đầu tìm hiểu và ứng dụng AI một cách thực tế và đầy ý nghĩa.\n🔹 4. Ứng dụng AI không-code / low-code\nKhông phải sinh viên nào cũng giỏi lập trình hoặc có điều kiện tiếp cận các công cụ học máy phức tạp. Tuy nhiên, điều đó không có nghĩa là họ không thể tạo ra những ứng dụng AI hữu ích. Với sự phát triển của các nền tảng không-code (no-code) và ít-code (low-code), sinh viên năm hai hoàn toàn có thể xây dựng các sản phẩm ứng dụng trí tuệ nhân tạo một cách trực quan, dễ dàng và nhanh chóng – mà không cần viết nhiều dòng lệnh.\nMột trong những hệ sinh thái mạnh mẽ nhất hiện nay cho hướng đi này là Microsoft Power Platform, bao gồm các công cụ như PowerApps, AI Builder và Copilot Studio. Đây là những nền tảng cho phép kéo-thả để xây dựng ứng dụng, chatbot, và tích hợp các tính năng AI như nhận dạng văn bản, dịch ngôn ngữ, phân tích cảm xúc, trích xuất thông tin từ hóa đơn, đơn hàng hoặc tài liệu scan.\nVới PowerApps, sinh viên có thể tạo ra các ứng dụng quản lý nội bộ như: ghi danh thực tập sinh, theo dõi tiến độ công việc, hoặc quản lý đơn đăng ký. Khi kết hợp với AI Builder, những ứng dụng này có thể thông minh hơn – ví dụ như tự động nhận diện nội dung từ ảnh chụp tài liệu, phân loại phản hồi của người dùng, hoặc phát hiện bất thường trong chuỗi văn bản.\nNgoài ra, Copilot Studio (trước đây gọi là Power Virtual Agents) cho phép sinh viên tạo chatbot nội bộ chỉ trong vài bước kéo-thả, sử dụng ngôn ngữ tự nhiên và dễ dàng tích hợp vào Microsoft Teams, trang web nội bộ hoặc Zalo OA thông qua API trung gian. Những chatbot này có thể dùng để hỗ trợ nhân viên mới, trả lời câu hỏi thường gặp, hoặc hướng dẫn thực hiện quy trình đơn giản trong doanh nghiệp.\nHướng tiếp cận không-code này rất phù hợp với các doanh nghiệp vừa và nhỏ ở Đắk Lắk – nơi nguồn lực kỹ thuật còn hạn chế nhưng vẫn mong muốn ứng dụng công nghệ AI vào hoạt động thực tế. Do đó, nếu sinh viên mang theo kiến thức về Power Platform trong kỳ thực tập, các bạn hoàn toàn có thể đề xuất và xây dựng những công cụ AI nhỏ giúp doanh nghiệp tự động hóa một phần công việc, nâng cao hiệu quả mà không cần đầu tư hạ tầng lớn.\nĐây cũng là cơ hội để sinh viên có định hướng về quản trị hệ thống, phân tích nghiệp vụ hoặc thiết kế UI/UX thể hiện năng lực – vì họ sẽ đóng vai trò cầu nối giữa nhu cầu thực tế của doanh nghiệp và công cụ AI phù hợp.\nVới chi phí hầu như bằng 0 cho sinh viên và trường học (nhờ chính sách hỗ trợ giáo dục của Microsoft), đây là hướng đi cực kỳ khả thi, dễ tiếp cận và có thể hoàn thành sản phẩm trong thời gian thực tập ngắn hạn. Quan trọng hơn, đó là một bước đi thông minh để bắt đầu hành trình khám phá AI theo hướng ứng dụng mà không cần nền tảng kỹ thuật chuyên sâu.\n🔹 5. Phân tích cảm xúc và kỹ năng giao tiếp\nTrong thời đại số, không chỉ dữ liệu số liệu, mà cả dữ liệu ngôn ngữ – như email, tin nhắn, phản hồi biểu mẫu – cũng là tài nguyên quý giá để doanh nghiệp và tổ chức giáo dục hiểu được cảm xúc, nhu cầu và khả năng giao tiếp của người học hoặc người lao động. Đây chính là cơ hội để sinh viên CNTT thực hiện một đề tài AI rất thiết thực: xây dựng hệ thống phân tích cảm xúc và đánh giá kỹ năng giao tiếp dựa trên văn bản.\nĐề tài này có thể áp dụng trong nhiều tình huống: trong trường học, hệ thống có thể dùng để đọc và phân tích nội dung phản hồi của sinh viên sau mỗi buổi học, xác định mức độ hài lòng, mối quan tâm, hoặc dấu hiệu căng thẳng. Trong doanh nghiệp, hệ thống có thể được dùng để đọc email khách hàng, phân loại mức độ hài lòng, hoặc hỗ trợ phòng nhân sự trong việc phân tích hồ sơ ứng viên, đánh giá thư xin việc, email trao đổi để hiểu phong cách và kỹ năng ngôn ngữ.\nVề công nghệ, sinh viên có thể sử dụng các công cụ khá nhẹ và dễ học như TextBlob để phân tích cảm xúc (tích cực – tiêu cực – trung tính), hoặc áp dụng mô hình phân tích cảm xúc từ Hugging Face để xử lý những văn bản phức tạp hơn, có thể chứa mâu thuẫn hoặc ngữ cảnh đa chiều. Với những nhóm có kỹ năng tốt hơn, sinh viên có thể dùng OpenAI GPT API để tạo một hệ thống “người đánh giá ảo”, mô phỏng cách một nhà tuyển dụng hoặc giảng viên nhận xét một đoạn văn bản, chẳng hạn như: “Nội dung phản hồi này cho thấy sinh viên hơi lúng túng về cách triển khai nhóm, và cần hỗ trợ thêm kỹ năng làm việc nhóm.”\nỨng dụng này cũng có thể tích hợp vào biểu mẫu khảo sát trực tuyến, giúp tự động phân tích hàng trăm phản hồi mà không cần đọc từng cái. Hoặc dùng trong các hệ thống đánh giá sinh viên thực tập, khi các bạn nộp nhật ký thực tập hoặc tự đánh giá cuối kỳ – AI có thể xác định thái độ, giọng điệu, khả năng trình bày, và từ đó hỗ trợ giảng viên đưa ra phản hồi nhanh hơn, chính xác hơn.\nĐiểm mạnh của đề tài là dễ bắt đầu, vì chỉ cần dữ liệu văn bản – vốn có rất nhiều trong môi trường học tập và làm việc. Sinh viên cũng không cần xây dựng mô hình từ đầu, mà có thể dùng sẵn các API hoặc thư viện mã nguồn mở để xử lý. Tuy nhiên, dự án vẫn mang lại giá trị cao vì giúp chuyển dữ liệu phản hồi rời rạc thành thông tin có ý nghĩa, hỗ trợ ra quyết định trong giáo dục, nhân sự, và chăm sóc khách hàng.\nĐây là một đề tài đặc biệt phù hợp cho nhóm sinh viên yêu thích NLP (xử lý ngôn ngữ tự nhiên), và có thể mở rộng thành các ứng dụng như gợi ý cải thiện kỹ năng viết, chatbot phản hồi tâm lý sinh viên, hay công cụ đánh giá độ phù hợp văn hóa trong tuyển dụng.\nVới sự phát triển của các mô hình ngôn ngữ ngày càng mạnh mẽ, việc khai thác ngữ nghĩa, cảm xúc và phong cách giao tiếp đang trở thành một hướng đi quan trọng – và sinh viên hoàn toàn có thể tiên phong trong việc đưa AI vào lĩnh vực này, bắt đầu từ kỳ thực tập nhỏ nhưng đầy tiềm năng.\n🎯 VI. Cách tiếp cận AI cho sinh viên năm 2\n• Dùng công cụ đơn giản: Teachable Machine, chatbot mẫu\nVới sinh viên năm 2 ngành Công nghệ Thông tin, việc tiếp cận AI đôi khi có thể gây cảm giác choáng ngợp – đặc biệt khi nghe đến những thuật ngữ như học sâu, xử lý ngôn ngữ tự nhiên, hay mô hình ngôn ngữ lớn. Tuy nhiên, thực tế cho thấy bạn không cần chờ đến năm cuối hay phải học xong nhiều môn lý thuyết mới có thể bắt đầu với AI. Điều quan trọng là biết chọn đúng điểm bắt đầu, và chọn đúng công cụ phù hợp với trình độ hiện tại.\nGợi ý đầu tiên chính là sử dụng các công cụ đơn giản, trực quan, và không đòi hỏi lập trình phức tạp. Một ví dụ tiêu biểu là Teachable Machine của Google – một nền tảng cho phép bạn huấn luyện mô hình phân loại hình ảnh, âm thanh hoặc cử chỉ chỉ bằng cách thu thập dữ liệu và bấm nút “Train”. Trong chưa đến 30 phút, bạn có thể tạo ra một hệ thống nhận diện trái cây, phân biệt trạng thái cây trồng, hoặc chấm điểm cảm xúc khuôn mặt – những bài toán rất gần với thực tế doanh nghiệp ở Đắk Lắk.\nSong song đó, sinh viên cũng có thể bắt đầu với các mẫu chatbot AI đã có sẵn, chẳng hạn như chatbot sử dụng GPT được tích hợp qua Dialogflow, Zalo OA, hoặc nền tảng như Copilot Studio của Microsoft. Chỉ cần làm quen với vài cấu hình cơ bản, bạn đã có thể xây dựng được một chatbot biết trả lời câu hỏi nội quy, nhắc lịch học, hoặc hướng dẫn thao tác trong hệ thống học tập – tất cả đều có thể triển khai ngay trong quá trình thực tập nhận thức.\nBí quyết ở đây là: đừng cố “chạy theo” các thuật toán phức tạp ban đầu, mà hãy tập trung vào hiểu nhu cầu của doanh nghiệp nơi bạn thực tập. Sau đó, dùng công cụ AI đơn giản để giải một phần nhỏ của vấn đề. Có thể là một demo chatbot nội quy, một mô hình phân loại ảnh cây trồng chín – chưa chín, hoặc một form khảo sát có AI phân tích cảm xúc. Mỗi bước nhỏ như vậy đều đang đưa bạn tiến gần hơn đến việc làm chủ công nghệ AI.\nViệc khởi động sớm không chỉ giúp bạn tự tin hơn khi đối mặt với thuật ngữ AI trong những môn học sau này, mà còn mở ra cơ hội để hình thành đề tài tốt nghiệp, ý tưởng nghiên cứu, thậm chí là sản phẩm khởi nghiệp về sau. Quan trọng nhất, khi bạn thể hiện được khả năng ứng dụng AI dù ở mức cơ bản, bạn đã tạo nên ấn tượng chuyên nghiệp trong mắt doanh nghiệp và giảng viên hướng dẫn.\nVới cách tiếp cận đúng đắn – bắt đầu từ công cụ đơn giản, bài toán thực tế, và tinh thần khám phá – sinh viên năm 2 hoàn toàn có thể đi bước đầu vào thế giới AI, một cách chủ động, hiệu quả và đầy hứng khởi.\n• Thử làm demo nhỏ (nhận diện hình ảnh, chatbot đơn giản)\nSau khi đã bước đầu làm quen với các công cụ AI đơn giản như Teachable Machine hay chatbot mẫu, bước tiếp theo mà sinh viên năm 2 hoàn toàn có thể thực hiện là tự tay làm một demo nhỏ, một sản phẩm thử nghiệm đơn giản nhưng cụ thể – từ đó rút ra kinh nghiệm và hiểu sâu hơn cách AI vận hành trong thực tế.\nMột gợi ý quen thuộc, dễ bắt đầu, đó là dự án nhận diện hình ảnh đơn giản. Ví dụ, bạn có thể xây dựng một mô hình phân biệt các loại trái cây chín và chưa chín, hay nhận diện hình ảnh lá cây bị sâu bệnh – chỉ với một bộ ảnh vài chục tấm, và công cụ Teachable Machine của Google. Sau khi huấn luyện xong, bạn có thể xuất mô hình thành tệp JavaScript và tích hợp vào một trang web đơn giản để chạy thử. Đây là dạng demo mà bất kỳ sinh viên nào cũng có thể thực hiện, dù chỉ mới học HTML, CSS cơ bản.\nMột ví dụ khác là tạo chatbot hỏi – đáp đơn giản từ nội dung có sẵn, như nội quy thực tập, hướng dẫn báo cáo, hoặc thông tin cơ bản về môn học. Bạn có thể dùng Dialogflow hoặc Copilot Studio, tạo các “câu hỏi – câu trả lời” theo tình huống thường gặp, rồi kết nối với Zalo OA hoặc nền tảng web. Với vài thao tác cấu hình, bạn đã có thể tạo nên một trợ lý ảo phục vụ sinh viên mới, nhân viên mới hoặc người dùng của tổ chức.\nĐiểm quan trọng không nằm ở việc sản phẩm có phức tạp hay không, mà ở chỗ bạn đã chủ động bắt tay vào làm. Việc tạo một demo nhỏ sẽ giúp bạn hiểu sâu hơn về logic xử lý dữ liệu, cách đưa AI vào quy trình thực tế, cũng như những khó khăn có thể gặp phải – ví dụ như chất lượng dữ liệu đầu vào, tốc độ phản hồi, hay cách xử lý ngoại lệ khi người dùng đặt câu hỏi ngoài kịch bản.\nMỗi sản phẩm demo dù đơn giản cũng chính là nền tảng để bạn trình bày với doanh nghiệp nơi thực tập, thể hiện năng lực và sự chủ động của bản thân. Nếu được công ty đánh giá cao, demo đó hoàn toàn có thể được mở rộng thành đề tài thực tập, đồ án nhóm, hoặc sản phẩm chuyển giao thực sự trong thời gian sau này.\nVì thế, đừng đợi đến khi học xong môn học về AI mới bắt đầu. Hãy tự tạo một sản phẩm nho nhỏ của riêng mình ngay trong kỳ thực tập nhận thức này, và biến nó thành viên gạch đầu tiên trong hành trình làm chủ công nghệ trí tuệ nhân tạo.\n• Hợp tác nhóm: frontend + backend + AI\nSau khi đã thử sức với các demo đơn giản, bước tiếp theo để tiến xa hơn với AI trong môi trường thực tập chính là làm việc nhóm – kết hợp giữa các vai trò frontend, backend và AI. Đây không chỉ là cách làm phổ biến trong các dự án thật ở doanh nghiệp, mà còn giúp sinh viên rèn kỹ năng phối hợp, hiểu rõ luồng phát triển sản phẩm, và tập trung chuyên sâu vào thế mạnh cá nhân.\nTrong một nhóm sinh viên thực tập, bạn có thể phân chia vai trò như sau: một người phụ trách giao diện người dùng – hay còn gọi là frontend, một người đảm nhiệm phần máy chủ – tức backend, và một người tập trung vào phần xử lý dữ liệu và AI. Với mô hình này, nhóm có thể xây dựng một hệ thống hoàn chỉnh – chẳng hạn như chatbot nội bộ, công cụ phân loại ảnh nông nghiệp, hay dashboard phân tích tương tác học sinh.\nNgười làm frontend có thể dùng công nghệ như React hoặc Vue để tạo ra giao diện web thân thiện, dễ sử dụng – nơi người dùng có thể nhập câu hỏi, tải hình ảnh hoặc xem kết quả. Người làm backend sẽ xây dựng phần API – dùng Node.js, Laravel hoặc Firebase – để xử lý dữ liệu từ frontend, giao tiếp với hệ thống AI hoặc cơ sở dữ liệu.\nNgười đảm nhiệm phần AI sẽ lo khâu huấn luyện mô hình, xử lý dữ liệu văn bản hoặc hình ảnh, kết nối với GPT, FAISS hoặc các thư viện AI khác như TensorFlow, Hugging Face. Đây cũng là người sẽ làm việc với các mô hình RAG, hoặc điều chỉnh cách chatbot truy vấn thông tin.\nLàm việc nhóm theo mô hình này giúp sinh viên hiểu rằng AI không “tự hoạt động” – mà cần được tích hợp khéo léo vào toàn bộ hệ thống sản phẩm. Đồng thời, bạn sẽ học cách giao tiếp kỹ thuật giữa các vai trò, quản lý mã nguồn chung (qua Git), và xây dựng quy trình phát triển giống như cách mà các startup hoặc doanh nghiệp nhỏ đang làm.\nNếu được hỗ trợ từ giảng viên hoặc mentor doanh nghiệp, nhóm còn có thể dùng Trello, Jira để phân chia công việc, lên kế hoạch từng sprint nhỏ theo mô hình Agile, và tạo ra một sản phẩm demo hoàn chỉnh chỉ trong vài tuần thực tập.\nĐiều quan trọng nhất, làm nhóm theo hướng này không chỉ giúp sinh viên thể hiện năng lực cá nhân, mà còn tạo nền tảng để xây dựng đề tài tốt nghiệp chất lượng, có thể mở rộng thành sản phẩm thật hoặc startup nhỏ. Từ một ý tưởng đơn giản, nếu phối hợp tốt, nhóm hoàn toàn có thể tạo nên thứ gì đó hữu ích và thực tế – không chỉ để “nộp”, mà để được sử dụng thật.\n• 🔹 Kết hợp với giảng viên hướng dẫn và doanh nghiệp để thành đề tài tốt nghiệp \nSau khi đã có một demo AI đơn giản, hoặc một sản phẩm nhóm gồm frontend – backend – AI tích hợp, sinh viên hoàn toàn có thể nghĩ xa hơn một bước: biến những gì đã làm trong thực tập nhận thức thành đề tài tốt nghiệp có chiều sâu và giá trị thực tiễn. Điều này không chỉ giúp sinh viên tiết kiệm thời gian và công sức khi bước vào năm cuối, mà còn tạo ra một sản phẩm có khả năng ứng dụng thật, thay vì chỉ làm để \"bảo vệ xong rồi bỏ\".\nCách tiếp cận hiệu quả nhất là kết nối sớm với giảng viên hướng dẫn và doanh nghiệp nơi thực tập, để cùng xác định xem vấn đề thực tế nào đang tồn tại và có thể chuyển hóa thành đề tài nghiên cứu – phát triển. Ví dụ, nếu doanh nghiệp đang gặp khó khăn trong việc quản lý tài liệu nội bộ, chatbot AI do sinh viên xây dựng có thể được nâng cấp thành đề tài \"Xây dựng hệ thống trợ lý số nội bộ dùng mô hình RAG tích hợp GPT\". Nếu là hợp tác xã nông nghiệp, đề tài có thể là \"Ứng dụng học máy trong phân loại chất lượng trái cây dựa trên ảnh thực tế từ vườn trồng\".\nGiảng viên sẽ là người hỗ trợ sinh viên điều chỉnh phạm vi đề tài, đảm bảo phù hợp với yêu cầu chuyên môn, đồng thời giúp định hướng các phần nội dung cần triển khai thêm – như khảo sát người dùng, kiểm thử độ chính xác, đánh giá hiệu suất hoặc đề xuất hướng mở rộng trong tương lai. Doanh nghiệp có thể cung cấp dữ liệu thật, môi trường chạy thử, hoặc phản hồi người dùng, giúp đề tài không chỉ mang tính học thuật mà còn gắn sát với nhu cầu thực tế.\nĐặc biệt, nếu sinh viên xây dựng được nhóm làm việc từ giai đoạn thực tập, thì việc tiếp tục hợp tác để hoàn thiện đề tài tốt nghiệp sẽ thuận lợi hơn rất nhiều. Các bạn đã hiểu nhau, chia vai trò rõ ràng, và có trải nghiệm thực tế ban đầu để làm nền tảng cho việc phát triển sâu hơn trong học kỳ cuối.\nTóm lại, thực tập nhận thức không chỉ là một hoạt động quan sát – mà là một cơ hội để bắt đầu định hình đề tài, hướng nghiên cứu, và thậm chí cả con đường nghề nghiệp trong lĩnh vực AI ứng dụng. Khi có sự đồng hành của giảng viên và doanh nghiệp, mỗi bước đi nhỏ trong kỳ thực tập hôm nay hoàn toàn có thể trở thành một bước nhảy lớn cho thành công ngày mai.\n🔹 Kết hợp đề tài với thực tế doanh nghiệp đang thực tập\nMột trong những cách tốt nhất để biến kỳ thực tập nhận thức thành một cơ hội thực sự có giá trị, đó là kết hợp đề tài học tập của bạn với bài toán thực tế của doanh nghiệp mà bạn đang thực tập. Đây không chỉ là cơ hội để bạn rèn luyện kỹ năng kỹ thuật, mà còn giúp bạn tạo ra sản phẩm có thể được sử dụng, triển khai thật – điều rất hiếm có nếu chỉ học trong môi trường lý thuyết.\nĐiều đầu tiên cần làm là lắng nghe và quan sát kỹ trong quá trình thực tập: doanh nghiệp đang gặp vướng mắc ở đâu? Có công việc nào đang làm thủ công, tốn thời gian? Có tài liệu nào cần tự động hóa? Có dữ liệu nào đang được ghi chép nhưng chưa được khai thác? Đó chính là mảnh đất màu mỡ cho các ý tưởng đề tài AI.\nVí dụ, nếu bạn thực tập ở một công ty phần mềm và thấy họ phải đọc rất nhiều tài liệu yêu cầu từ khách hàng, bạn có thể đề xuất một công cụ AI trích xuất thông tin từ yêu cầu dự án. Nếu công ty đang đào tạo nhân sự mới, bạn có thể gợi ý xây dựng chatbot nội bộ hỏi – đáp quy trình làm việc. Hoặc nếu công ty có dữ liệu từ khách hàng mà chưa phân tích, bạn có thể tạo AI phân tích cảm xúc trong phản hồi khách hàng.\nTại các doanh nghiệp nông nghiệp, như Greed Farm, bạn có thể đề xuất làm mô hình AI phân loại trái cây, giám sát vườn qua ảnh, hay dự báo sâu bệnh dựa trên cảm biến môi trường. Tất cả những đề tài này đều không cần nguồn lực lớn, nhưng nếu chọn đúng điểm bắt đầu và triển khai tinh gọn, vẫn tạo ra giá trị thật cho doanh nghiệp.\nĐiểm mạnh nhất của cách tiếp cận này là: đề tài của bạn không còn là sản phẩm “học để nộp”, mà trở thành một giải pháp nhỏ nhưng thực dụng trong mắt doanh nghiệp. Khi bạn trình bày đề tài tốt nghiệp sau này, bạn không chỉ nói về “mục tiêu nghiên cứu”, mà còn có thể nói: “Tôi đã thử nghiệm nó trong công ty A, họ đang dùng nó hằng tuần, và tôi nhận được phản hồi như thế này…”\nSự kết nối giữa đề tài và thực tế cũng giúp bạn được đánh giá cao hơn bởi giảng viên, vì tính ứng dụng và bối cảnh thực tế luôn là điểm cộng lớn trong các hội đồng chấm tốt nghiệp. Thậm chí, nếu làm tốt, đề tài đó có thể trở thành tiền đề cho sản phẩm khởi nghiệp nhỏ, hoặc được doanh nghiệp tiếp tục đầu tư phát triển.\nTóm lại, thực tập không chỉ là quan sát – đó là một cơ hội để hiểu vấn đề, và biến nó thành đề tài của riêng bạn. Khi bạn bắt đầu bằng một vấn đề thật, trong một tổ chức thật, và kết thúc bằng một giải pháp có thể dùng được, bạn đã bước ra khỏi khuôn khổ của “một sinh viên năm hai” và bắt đầu hành trình làm chủ công nghệ theo cách rất thực tế và rất thuyết phục.\n📚 VII. Tài liệu & khóa học gợi ý\nĐể giúp sinh viên chủ động học thêm và từng bước làm chủ các công cụ AI đã được giới thiệu trong tài liệu, dưới đây là một số tài nguyên chất lượng, dễ tiếp cận và hoàn toàn miễn phí hoặc rất nhẹ về chi phí:\n📘 Sách gợi ý (dành cho người mới bắt đầu và sinh viên)\n• Generative AI Apps with LangChain and Python – Rabi Jay\n→ Một hướng dẫn thực chiến giúp bạn hiểu cách xây dựng ứng dụng AI thực tế như chatbot, hệ thống hỏi – đáp từ tài liệu nội bộ (RAG) bằng Python và LangChain.\n• Learning LangChain – Mayo Oshin\n→ Cuốn sách ngắn gọn, dễ hiểu, giúp bạn nắm được các khái niệm cốt lõi về cách kết nối LLM (như GPT) với dữ liệu thật, từ cơ bản đến ứng dụng.\n• AI for Small Business – Phil Pallen (bản tiếng Việt)\n→ Phù hợp với những bạn muốn tìm hiểu cách doanh nghiệp nhỏ ứng dụng AI để tăng hiệu quả vận hành, từ marketing đến chăm sóc khách hàng – rất gần gũi với bối cảnh ở Đắk Lắk.\n🎓 Khóa học miễn phí nên thử ngay\n• Google Teachable Machine\n→ Nền tảng trực quan để học cách huấn luyện mô hình phân loại ảnh hoặc âm thanh chỉ trong vài phút, không cần viết mã. Rất phù hợp để làm demo AI đầu tay.\n• LangChain Crash Course (LangChain Handbook)\n→ Tài liệu và video hướng dẫn miễn phí giúp bạn tạo chatbot AI sử dụng mô hình GPT và dữ liệu văn bản của riêng bạn.\n• DeepLearning.AI: LangChain – Chat with Your Data\n→ Một khóa học ngắn trên nền tảng Coursera, được thiết kế bởi nhóm của Andrew Ng, giúp bạn học cách xây dựng hệ thống hỏi – đáp từ tài liệu PDF sử dụng GPT + RAG.\n\nTrong thời đại AI đang len lỏi vào mọi ngành nghề, từ nông nghiệp, giáo dục đến phát triển phần mềm, sinh viên CNTT không thể đứng ngoài cuộc. Tài liệu này được xây dựng để giúp sinh viên năm 2 – dù chưa học AI bài bản – vẫn có thể hiểu rõ bối cảnh, chọn đúng công cụ, và tự tin bắt đầu hành trình khám phá AI thông qua kỳ thực tập nhận thức.\nBằng cách sử dụng các công cụ đơn giản như Teachable Machine, GPT API, LangChain, kết hợp với quan sát thực tế tại doanh nghiệp, sinh viên hoàn toàn có thể:\n• Tạo ra những demo AI nhỏ nhưng hữu ích,\n• Làm việc nhóm hiệu quả trong vai trò frontend – backend – AI,\n• Và đặc biệt, biến những vấn đề thực tế tại nơi thực tập thành đề tài tốt nghiệp có tính ứng dụng cao.\nQuan trọng hơn, tài liệu không chỉ trang bị kiến thức, mà còn trao cho sinh viên một tư duy làm chủ: bắt đầu từ công cụ đơn giản, học từ thực tế, và từng bước nâng cao năng lực AI – một kỹ năng không thể thiếu trong thế hệ kỹ sư công nghệ mới.\nHy vọng tài liệu này sẽ không chỉ dừng lại ở “đọc để biết”, mà là một khởi đầu cho nhiều sản phẩm, đề tài, và trải nghiệm đáng nhớ trên hành trình thực tập và trưởng thành của các bạn.\n\n"
]